[null,{"month":"1","num":1,"link":"","year":"2006","news":"","safe_title":"Barrel - Part 1","transcript":"[[A boy sits in a barrel which is floating in an ocean.]]\nBoy: I wonder where I'll float next?\n[[The barrel drifts into the distance. Nothing else can be seen.]]\n{{Alt: Don't we all.}}","alt":"Don't we all.","img":"https://imgs.xkcd.com/comics/barrel_cropped_(1).jpg","title":"Barrel - Part 1","day":"1"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"1","num":44,"link":"","year":"2006","news":"","safe_title":"Love","transcript":"[[A man and a woman stand facing one another]]\nMan: I love you!\nWoman: I love you!\nMan: I love you more!\nWoman: Yeah.\n[[A man and a woman stand facing one another - saying nothing.]]\n{{Alt-text: This one makes me wince every time I think about it}}","alt":"This one makes me wince every time I think about it","img":"https://imgs.xkcd.com/comics/love.jpg","title":"Love","day":"1"},{"month":"1","num":45,"link":"","year":"2006","news":"","safe_title":"Schrodinger","transcript":"[[Label: Schrödinger's Comic]]\n[[Two figures standing, one with a black hat]]\nThe last panel of this comic is both funny and not funny at the same time.\nUntil you read it, there's no way to tell which it will end up being.\nShit.\n{{alt: There was no alt-text until you moused over}}","alt":"There was no alt-text until you moused over","img":"https://imgs.xkcd.com/comics/schrodinger.jpg","title":"Schrodinger","day":"4"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"2","num":60,"link":"","year":"2006","news":"","safe_title":"Super Bowl","transcript":"[[A green car with the text next to it]]\nMy hobby:\nWhile everyone is watching\nthe Super Bowl, feeling\nsmugly superior because\nthey're \"Only watching for\nthe ads,\" I steal cars.","alt":"The Super Bowl is actually an elaborate ruse, concocted by a shadowy group in the mid sixties for this purpose.  The 'watch it for the ads' addition was a master stroke.","img":"https://imgs.xkcd.com/comics/super_bowl.jpg","title":"Super Bowl","day":"6"},null,null,null,{"month":"2","num":64,"link":"","year":"2006","news":"","safe_title":"Solar Plexus","transcript":"[[Hat guy and man standing there talking]]\nHat guy: Asolarplexussayswhat?\nMan: What?\n[[They continue to stand there]]\n[[They continue to stand there]]\n[[Hat guy punches the man in the chest]]\n{{alt: It hurts to be hit there, you know}}","alt":"It hurts to be hit there, you know","img":"https://imgs.xkcd.com/comics/solar_plexus.jpg","title":"Solar Plexus","day":"15"},{"month":"2","num":65,"link":"","year":"2006","news":"","safe_title":"Banter","transcript":"[[Two guys stand together]]\nFirst Guy: Man, she's hot\nSecond Guy: Whatever, you are so gay.\nFirst Guy: C'mon, everyone knows you're the gay one\nSecond Guy: Hey, your mom's pretty masculine, but sleeping with her doesn't make me gay.\nFirst Guy: Fag.\nSecond Guy: Ass pirate.\nFirst Guy: Fudge packer\nSecond Guy: Cock jockey\nFirst Guy: Cum dumpster.\n(silent panel)\nFirst guy: Okay, seriously, are you gay? Because if you've been holding out on me, we're missing out.\nSecond guy: No, it's cool.\nFirst guy: OK me neither.\n(silent panel)\n(silent panel)\n{{alt text: This was an actual mock conversation  between me and a friend at TGIF. The waitress walked up around panel 5 and was somewhat put off.}}","alt":"This was an actual mock conversation between me and a friend at TGiF.  The waitress walked up around panel 5 and was somewhat put off.","img":"https://imgs.xkcd.com/comics/banter.jpg","title":"Banter","day":"17"},null,null,null,null,null,null,null,{"month":"3","num":73,"link":"","year":"2006","news":"","safe_title":"Zeppelin","transcript":"[[Two guys stand together]]\nFirst Guy: What time is it?\n[[Second guy's watch with the word \"Zeppelin!\" replacing 11, 12 and 1]]\n[[Two guys standing together in silence]]\n[[Large zeppelin above the two guys]]\n{[title text: A tribute to Buttercup Festival.}}","alt":"A tribute to Buttercup Festival","img":"https://imgs.xkcd.com/comics/zeppelin.jpg","title":"Zeppelin","day":"8"},null,null,{"month":"3","num":76,"link":"","year":"2006","news":"","safe_title":"Familiar","transcript":"[[A man and a woman are talking]]\nWoman: I worry that I'm just with you because it's familiar. Of course no one else compares. I've known you for so long that I'd have to spend years with someone to build up this kind of connection \nand I daren't let you go of you long enough to let that happen.\nWoman: But I guess this is really all I can ask for.\nI'm happy with you; I should stop worrying.\n[[Woman takes man's hand]]\nMan: This is probably a bad time to bring this up, but I don't actually like you.\n{{title text: :( }}","alt":":(","img":"https://imgs.xkcd.com/comics/familiar.jpg","title":"Familiar","day":"15"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"6","num":110,"link":"","year":"2006","news":"","safe_title":"Clark Gable","transcript":"The line was actually supposed to be \"Frankly, my dear, I couldn't care less.\"  Its just that Clark Gable had Tourette's.\n[[Gone with the Wind]]","alt":"Frankly, my dear, I don't give a BITCH ASS SHIT FUCK DAMN","img":"https://imgs.xkcd.com/comics/clark_gable.jpg","title":"Clark Gable","day":"2"},null,null,null,null,null,null,null,null,null,null,null,{"month":"6","num":122,"link":"","year":"2006","news":"","safe_title":"Quirky Girls","transcript":"[[ Man and woman talking, looking at a group of 2 men and a woman standing further away.  The woman is on a table and the 2 men are looking at her ]]\nMan: I love that girl.  She's not afraid to be quirky and different.\nWoman: You know, I'm active in street theatre and I collect and paint Asian dolls.\nMan: ...Okay, I didn't actually mean be different.  I just want silly and entertaining on command now and then.\n{{alt: Romantic comedy heroines, I'm talking to you.}}","alt":"Romantic comedy heroines, I'm talking to you.","img":"https://imgs.xkcd.com/comics/quirky_girls.png","title":"Quirky Girls","day":"30"},null,null,null,{"month":"7","num":126,"link":"","year":"2006","news":"","safe_title":"Red Spiders Cometh","transcript":"[[Many red spiders, standing on and hanging from blocks, hover ominously over a small city, ready to attack]]\n{{title text: Uh-oh.}}\n{{compare to http:\nxkcd.com\n8\n}}","alt":"Uh-oh.","img":"https://imgs.xkcd.com/comics/red_spiders_cometh.jpg","title":"Red Spiders Cometh","day":"10"},null,null,null,null,null,{"month":"7","num":132,"link":"","year":"2006","news":"","safe_title":"Music Knowledge","transcript":"[[A female and male figure converse]]\nFemale: What kind of music do you listen to?\nMale: Oh, a mix of things. Some classic rock like Boston, but then of course Queen and Bowie, Joan Jett...\nFemale: Definitely, we need more of those sounds.\nMale: But there's some great newer stuff too, like Franz Ferdinand, The Donnas, and Audioslave.\nFemale: Sometimes they're a little much for me. I go more for things like The Arcade Fire, sometimes mixing some electronic sounds like Postal Service.\nMale: Oh yeahâhave you ever checked out Freezepop?\nFemale: Mhm! Synth pop can be fun, but at the same time, I agree that sometimes you just need to blast some Metallica.\nMale: Who?\nFemale: ...Metallica.\nMale: Are they new?\nNarrator: I sound pretty knowledgeable about music until people figure out that I'm just naming bands from Guitar Hero.\n{{title text: When Guitar Hero 2 comes out I'll have fresh conversational material for MONTHS.}}","alt":"When Guitar Hero 2 comes out I'll have fresh conversational material for MONTHS.","img":"https://imgs.xkcd.com/comics/music_knowledge.png","title":"Music Knowledge","day":"24"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"8","num":150,"link":"","year":"2006","news":"","safe_title":"Grownups","transcript":"[[Man is talking to Woman who is behind a waste-high screen across a doorway with colorful playpen balls behind her.]]\nMan: Hey, I was wondering if you had plans for-- holy crap, what happened to your apartment?\nWoman: I filled it with playpen balls!\nMan: I... what? Why?\nWoman: Because we're grown-ups now, and it's our turn to decide what that means.\n[[Both vanish into the apartment, balls spilling out into the corridor. A love heart drifts out the door, indicating you-know-what]]\n{{Alt: I've looked into this, and I can't figure out a way to do it cheaply.  And I guess it wouldn't be sanitary.}}","alt":"I've looked into this, and I can't figure out a way to do it cheaply.  And I guess it wouldn't be sanitary.","img":"https://imgs.xkcd.com/comics/grownups.png","title":"Grownups","day":"29"},null,null,null,null,null,null,null,{"month":"9","num":158,"link":"","year":"2006","news":"","safe_title":"Six Months","transcript":"[[A guy stands]]\nGuy: It's been six months and I still have those dreams where you're pressed tight against me, where you look into my eyes and give me that grin and it's like you've forgotten everything.\nGuy: And something in the back of my head says it's wrong, it's not like this anymore, but I push it down.  In the morning, I tell myself I can't control my dreams, but there's a part of me that doesn't want them to stop.\nGuy: And honestly, waking up would be a lot easier if your mom didn't look so much like you.\nGuy: There's always that moment of confusion.\n{{title-text: But then she does that thing with her tongue and I remember why I left you.}}","alt":"But then she does that thing with her tongue and I remember why I left you.","img":"https://imgs.xkcd.com/comics/six_months.png","title":"Six Months","day":"18"},null,null,{"month":"9","num":161,"link":"","year":"2006","news":"","safe_title":"Accident","transcript":"[[Person driving car while singing]]\nDriver: NAAAA NA NA NANA NANA NA NA KATAMARI DAMACY\n[[two people talking]]\nMailbox Owner: and that's when you veered into the mailbox?\nDriver: It looked smaller then me. It was just instinct.","alt":"As far as treachery-as-driving-music goes, Katamari music is matched only by Guitar Hero music.","img":"https://imgs.xkcd.com/comics/accident.png","title":"Accident","day":"22"},null,null,null,null,null,null,null,{"month":"10","num":169,"link":"","year":"2006","news":"","safe_title":"Words that End in GRY","transcript":"[[Hat Guy and Random Guy are standing next to each other.]]\nRandom Guy: There are three words in the English language that end in \"gry\". \"Angry\" and \"Hungry\" are two. What's the third?\nHat Guy: I don't think there is one, unless you cound really obscure words.\nRandom Guy: Ha! It's \"language\"! I said there are three words in \"the English--\" \n[[Hat Guy grabs Random Guy's hand with a <<GRAB>>]]\nRandom Guy: What th-AAAAAAAAAAAAAAA\n[[Hat Guy slices off Random Guy's hand with a knife.]]\nHat Guy: Ok, listen carefully.\nRandom Guy: AAAAAAAAAAAAAAAA\n[[Random Guy is bleeding profusely.]]\nHat Guy: Communicating badly then acting smug when you're misunderstood is not cleverness.\nRandom Guy: AAAAAAAAAAAAAAAA\nHat Guy: I hope we've learned something today.\nRandom Guy: AAAAAAAAAAAAAAAA\n{{Alt text: The fifth panel also applys to postmodernists.}}","alt":"The fifth panel also applies to postmodernists.","img":"https://imgs.xkcd.com/comics/words_that_end_in_gry.png","title":"Words that End in GRY","day":"11"},null,{"month":"10","num":171,"link":"","year":"2006","news":"","safe_title":"String Theory","transcript":"String Theory summarized:\nI just had an awesome idea. Suppose all matter and energy is made of tiny, vibrating \"strings\".\nOkay. What would that imply?\nI dunno.\n{{title text: This works on pretty much every level.}}","alt":"This works on pretty much every level.","img":"https://imgs.xkcd.com/comics/string_theory.png","title":"String Theory","day":"16"},null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"11","num":185,"link":"","year":"2006","news":"","safe_title":"Wikifriends","transcript":"WikiFriends:\n[[Two people are talking to each other]]\nPerson 1: I really liked that movie.\nPerson 2: I hated that movie.\nPerson 1: Me too.\n{{title text: It's crazy how much my gut opinion of a movie\nsong is swayed by what other people say, regardless of how I felt coming out of the theater.}}","alt":"It's crazy how much my gut opinion of a movie/song is swayed by what other people say, regardless of how I felt coming out of the theater.","img":"https://imgs.xkcd.com/comics/wikifriends.png","title":"Wikifriends","day":"17"},null,null,null,{"month":"11","num":189,"link":"","year":"2006","news":"","safe_title":"Exercise","transcript":"Like many geeks, I got a lot more interested in exercise once I made the connection to leveling up.\n[[Man is doing pull-ups on a bar]]\nMan doing pull-ups: One more point to str, then I'll run to work on con.\n{{title text: I haven't had the patience for RPGs in a long time.}}","alt":"I haven't had the patience for RPGs in a long time.","img":"https://imgs.xkcd.com/comics/exercise.png","title":"Exercise","day":"27"},{"month":"11","num":190,"link":"","year":"2006","news":"","safe_title":"IPoD","transcript":"[[Character 1 - wearing a black hat - sits at a computer. Character 2 stands behind Character 1]]\nCharacter 1: You see, statisticians communicate using IPoD -- IP over Demographics. For example, the header of the next packet I send will be encoded into the New Jersey death rate.\nCharacter 2: So you're going to hack the census bureau and change the number of reported deaths?\nCharacter 1: Guess again.\nCharacter 1: Hey, have you seen my crossbow?\n{{Alt: For smaller numbers he has to SAVE lives.  The birthrate channel is even more of a mixed bag.}}","alt":"For smaller numbers he has to SAVE lives.  The birthrate channel is even more of a mixed bag.","img":"https://imgs.xkcd.com/comics/ipod.png","title":"IPoD","day":"29"},null,null,null,null,null,null,null,{"month":"12","num":198,"link":"","year":"2006","news":"","safe_title":"Perspective","transcript":"Narrator: Sometimes, when I first wake up, I am caught in the horrible grip of perspective.\n[[A person sitting up in bed]]\nPerson: It may be a jewel of open source, but Firefox is JUST A BROWSER. It shows WEBPAGES. What the hell is WRONG with us?\nNarrator: Fortunately, this subsides quickly.\n{{alt text: I wonder what I was dreaming to prompt that. I hope it wasn't the Richard Stallman Cirque de Soleil thing again.}}","alt":"I wonder what I was dreaming to prompt that.  I hope it wasn't the Richard Stallman Cirque de Soleil thing again.","img":"https://imgs.xkcd.com/comics/perspective.png","title":"Perspective","day":"18"},null,null,null,null,null,null,null,null,null,null,null,{"month":"1","num":210,"link":"","year":"2007","news":"","safe_title":"90's Flowchart","transcript":"Start\n |\nThe 90's?\n \n          \\\nNo       Yes\n |           |\nStop      Stop\n           \n       \\\nHammertime  Collaborate\n                       |\n                    Listen\n{{alt: Freestyle rapping is basically applied Markov chains.}}","alt":"Freestyle rapping is basically applied Markov chains.","img":"https://imgs.xkcd.com/comics/90s_flowchart.png","title":"90's Flowchart","day":"15"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"2","num":225,"link":"","year":"2007","news":"","safe_title":"Open Source","transcript":"[[A man with much facial hair is sleeping on a bed.]]\n[[Suddenly, two ninjas jump through the skylight.]]\nNinja 1: Richard Stallman! Your viral open source licenses have grown too powerful.\nNinja 1: The GPL must be stopped.\nNinja 1: At the source.\nNinja 1: You.\n[[Richard Stallman wakes up immediately, and pulls his katana out of its sheath from under his bed]]\nRichard Stallman: Hah! Microsoft lackeys! So it has come to this!\nRichard Stallman: A night of blood I've long awaited. But be this my death or yours, free software will carry on! For a GNU dawn! For freedom! ... hey, where are you going?\n[[The ninja step out the window]]\nNinja 1: Man, you're right, that never gets old.\nNinja 2: Let's do Eric S. Raymond next.\nNinja 1: Or Linus Torvalds. I hear he sleeps with nunchucks.\n[[Comic alt text: Later we'll dress up like Big Oil thugs and jump Ralph Nader.]]","alt":"Later we'll dress up like Big Oil thugs and jump Ralph Nader.","img":"https://imgs.xkcd.com/comics/open_source.png","title":"Open Source","day":"19"},null,null,null,null,null,null,null,{"month":"3","num":233,"link":"","year":"2007","news":"","safe_title":"A New CAPTCHA Approach","transcript":"To complete your web registration, please prove that you're human:\nWhen Littlefoot's mother died in the original `Land Before Time', did you feel sad?\n[[radio button]] Yes\n[[radio button]] No\n(Bots: no lying)","alt":"They'd use that Futurama episode with Fry's dog, but even spambots cry at that.","img":"https://imgs.xkcd.com/comics/a_new_captcha_approach.png","title":"A New CAPTCHA Approach","day":"9"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"5","num":258,"link":"","year":"2007","news":"","safe_title":"Conspiracy Theories","transcript":"[[Figure A:]]\nThe official story of 9-11 is full of holes.  Take the --\n[[Figure B:]]\nPlease, stop, because seeing this happen to you breaks my heart.\n[[Figure B:]]\nConspiracy theories represent a known glitch in human reasoning.  The theories are of course occasionally true, but their truth is completely uncorrelated with the believer's certainty.  For some reason, sometimes when people think they've uncovered a lie, they raise confirmation bias to an art form.  They cut context away from facts and arguments and assemble them into reassuring litanies.  And over and over I've argued helplessly with smart people consumed by theories they were sure were irrefutable, theories that in the end proved complete fictions.\nYoung-Earth Creationists, the Moon Landing people, the Perpetual Motion subculture -- can't you see you're falling into the same pattern?\n[[Figure A:]]\nYou don't seriously believe we landed on the moon.  Do you?\n[[Figure B flees]]\n[[Figure B, praying:]]\nDear God.\n[[Booming from the sky:]]\nYES MY CHILD?\n[[Figure B:]]\nI would like to file a bug report.","alt":"There are a lot of graduate-educated young-earth creationists.","img":"https://imgs.xkcd.com/comics/conspiracy_theories.png","title":"Conspiracy Theories","day":"7"},null,null,{"month":"5","num":261,"link":"","year":"2007","news":"","safe_title":"Regarding Mussolini","transcript":"[[Three people are standing around a map.  One of them is pushing something with a stick.]]\n[[A messenger arrives.]]\nMessenger: General, Italian forces have entered Egypt.\nGeneral: As I expected. This is a foolish move by Mussolini, but like Hitler he will no doubt force his commanders to --\nMessenger: Hey. Godwin's Law.\nGeneral: Dammit.\nGeneral: You know, this may become a problem.\n\n{{Title text: Constantly stopping these briefings halfway through is becoming a pain.}}","alt":"Constantly stopping these briefings halfway through is becoming a pain.","img":"https://imgs.xkcd.com/comics/regarding_mussolini.png","title":"Regarding Mussolini","day":"14"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"6","num":278,"link":"","year":"2007","news":"","safe_title":"Black Hat Support","transcript":"[[A man - wearing a black hat - is sitting at his computer, wearing a phone headset]]\nPhone: Thank you for calling the Black Hat Support Line, your first source for Linux support. How may I assist?\nMan: Hi. I'm running an Apache server, and the load keeps climbing out of control.\nPhone: Okay. First, click on the Start Menu.\nMan: I'm sorry, this is the Linux helpline, right?\nPhone: Of course, Sir.\nMan: If you'll just open the \"My Documents\" folder-\nPhone: Just a damn minute, I think you're putting me on.\nMan: Please bear with me, Sir.\nMan: Now, load up your AOL and go to the Keyword \"Linux\"-\nPhone: *click*\n{{Alt: So as not to leave you hanging -- it was a problem with select() calls.}}","alt":"So as not to leave you hanging -- it was a problem with select() calls.","img":"https://imgs.xkcd.com/comics/black_hat_support.png","title":"Black Hat Support","day":"18"},null,{"month":"6","num":280,"link":"","year":"2007","news":"","safe_title":"Librarians","transcript":"{{Advantages to dating librarians}}\nLibrarian: We're stopping in Baltimore to visit my family, and that's final.\nBoyfriend: Oh yeah?\n[[Reaching inside paper bag.]]\nBoyfriend: Hey, look, it's a new hardback book!\n[[Holds book in hands]]\nLibrarian Girlfriend: You wouldn't.\n[[The book is twisted and crinkled.]]\n<<crinkle>>\n<<creak>>\n[[Librarian Girlfriend twitches.]]\n<<crack>>\n[[The book's spine is broken]]\nLibrarian Girlfriend: OKAY! You win!\n\n{{alt: Don't expect any leniencies on late fees, though.}}","alt":"Don't expect any leniency on late fees, though.","img":"https://imgs.xkcd.com/comics/librarians.png","title":"Librarians","day":"22"},null,{"month":"6","num":282,"link":"","year":"2007","news":"","safe_title":"Organic Fuel","transcript":"[[Man sitting at computer second man standing nearby]]\nMan at Computer: Wow â Engines can burn vegetable oil.\nStanding man: Well, sure. You can burn most any organic matter. Corn, leaves, spices...\nMan at Computer: Spices? Really?\nStanding man: Sure â Mussolini made the trains run on thyme.\nMan at Computer: ...\nMan at Computer: We are no longer friends.\n{{alt text: I have nothing to apologize for.}}","alt":"I have nothing to apologize for.","img":"https://imgs.xkcd.com/comics/organic_fuel.png","title":"Organic Fuel","day":"27"},null,null,{"month":"7","num":285,"link":"","year":"2007","news":"","safe_title":"Wikipedian Protester","transcript":"[[There is a politician speaking at a podium, which sports an American flag.]]\n[[In front of the speaker there is a crowd of people listening.  In the middle of the crowd a man is standing up holding a sign reading \"[CITATION NEEDED]\" in blue underlined text, as in Wikipedia articles.]]\n{{title text: SEMI-PROTECT THE CONSTITUTION}}","alt":"SEMI-PROTECT THE CONSTITUTION","img":"https://imgs.xkcd.com/comics/wikipedian_protester.png","title":"Wikipedian Protester","day":"4"},{"month":"7","num":286,"link":"","year":"2007","news":"","safe_title":"All Your Base","transcript":"[[A section of a Linux terminal window is shown]]\nText from window: ~ \n$ ls \nayb    boot    etc         lib ...\nbin     dev     home    mnt ...\n~\n $ ls \nayb\nallyourbase_original.swf   al...\nallyourbase_remix.swf        ...\nallyourbase_remix2.swf    b ...\nayb_acapella.mp3           ze...\nayb_images\n                  ze...\nayb_orchestral.mp3\n....\n[[Girl is at computer]]\nGirl: What's with the All Your Base stuff? Didn't that die like five years ago?\n[[From off-panel]] : Yes.\n[[Man enters panel]]\nMan: It was my first internet meme, and my favorite.  Others tired of it, but I never did.\nMan: So I wait.\nMan: Someday, decades from now, people will have forgotten. It will be fresh again.\nMan: Retro.\nMan: and when that day comes [[Man raises his fists]]\nMan: I WILL BE READY!\nGirl: You need a hobby or something.\nMan: What you say!!\nMan: Wait, too soon.\n{{title text: The AYB retro-return-date (Zero Wing Zero Hour) should be around AD 2021.}}","alt":"The AYB retro-return-date (Zero Wing Zero Hour) should be around AD 2021.","img":"https://imgs.xkcd.com/comics/all_your_base.png","title":"All Your Base","day":"6"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"8","num":307,"link":"","year":"2007","news":"","safe_title":"Excessive Quotation","transcript":"[[Outside, under a crescent moon.]]\nWoman: It's strange to stare at the moon and think about people walking on it.\nMan: That's no moon, it's aâ<<gack>>\n[[She holds him up in the air by his neck Ã  la Darth Vader using the force.]]\nWoman: I find your lack of original conversation disturbing.\n{{Title text: Unfortunately for her, real Star Wars fans are attracted to a gal with a good force choke.}}","alt":"Unfortunately for her, real Star Wars fans are attracted to a gal with a good force choke.","img":"https://imgs.xkcd.com/comics/excessive_quotation.png","title":"Excessive Quotation","day":"24"},null,null,null,null,null,null,null,null,null,null,null,null,{"month":"9","num":320,"link":"","year":"2007","news":"","safe_title":"28-Hour Day","transcript":"[[There is a diagram which shows the hours in a week. It has sections labeled \"bed\" and below has sections labeled \"night.\" They do not line up.]]\n[[Two men are talking together.]]\nFirst man: You have trouble sleeping right?\nSecond man: Only when your mom is over.\n[[First man is now pointing to a chart.]]\nFirst man: Since your work is flexible-\nSecond Man: -Like your mom-\nFirst Man: -you should try the 28-hour day - 20 awake, 8 asleep (or 19\n9 if you prefer).\nSecond Man: I prefer your mom.\nFirst Man: It synchs up with the week - you spend weekdays awake normally, then on weekends you can go out all night.\nSecond Man: Just like your mom.\nFirst Man: It means four extra hours daily. You can stay up until you're exhausted every day and then spend a full 9 hours asleep each night!\nSecond Man: But how much time can I spend doing your mom?\nFirst Man: You? I'm guessing three or four minutes, tops.\nSecond Man: ...Well played.\n{{title text: Small print: this schedule will eventually drive one stark raving mad.}}","alt":"Small print: this schedule will eventually drive one stark raving mad.","img":"https://imgs.xkcd.com/comics/28_hour_day.png","title":"28-Hour Day","day":"24"},null,null,null,null,null,null,null,null,null,{"month":"10","num":330,"link":"","year":"2007","news":"","safe_title":"Indecision","transcript":"First Guy: So, what do you want to do?\nSecond Guy: Still no ideas.\nFirst guy: Wait, I think there's a rule about this.\n[[First Guy goes to bookshelf and removes a book called \"Rules\"]]\n[[The book of Rules is opened to the following:\nRULE social.b.99.1\nIf friends spend more than 60 minutes unable to decide what to do, they must default to sexual experimentation.]]\n[[First Guy is standing, holding the book. Second Guy is in the process of standing up.]]\nFirst Guy: Huh.\nSecond Guy: I did not know that rule.\nFirst Guy: Me neither.\nSecond Guy: I'll go get the Crisco.\n{{alt-text: Hey, I don't make the rules. It's in the book.}}","alt":"Hey, I don't make the rules.  It's in the book.","img":"https://imgs.xkcd.com/comics/indecision.png","title":"Indecision","day":"17"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"12","num":352,"link":"","year":"2007","news":"","safe_title":"Far Away","transcript":"[[The window of an instant messaging program. A drawing of two people hugging in the text part of the window.]]\n[[Man sitting in front of the computer.]]\nMan: Meh.\nMan: Some nights typing \"*hug*\" just doesn't cut it.\n{{Sometimes an inpulsive 2:00 AM cross-country trip is the only solution.}}","alt":"Sometimes an impulsive 2:00 AM cross-country trip is the only solution.","img":"https://imgs.xkcd.com/comics/far_away.png","title":"Far Away","day":"3"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"1","num":367,"link":"","year":"2008","news":"","safe_title":"Fandom","transcript":"[[Boy is looking through box]]\nBoy: Hey, my old Star Wars books!\n[[holding a pair of books and showing them to Girl]]\nBoy: Man. Timothy Zahn, Michael A. Stackpole, The Corellian Trilogy...\nBoy: This was my world.\nGirl: What'd you leave it for? Firefly? BSG?\nBoy: Nah.\nBoy: I guess I've just grown out of the whole obsessive fan mindset.\nGirl: Really.\nGirl: So how's Ron Paul doing?\nBoy: Ooh! Lemme recheck today's blogs.\n[[Boy heads off]]\n{{title text: Ron Paul wants to put the New Republic back on the Corusca gem standard.}}","alt":"Ron Paul wants to put the New Republic back on the Corusca gem standard.","img":"https://imgs.xkcd.com/comics/fandom.png","title":"Fandom","day":"7"},null,null,{"month":"1","num":370,"link":"","year":"2008","news":"","safe_title":"Redwall","transcript":"Notes from reading redwall books for the first time since childhood.\nNarrator: Some of this feels familiar.\nAragorn: Hi, I'm Aragorn.\nMartin: I'm Martin.\nAragorn and Martin: I'm here to reforge my broken sword so I can lead an army against the tyrant threatening my people. I live in a world of moral absolutes and racist undertones.\nMartin: Jinx!\nNarrator: It startled me when characters mentioned Satan.\nRedwall: \"By Satan's whiskers...\"\nRedwall mentions God, Jesus 0 times.\nRedwall mentions Satan, The Devil 4 times.\nNarrator: Harry Potter protesters, take note.\nNarrator: Even as a kid this bothered me: Why does everyone leave critical secret messages as simple riddles? It's silly to assume the intended recipient will be the only one to find and solve them. I would do things differently.\nMouse: The inscription is a message from Martin!\nOld Mouse: What does it say?\nMouse: Hang on, it's encrypted with my public key.","alt":"My Redwall/Jurassic Park crossover fanfic is almost complete!","img":"https://imgs.xkcd.com/comics/redwall.png","title":"Redwall","day":"14"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"2","num":389,"link":"","year":"2008","news":"","safe_title":"Keeping Time","transcript":"My Hobby:\nPausing in-store music for a split second and watching the ex-marching band kids stumble.\n[[On a balcony overlooking a supermarket, a man presses a button on a pedestal. The in-store music, the first four bars of \"Never Gonna Give You Up\" by Rick Astley, pauses briefly after the third bar, and one of the store's patrons falls on her face.]]\n<<FWOMP>>\n{{ title text: You can identify them ahead-of-time -- they lead with their left foot when the music starts. }}","alt":"You can identify them ahead-of-time -- they lead with their left foot when the music starts.","img":"https://imgs.xkcd.com/comics/keeping_time.png","title":"Keeping Time","day":"27"},null,null,null,null,null,null,null,null,null,null,null,null,{"month":"3","num":402,"link":"","year":"2008","news":"","safe_title":"1,000 Miles North","transcript":"[[Van and truck travel toward mountains]]\nNarrator: 1,000 miles north of tornado alley\nNarrator: a new breed of scientists has emerged.\n[[Man with a laptop, woman with a probe in the ground]]\nNarrator: Half researchers, half adrenaline junkies\nWoman: What's the reading?\nMan: 3.9 meters down, gradient's off the charts!\n[[Truck driving very fast, man holding a radio up to his head]]\nNarrator: risking everything for the thrill of the hunt\nMale: The freeze line is shifting! We've never seen anything like it!\n[[4 - Barren field, mountains in background, woman holding large video camera up to tiny spot of grass]]\nNarrator: Permafrost chasers\nFemale: I'm getting some great footage here!\nRadio: Dammit, Harding, it's not worth your neck! Get the hell out of there!\n{{Title Text: Twister would've been a much better movie if they'd cut out the bad-guy storm chaser and all the emotional romance crap.  All you need for a good movie are tornados and scientists.  Actually, that's all you need for anything.}}","alt":"Twister would've been a much better movie if they'd cut out the bad-guy storm chaser and all the emotional romance crap.  All you need for a good movie are tornados and scientists.  Actually, that's all you need for anything.","img":"https://imgs.xkcd.com/comics/1000_miles_north.png","title":"1,000 Miles North","day":"28"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"5","num":424,"link":"","year":"2008","news":"","safe_title":"Security Holes","transcript":"[[Man sitting at computer]]I'll just comment out these lines...\n\nMD_update(&m, buf, j);\n\ndo_not_crash();\n\nprevent_911();\nIn the rush to clean up the debian-openssl fiasco, a number of other major security holes have been uncovered:\nFedora Core: Vulnerable to certain decoder rings\nXandros (EEE PC): Gives root access if asked in a stern voice\nGentoo: Vulnerable to flattery\nOLPC OS: Vulnerable to Jeff Goldblum's Powerbook\nSlackware: Gives root access if user says Elvish word for \"friend\"\nUbuntu: Turns out distro is actually just Windows Vista with a few custom Themes.\n{{title text: True story: I had to try several times to upload this comic because my ssh key was blacklisted.}}","alt":"True story: I had to try several times to upload this comic because my ssh key was blacklisted.","img":"https://imgs.xkcd.com/comics/security_holes.png","title":"Security Holes","day":"16"},null,{"month":"5","num":426,"link":"http://xkcd.com/geohashing","year":"2008","news":"What is this about?  See the <a href=\"http://wiki.xkcd.com/geohashing/\">wiki</a>.","safe_title":"Geohashing","transcript":"Date (example): 2005-05-26\nThat date's (or most recent) DOW opening: 10458.68\n[[Concatenate, with a hyphen: 2005-05-26-10458.68]]\nmd5: db9318c2259923d08b672cb305440f97\n[[Split it up into two pieces:]]\n0.db9318c2259923d0, 0.8b672cb305440f97\nTo decimal: 0.857713..., 0.544544...\nYour location (example): 37.421542, -122.085589\n[[Combine integer part of location with fractional part of hash:]]\nDestination Coordinates: 37.857713, -122.544544\nSample Implementation: http:\nxkcd.com\ngeohashing\n{{title text: Saturday is game night.}}","alt":"Saturday is game night.","img":"https://imgs.xkcd.com/comics/geohashing.png","title":"Geohashing","day":"21"},null,null,null,null,null,null,null,{"month":"6","num":434,"link":"","year":"2008","news":"","safe_title":"xkcd Goes to the Airport","transcript":"[[Standing outside the Airport. There is a sign saying \"Airport\" and a plane in the background.]]\nGirl: Okay, what airline?\nGuy: I'm following you.\nGirl: ...I'm following *you*.\nGuy: I assumed we were walking to the bakery.\nGirl: You always assume that!\n[[Presumably the security checkpoint]]\nSecurity Guy: Lockpicks? These are... illegal, actually. Where did you get them?\nGuy: Oh man, it all started with this hacker girl.\nSecurity Guy: You need to come with -\nGuy: Sure, sure. But man, let me tell you about her!\n[[On a plane]]\nAnnouncement: If your device has a \"Transmit\" function, please disable it.\nGuy: Okay - hang on, I'm half way through the iwconfig man page.\n[[Security checkpoint]]\nSecurity guy: Sir, is this container under three ounces?\nGuy with hat: Not sure, how much blood is there in a churchmouse?\nSecurity guy: Why don't you just go.\n{{Alt text: Under three ounces, but it stains panties.}}","alt":"Under three ounces, but it stains panties.","img":"https://imgs.xkcd.com/comics/xkcd_goes_to_the_airport.png","title":"xkcd Goes to the Airport","day":"9"},null,null,null,null,null,{"month":"6","num":440,"link":"","year":"2008","news":"","safe_title":"Road Rage","transcript":"[[Man in black hat is driving and and the woman who seems to be his equal is in the passenger's seat.  They are closely followed by some other vehicle.]]\nMan in black hat: That guy's tailgating me.\nWoman: I'll take a look.\nWoman: His laptop's running, probably in the back seat. And... yup, the WiFi autoconnects.\nWoman: Now we just scan for remote exploits... install speech synth...\nWoman: and take a shot in the psychological dark.\nLaptop: Hello.\nTailgating man: What? Who's there?\nLaptop: She'd be alive if it weren't for you.\nTailgating man: ... Oh God.\n{{Title: Okay, now just as the loss hits him, slam on the brakes.}}","alt":"Okay, now just as the loss hits him, slam on the brakes.","img":"https://imgs.xkcd.com/comics/road_rage.png","title":"Road Rage","day":"23"},null,null,null,null,null,null,null,null,null,null,null,{"month":"7","num":452,"link":"","year":"2008","news":"","safe_title":"Mission","transcript":"[[Two figures, one in a beret, are rappelling down separate ropes into the interior workings of a large machine]]\nMan 1: Okay, we're in the belly of the machine. You got the charges?\nMan 2 (with beret): The what?\n[[The two are standing next to some large pieces of machinery]]\nMan 1 [[gesturing]: The explosive charges!\nMan 2 [[pulling out a bag]]: I just brought this bag for pastries.\nMan 1: The hell? We're on a mission here!\nMan 2 [[looking around]]: This isn't a bakery?\nMan 1 [[head in hand]]: Oh, Christ, not this shit again.\nMan 2 [[crouching by some lug nuts lying on a piece of machinery]]: What about these scones?\nMan 1: Those are lug nuts.\nMan 2 [[stuffing them in his mouth]]: ...Maybe SOME of them aren't. <<crunch>> Ow! <<crunch>>\n{{Title text: Don't you know? The chances of a random object being a scone are about one in six.}}","alt":"Don't you know?  The chances of a random object being a scone are about one in six.","img":"https://imgs.xkcd.com/comics/mission.png","title":"Mission","day":"21"},null,{"month":"7","num":454,"link":"","year":"2008","news":"","safe_title":"Rewiring","transcript":"{{Title: Rewiring}}\n{{Heading: Upgrading phone wiring to Ethernet}}\n[[A man is feeding cable into a device on a desk labeled \"fax\"]]\n<<Fax: zzz zzz>>\n[[Outdoors, showing a plant and a lamp (indicates panels 1 and 3 are separate locations)]]\n[[A woman, laptop behind her, is pulling a cable out of a fax machine]]\n<<Fax: zzzzz>>\n{{Alt text: My friend Elizabeth tried to mail one end of the cable to me and thread the mail system.}}","alt":"My friend Finn tried to mail one end of the cable to me and thread the mail system.","img":"https://imgs.xkcd.com/comics/rewiring.png","title":"Rewiring","day":"25"},null,null,null,null,null,null,null,null,null,null,null,null,{"month":"8","num":467,"link":"","year":"2008","news":"","safe_title":"X Girls Y Cups","transcript":"[[There is a table with eight columns and eight rows. Cups to the horizontal girls to the vertical.]]\n{{Title: Google results for <x> cups <y> girls}}\n(Note: the values will be displayed left to right and top to bottom.)\n0 girls: 3, 375, 9, 0, 0, 0, 0, 0\n1 girl: 7, 7503, 2007, 10, 5, 3, 6, 2\n2 girls: 9, 1929000, 247, 7, 14, 13, 2, 1\n3 girls: 7, 6335, 394, 34, 3, 2, 6, 0\n4 girls: 3, 3513, 34, 0, 63, 0, 0, 0\n5 girls: 1, 9, 5, 3, 0, 0, 3, 0\n6 girls: 3, 1461, 1, 1, 1, 0, 0, 0\n7 girls: 2, 19, 4, 2, 0, 0, 0, 0\n{{Alt-text: Also no results: 1girl10000cups, 2girls(5+3i)cups, 65536girls35563cups, or 3frenchhens2turtledoves1cup.}}","alt":"Also no results: 1girl10000cups, 2girls(5+3i)cups, 65536girls65536cups, or 3frenchhens2turtledoves1cup.","img":"https://imgs.xkcd.com/comics/x_girls_y_cups.png","title":"X Girls Y Cups","day":"25"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"11","num":507,"link":"","year":"2008","news":"","safe_title":"Experimentation","transcript":"[[A young male and female are holding hands, and the female is pointing off to the side.]]\nFemale:  Oh, hey, it's twelve of the dudes from control group B!\nI'm cool with her past lesbian experimentation, but I wish she hadn't insisted the experiments be scientifically rigorous.\n{{title text: I understand large sample sizes are key to a low sigma, but the entire sophomore class?}}","alt":"I understand large sample sizes are key to a low standard error of the mean, but the entire sophomore class?","img":"https://imgs.xkcd.com/comics/experimentation.png","title":"Experimentation","day":"21"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"5","num":584,"link":"","year":"2009","news":"","safe_title":"Unsatisfied","transcript":"[[A blonde and a man are holding hands, looking at another woman with black hair.]]\n((Two arrows direct the comic into a pair of different paths.))\n\n((Left path.))\n[[The man is holding hands with the blonde woman, but he is thinking about the woman with black hair.]]\n((Right path.))\n[[The man approaches the woman with black hair.  He is thinking about the blonde.]]\n\n((Left path.))\n[[The man is performing oral sex on the blonde, and still thinking about the woman with black hair.]]\n((Right path.))\n[[The man and the black-haired woman have sex on the arm of a chair.  The man is thinking about the blonde.]]\n\n((Left path.))\n[[The man and the woman are drawing something together, and the man is thinking about the woman with black hair.]]\n((Right path.))\n[[The man and woman are hiking together.  The man is thinking about the blonde woman.]]\n\n((Left path.))\n[[The man and the woman are holding hands, and the man is thinking of the woman with black hair.]]\n((Right path.))\n[[The man and the woman are holding hands, and the man is thinking of the blonde woman.]]\n((The path unites again.))\n[[Two gravestones are next to each other.  One of them is thinking about a third gravestone.]]\n\n{{Title text: Forever comparing, never evaluating on any external scale.  If you were a sort function, you'd never break the nlogn barrier.}}","alt":"Forever comparing, never evaluating on any external scale.  If you were a sort function, you'd never break the nlogn barrier.","img":"https://imgs.xkcd.com/comics/unsatisfied.png","title":"Unsatisfied","day":"15"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"9","num":636,"link":"","year":"2009","news":"","safe_title":"Brontosaurus","transcript":"[[Two people are sitting at a bench.  The woman is holding a turtle.]]\nWoman: Our love is like a turtle.\n\n[[The woman sets down the turtle and turns to her partner.  They hold hands.]]\nWoman: Humble and simple, enduring by virtue of perfect design.\n\nPartner: Our love is like a brontosaurus.\n\nPartner: Recognized as a mistaken combination long ago, lingering only out of misplaced affection for an imagined past.\n\n{{Title text: Well, sex is like a velociraptor: despite your movie-fueled lifelong neurotic obsession, unlikely to be found in your house.}}","alt":"Well, sex is like a velociraptor: despite your movie-fueled lifelong neurotic obsession, unlikely to be found in your house.","img":"https://imgs.xkcd.com/comics/brontosaurus.png","title":"Brontosaurus","day":"14"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"10","num":651,"link":"","year":"2009","news":"","safe_title":"Bag Check","transcript":"[[A man and woman are at a security checkpoint in an airport. A guard is holding an open backpack and a bottle of water, and the man is arguing with him.]]\nMan: But if you're worried about bombs, why are you letting me keep my laptop batteries? If I overvolted them and breached the cells, it would make a sizeable explosion.\nWoman: Oh god.\nMan: It's okay, dear. In a moment he'll realize I have a good point and return my water.\n\n{{Title text: A laptop battery contains roughly the stored energy of a hand grenade, and if shorted it ... hey!  You can't arrest me if I prove your rules inconsistent!}}","alt":"A laptop battery contains roughly the stored energy of a hand grenade, and if shorted it ... hey!  You can't arrest me if I prove your rules inconsistent!","img":"https://imgs.xkcd.com/comics/bag_check.png","title":"Bag Check","day":"19"},null,null,null,null,null,null,null,null,null,{"month":"11","num":661,"link":"","year":"2009","news":"","safe_title":"Two-Party System","transcript":"[[A girl stands at a podium, giving a speech.]]\nGirl: And if I'm elected, I'll try to fix some of these problems.\nBoy, off-panel: Yeah, right!\n\n[[A boy in the audience is standing on his chair.]]\nBoy: The REAL problem is the corporate-run two party system. Until we fix THAT, we'll have no real change!\n\nGirl: Billy, I'm running for class president. We don't even have political parties.\n\nBoy: That's because the two-praty, uh ... estab ... uh.\n\nGirl: Billy, did you learn about politics from the internet?\nBoy: I thought that one reply was all I ever needed!\n\n{{Title text: I favor approval voting or IRV chiefly because they mean we might get to bring back The Bull Moose party.}}","alt":"I favor approval voting or IRV chiefly because they mean we might get to bring back The Bull Moose party.","img":"https://imgs.xkcd.com/comics/two_party_system.png","title":"Two-Party System","day":"11"},{"month":"11","num":662,"link":"","year":"2009","news":"","safe_title":"iPhone or Droid","transcript":"[[A woman sitting at her computer is talking to a man standing behind her.]]\nWoman: Well, it depends what you want. The iPhone wins on speed and polish, but the Droid has that gorgeous screen and physical keyboard.\n\nMan: What if I want something more than the pale facsimile of fulfillment brought by a parade of ever-fancier toys? To spend my life restlessly producing instead of sedately consuming?\nMan: Is there an app for THAT?\n\nWoman: Yeah, on both.\nWoman: Wait, no, looks lke it was rejected from the iPhone store.\nMan: Droid it is, then.\n\n{{Title text: It may be a fundamentally empty experience, but holy crap the Droid's 265 ppi screen is amazing.}}","alt":"It may be a fundamentally empty experience, but holy crap the Droid's 265 ppi screen is amazing.","img":"https://imgs.xkcd.com/comics/iphone_or_droid.png","title":"iPhone or Droid","day":"13"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"2","num":698,"link":"","year":"2010","news":"","safe_title":"You Hang Up First","transcript":"[[Man is sitting on a bed, on the phone.]]\nMan: You hang up first.\n\n[[Women is lying on a bed, on the phone.]]\nWoman: No, *you* hang up first.\n\nMan: No, *you* hang up first.\n\nWoman: No, *you* fucking hang up first!\n\nMan: You hang up first, or we're OVER!\n\nWoman: Then I guess we're fucking OVER!\n\nMan: FINE!\n\nWoman: ...\n\nMan: ...\n\nWoman: *You* move on and find somebody else first.\n\n{{Title text: No, YOU stumble past a series of post-breakup hookups in a daze as you slowly realize what you've lost and how unlikely you are ever to get it back first.}}","alt":"No, YOU stumble past a series of post-breakup hookups in a daze as you slowly realize what you've lost and how unlikely you are ever to get it back first.","img":"https://imgs.xkcd.com/comics/you_hang_up_first.png","title":"You Hang Up First","day":"5"},null,null,null,null,null,null,{"month":"2","num":705,"link":"","year":"2010","news":"","safe_title":"Devotion to Duty","transcript":"[[A terrorist is holding a gun and talking on a cell phone to the boss.]]\nTerrorist: We took the hostages, secured the building, and cut the communication lines like you said.\nBoss: Excellent.\n\nTerrorist: But then this guy climbed up the ventilation ducts and walked across broken glass, killing anyone we sent to stop him.\nBoss: And he rescued the hostages?\n\nTerrorist: No, he ignored them. He just reconnected the cables we cut, muttering something about \"uptime.\"\nBoss: Shit, we're dealing with a sysadmin.\n\n{{Title text: The weird sense of duty really good sysadmins have can border on the sociopathic, but it's nice to know that it stands between the forces of darkness and your cat blog's servers.}}","alt":"The weird sense of duty really good sysadmins have can border on the sociopathic, but it's nice to know that it stands between the forces of darkness and your cat blog's servers.","img":"https://imgs.xkcd.com/comics/devotion_to_duty.png","title":"Devotion to Duty","day":"22"},null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"3","num":719,"link":"","year":"2010","news":"","safe_title":"Brain Worms","transcript":"[[A woman sits at a computer desk, and a man stands near her holding a book.]]\nMan: Weird--this parasitic worm infects the brain, damaging the areas responsible for spatial reasoning in dreams. Signs of infection include dreams about not fitting in your car comfortably, driving from the backseat, or veering all over the road.\nWoman: (thinking) Oh God.\n\nMy Hobby: Taking advantage of the fact that some specific dreams are weirdly common, but not everyone who has them realizes this.\n\n{{Title text: Hey, it says here that if you dream about your teeth falling out, it means they're spreading.}}","alt":"Hey, it says here that if you dream about your teeth falling out, it means they're spreading.","img":"https://imgs.xkcd.com/comics/brain_worms.png","title":"Brain Worms","day":"26"},null,{"month":"3","num":721,"link":"","year":"2010","news":"","safe_title":"Flatland","transcript":"[[Person encounters a square on the ground.]]\nPerson: Hey, A. Square. How's Flatland?\nA. Square: Still flat. What's up?\nPerson: I just spent an hour playing a demo of this 4D game called Miegakure.\n\n[[A character in Miegakure jumps around the 4D landscape.]]\nTrying to jump from block to block in four dimensions hurt my brain.\n\nPerson: So I apologize for giving you a hard time when you were slow to understand 3D space. I sympathize now.\nA. Square: It's okay.\n\nPerson: Also, I apologize for drawing arms, legs, and eyes on you to make you look like Spongebob. That was out of line.\nA. Square: Yes, it was.\n\n{{Title text: Also, I apologize for the time I climbed down into your world and everyone freaked out about the lesbian orgy overseen by a priest.}}","alt":"Also, I apologize for the time I climbed down into your world and everyone freaked out about the lesbian orgy overseen by a priest.","img":"https://imgs.xkcd.com/comics/flatland.png","title":"Flatland","day":"31"},null,null,null,null,null,{"month":"4","num":727,"link":"","year":"2010","news":"","safe_title":"Trade Expert","transcript":"[[Anchorman sitting at newsdesk.]]\nAnchor: (to camera) And for more on the summit, we turn to trade expert Dr. Steven Berlee. Steven?\n\n[[Dr. Steven Berlee is sitting to the right of Anchor at newsdesk.]]\nDSB: I'm not actually a doctor or a trade expert. I'm just a programmer who lies to get on news shows.\n\n[[Close-up on DSB.]]\nAnchor: (off camera) What? Why?\nDSB: To share a message with newscasters.\n\n[[Pull back to shot of both men.]]\nAnchor: Which is?\nDSB: Every time you say \"backslash\" as part of a web address on air, I die a little.\n\n{{Title text: I mean, it's been almost twenty years. Now, it's possible you're simply embedding Windows directory paths in your URIs, but in that case you need more than just a short lecture.}}","alt":"I mean, it's been almost twenty years. Now, it's possible you're simply embedding Windows directory paths in your URIs, but in that case you need more than just a short lecture.","img":"https://imgs.xkcd.com/comics/trade_expert.png","title":"Trade Expert","day":"14"},null,{"month":"4","num":729,"link":"","year":"2010","news":"","safe_title":"Laser Pointer","transcript":"[[A human points a laser pointer at the floor. A black cat crouches, staring at the red dot.]]\n\n[[The cat pounces.]]\n\n[[The cat lands with its paw on the dot, claws out.]]\n\n[[The cat tugs on the dot.]]\n<<tug tug>>\n\n[[The human looks at and tries to use the laser pointer, which is no longer emitting a beam.]]\nHuman: ?? <<click click>>\n[[The cat nibbles on the red laser dot.]]\nCat: <<lick? nom nom>>\n\n[[The cat arches, emitting red shock lines.]]\n\n[[The cat shoots lasers out of its eyes at the human, who is covered in a bright red glow.]]\n<<FWOOSH>>\nHuman: AUGH!\n((The right side of the panel is the end of a thought bubble ...))\n\n[[The black cat, sleeping, has dreamed the entire strip.]]\n\n{{Title text: It's a lasing cat-vity!}}","alt":"It's a lasing cat-vity!","img":"https://imgs.xkcd.com/comics/laser_pointer.png","title":"Laser Pointer","day":"19"},null,{"month":"4","num":731,"link":"","year":"2010","news":"","safe_title":"Desert Island","transcript":"[[A man sits writing in a diary on a desert island, only the sandy tip of which with a palm tree on it stands above the water. Beneath the surface is a kelp forest, some sharks, a stingray, a shipwreck, a submarine, several large jellyfish, a giant squid fighting a sperm whale, a crashed plane, some coral formations, a thermal vent emitting a plume of smoke surrounded by several annelids, and a snail.]]\nMan: Day 44: Still stranded, with nothing but flat empty water as far as the eye can see.\n\n{{Title text: Telescopes and bathyscapes and sonar probes of Scottish lakes, Tacoma Narrows bridge collapse explained with abstract phase-space maps, some x-ray slides, a music score, Minard's Napoleonic war: the most exciting new frontier is charting what's already here.}}","alt":"Telescopes and bathyscaphes and sonar probes of Scottish lakes, Tacoma Narrows bridge collapse explained with abstract phase-space maps, some x-ray slides, a music score, Minard's Napoleonic war: the most exciting new frontier is charting what's already here.","img":"https://imgs.xkcd.com/comics/desert_island.png","title":"Desert Island","day":"23"},{"month":"4","num":732,"link":"","year":"2010","news":"","safe_title":"HDTV","transcript":"[[One person is pointing to a huge flatscreen HDTV on the wall. The other is holding a cell phone.]]\nHDTV Owner: Check out my new HDTV--a beautiful, high-def 1080p.\nFriend: Wow, that's over TWICE the horizontal resolution of my cell phone.\nFriend: In fact, it almost beats the LCD monitor I got in 2004.\n\nIt baffles me that people find HDTV impressive.\n\n{{Title text: We're also stuck with blurry, juddery, slow-panning 24fps movies forever because (thanks to 60fps home video) people associate high framerates with camcorders and cheap sitcoms, and thus think good framerates look 'fake'.}}","alt":"We're also stuck with blurry, juddery, slow-panning 24fps movies forever because (thanks to 60fps home video) people associate high framerates with camcorders and cheap sitcoms, and thus think good framerates look 'fake'.","img":"https://imgs.xkcd.com/comics/hdtv.png","title":"HDTV","day":"26"},null,null,null,null,null,{"month":"5","num":738,"link":"","year":"2010","news":"","safe_title":"Incision","transcript":"[[Two doctors wearing surgical masks are standing over a prone patient.  One of them is poking the patient's chest.]]\nDoctor: I'm making the incision above the left - \n<< BZZZZT! >>\nDoctor: Augh!\nOctober 8th, 2004:\nA child swallows an 'operation' buzzer, leading to the single most difficult surgery ever performed.\n\n{{Title text: At one point, by force of childhood habit, the doctor accidentally removed three or four organs.}}","alt":"At one point, by force of childhood habit, the doctor accidentally removed three or four organs.","img":"https://imgs.xkcd.com/comics/incision.png","title":"Incision","day":"10"},null,null,null,{"month":"5","num":742,"link":"","year":"2010","news":"","safe_title":"Campfire","transcript":"[[An adult stands in front of a campfire with three children listening intently. The adult holds a flashlight under his chin to create a menacing visage.]]\nAdult: But when she traced the killer's IP address... It was in the 192.168\n16 block!\nChildren, together: GASP!\n\n{{Title text: 100 years later, this story remains terrifying--not because it's the local network block, but because the killer is still on IPv4.}}","alt":"100 years later, this story remains terrifying--not because it's the local network block, but because the killer is still on IPv4.","img":"https://imgs.xkcd.com/comics/campfire.png","title":"Campfire","day":"19"},null,null,{"month":"5","num":745,"link":"","year":"2010","news":"","safe_title":"Dyslexics","transcript":"[[A t-shirt is shown with the text \"DYSLEXICS OF THE WORLD, UNITE!\" screen-printed on it.]]\nThe dyslexic support group ran into difficulties when they tried to make a joke fundraiser t-shirt.\n\n{{Title text: And of course I had to redo this like three times because I kept writing 'UNTIE'; I kept doing 'doing 'doing it wrong' wrong' wrong.}}","alt":"And of course I had to redo this like three times because I kept writing 'UNTIE'; I kept doing 'doing 'doing it wrong' wrong' wrong.","img":"https://imgs.xkcd.com/comics/dyslexics.png","title":"Dyslexics","day":"26"},null,null,{"month":"6","num":748,"link":"","year":"2010","news":"","safe_title":"Worst-Case Scenario","transcript":"[[Two reporters, a man and a woman, point microphones toward a scientist.]]\nFemale reporter: Dr. Scientist! The \"Top Kill\" has failed! What's the worse-case scenario for the gulf?\nDr. Scientist: The worst-case scenario is what's happening now.\n\nReporter, out of frame: Yes, but is there any way it could get worse?\nDr. Scientist: Sure, but there are real disasters happening now, and you're substituting speculation and voyeurism for the investigative journalism we--\nReporter: Screw this! Let's ask Michael Bay.\n\n[[The reporters, now joined by a camerawoman, approach Michael Bay with their microphones.]]\nMichael Bay: The worst case? A hurricane tracks into the gulf, whipping the surface of the spill into a frothy mix of oil and air.\n\n[[An alligator-filled conflagration atop a massive ocean wave approaches land.]]\nMichael Bay, narrating: As the storm surges through the bayous, sparking power lines ignite the fuel\nair mixture into a roiling, alligator-filled wall of flame.\n\n[[A map of the gulf coast of Louisiana and southwest Mississippi is depicted with the current routes of the Mississippi and Atchafalaya Rivers highlighted. An arrow indicating a new primary flow of the Mississippi's waters into the Atchafalaya points toward southern Louisiana.]]\nMichael Bay, narrating: Plowing northward, the fire hurricane destroys the Old River Control Structure in Concordia, rerouting the Mississippi westward and sweeping Morgan City and the heart of cajun country out to sea.\n\nMichael Bay: James Carville emerges from the conflagration riding a burning alligator...\nReporter, out of frame: Will this affect the midterm elections?\nMichael Bay: \nMassively.\n\n\n{{Title text: To get serious analyses of hurricanes and oil slicks, see Jeff Masters' blog. To get serious discussions of worst-case scenario thinking, see Bruce Schneier's blog. To get enough Vitamin D, don't read any blogs and go outside instead.}}","alt":"To get serious analyses of hurricanes and oil slicks, see Jeff Masters' blog. To get serious discussions of worst-case scenario thinking, see Bruce Schneier's blog. To get enough Vitamin D, don't read any blogs and go outside instead.","img":"https://imgs.xkcd.com/comics/worst_case_scenario.png","title":"Worst-Case Scenario","day":"2"},null,null,null,{"month":"6","num":752,"link":"","year":"2010","news":"","safe_title":"Phobia","transcript":"[[A blonde woman and a brunette woman observe a snake on the ground.]]\nBlonde: Whoa, a snake!\nBrunette: Cool!\nBlonde: I'm afraid of snakes.\n\n[[The brunette looks pensive.]]\nBrunette: I'm afraid of saying \"Everything's complicated right now, but maybe next year\" until there are no more years left.\n\n[[The blonde considers her response.]]\n\n[[The brunette cuts her off mid-sentence.]]\nBlonde: Do you--\nBrunette: I want to be a storm chaser.\n\n[[A tornado reaches from the black storm clouds to the earth, kicking up a sizable cloud of debris at its base. The blonde woman is at the wheel of a car, the brunette hanging out the window and holding a camera.]]\n\n{{Title text: Oh God, the tornado picked up snakes!}}","alt":"Oh God, the tornado picked up snakes!","img":"https://imgs.xkcd.com/comics/phobia.png","title":"Phobia","day":"11"},null,null,null,null,null,null,null,null,{"month":"7","num":761,"link":"","year":"2010","news":"","safe_title":"DFS","transcript":"[[A man with wet hair and a towel around his waist thinks with his hand to his chin.]]\nMan: (What situations might I prepare for? 1) medical emergency, 2) dancing, 3) food too expensive...)\n\n[[Close-up on man's face.]]\nMan: (Okay, what kind of emergencies can happen? 1)A) snakebite, B) lightning strike, C) fall from chair...)\n\n[[Still thinking...]]\nMan: (Hmm. Which snakes are dangerous? Let's see... 1)A)a) Corn Snake? b) Garter Snake? c) Copperhead?)\n\n[[Sits down in a chair with a laptop, still wearing towel.]]\nMan: (The research comparing snake venoms is scattered and inconsistent. I'll make a spreadsheet to organize it.)\n\n((Bottom panel is larger than top four, and aligned to right.))\n[[A woman meets the man on his front stoop. She is carrying a purse, and looks down at his towel. The man holds his arms in the air triumphantly.]]\nWoman: I'm here to pick you up. You're not dressed?\nMan: By LDsub50, the Inland Taipan has the deadliest venom of ANY snake! \n\nCaption: I really need to stop using depth-first searches.\n\n{{Title text: A breadth-first search makes a lot of sense for dating in general, actually; it suggests dating a bunch of people casually before getting serious, rather than having a series five-year relationships one after the other.}}","alt":"A breadth-first search makes a lot of sense for dating in general, actually; it suggests dating a bunch of people casually before getting serious, rather than having a series of five-year relationships one after the other.","img":"https://imgs.xkcd.com/comics/dfs.png","title":"DFS","day":"2"},null,null,null,null,null,null,null,null,null,null,null,{"month":"7","num":773,"link":"","year":"2010","news":"","safe_title":"University Website","transcript":"[[A venn diagram. The left circle is labeled \"things on the front page of a university website\" and contains \"campus photo slideshow,\" \"alumni in the news,\" \"promotions for campus events,\" \"press releases,\" \"statement of the school's philosophy,\" \"letter from the president,\" and \"virtual tour.\" The right circle is labeled \"things people go to the site looking for\" and contains \"list of faculty phone numbers and emails,\" \"campus address,\" \"application forms,\" \"academic calendar,\" \"campus police phone number,\" \"department\ncourse lists,\" \"parking information,\" and \"usable campus map.\" The only item in the overlapping section is \"full name of school.\"]]\n{{Title text: People go to the website because they can't wait for the next alumni magazine, right? What do you mean, you want a campus map? One of our students made one as a CS class project back in '01!  You can click to zoom and everything!}}","alt":"People go to the website because they can't wait for the next alumni magazine, right? What do you mean, you want a campus map? One of our students made one as a CS class project back in '01!  You can click to zoom and everything!","img":"https://imgs.xkcd.com/comics/university_website.png","title":"University Website","day":"30"},{"month":"8","num":774,"link":"","year":"2010","news":"","safe_title":"Atheists","transcript":"Guy: Personally, I find atheists just as annoying as fundamentalist Christians.\nGirl: Well, the important thing is that you've found a way to feel superior to both.\n\n{{Title text: 'But you're using that same tactic to try to feel superior to me, too!' 'Sorry, that accusation expires after one use per conversation.'}}","alt":"'But you're using that same tactic to try to feel superior to me, too!' 'Sorry, that accusation expires after one use per conversation.'","img":"https://imgs.xkcd.com/comics/atheists.png","title":"Atheists","day":"2"},null,null,null,null,null,{"month":"8","num":780,"link":"","year":"2010","news":"","safe_title":"Sample","transcript":"HOW TO BECOME THE MOST HATED BAND IN THE WORLD:\nRecord an album that's nothing but brilliant, catchy instant classics guaranteed popularity and airtime,\n[[A man driving in a car, hands off the wheel in sudden surprise and confusion.]]\n<<music: So far from hooome but I can't sto-HONK>>\nMan: AUGH! WHAT?\nWith a sample of a car horn, cell phone, or alarm clock inserted randomly in each song.\n{{Title text: There are two or three songs out there with beeps in the chorus that sound exactly like the clock radio alarm I had in high school, and hearing it makes me think my life since junior year has been a dream I'm about to wake up from.}}","alt":"There are two or three songs out there with beeps in the chorus that sound exactly like the clock radio alarm I had in high school, and hearing it makes me think my life since junior year has been a dream I'm about to wake up from.","img":"https://imgs.xkcd.com/comics/sample.png","title":"Sample","day":"16"},null,{"month":"8","num":782,"link":"","year":"2010","news":"","safe_title":"Desecration","transcript":"[[A woman runs up to a man.]]\nWoman: Rob! Rob!\nMan: You look terrified! What's wrong?\nWoman: We've made a huge mistake!\n\n[[The woman and man stand facing each other.]]\nWoman: Remember last week when we dug up all those Indian bones and made puppets out of them?\nMan: Sure...\n\n[[The woman holds her arms out for emphasis, the man puts his hands to his face in horror.]]\nWoman: It turns out they were buried over an \nancient Indian burial ground!\n\nMan: \nOh my God!\n\n\n{{Title text: It gets worse! You know that wizened old monk with the gypsy wife whose voodoo shop we smash up every every day after school?}}","alt":"It gets worse! You know that wizened old monk with the gypsy wife whose voodoo shop we smash up every day after school?","img":"https://imgs.xkcd.com/comics/desecration.png","title":"Desecration","day":"20"},null,null,{"month":"8","num":785,"link":"","year":"2010","news":"","safe_title":"Open Mic Night","transcript":"[[Woman on stage, holding microphone, hip-hop stance.]]\nWoman: Yo, I'm M.C. Aphasia and I'm here to say that, I... uh... um... hi?\n\n[[Hat man on stage, holding microphone.]]\nHat man: So I... oh? Does she? Well, when \nyo\n mama sits around the house, she finds herself wishing she'd finished her degree instead of having kids right away, maybe started that business. Then she might have created something she's \nproud\n of.\n\n[[Man on stage, holding microphone, fist pumping toward audience.]]\nMan: Yo, I'm M.C. Quine and I'm here to say, \"Yo, I'm M.C. Quine and I'm here to say!\"\n\n[[Beret man on stage, holding microphone.]]\nBeret man: Ever notice how men go to the restroom alone, while women go in hordes ten thousand strong, clad all in sable armor and bristling with swords and spears?\nAudience member: Those are orcs.\nBeret man: Oh.\n\n\n{{Title text: Ever notice how the more successful observational comics become, the more their jokes focus on flying and hotels?}}","alt":"Ever notice how the more successful observational comics become, the more their jokes focus on flying and hotels?","img":"https://imgs.xkcd.com/comics/open_mic_night.png","title":"Open Mic Night","day":"27"},null,null,{"month":"9","num":788,"link":"","year":"2010","news":"","safe_title":"The Carriage","transcript":"[[The Grim Reaper driving a horse-drawn carriage.]]\nBecause I could not stop for death\nHe kindly stopped for me\n\n[[A woman wearing her hair in a bun grabs Death by the arm and pulls him off the carriage. There is a Y-button symbol in the lower left corner.]]\nThe carriage held but just oursel--\nDeath: Hey!\n<<GRAB>>\n\n[[The woman takes off in the carriage, leaving Death in her dust, on the ground.]]\nWoman: Hyah!\n\n[[The Grand Theft Auto logo is shown, with the stamp \"Emily Dickinson Edition\" underneath. There is a picture of stick-Emily, arms crossed, and a scythe next to her.]]\n\n{{Title text: I learned from Achewood that since this poem is in ballad meter, it can be sung to the tune of Gilligan's Island.  Since then, try as I might, I haven't ONCE been able to read it normally.}}","alt":"I learned from Achewood that since this poem is in ballad meter, it can be sung to the tune of Gilligan's Island.  Since then, try as I might, I haven't ONCE been able to read it normally.","img":"https://imgs.xkcd.com/comics/the_carriage.png","title":"The Carriage","day":"3"},null,null,null,null,null,{"month":"9","num":794,"link":"","year":"2010","news":"","safe_title":"Inside Joke","transcript":"[[Two men with beards stand at a crude wooden counter, one is wearing a turban. Behind the man without a turban is a woman kneeling on the ground and putting something into a box.]]\nTurban man: Nine silvers for a ham? That's too much!\nNo-turban: Too much? There's a monk out back \nwith a ladder!\n\n(Ha ha ha ha ha ha ha ha...)\nThere's no reason to think that people throughout history didn't have just as many inside jokes and catchphrases as any modern group of high-schoolers.\n\n{{Title text: I've looked through a few annotated versions of classic books, and it's shocking how much of what's in there is basically pop-culture references totally lost on us now.}}","alt":"I've looked through a few annotated versions of classic books, and it's shocking how much of what's in there is basically pop-culture references totally lost on us now.","img":"https://imgs.xkcd.com/comics/inside_joke.png","title":"Inside Joke","day":"17"},{"month":"9","num":795,"link":"","year":"2010","news":"","safe_title":"Conditional Risk","transcript":"[[Lightning strikes the ground, illuminating trees with a bright white light.  Two people are standing near it.  One has a walking stick.]]\n<<CRACK>>\n<<BOOM>>\nFirst person: Whoa! We should get inside!\nSecond person: It's okay! Lightning only kills about 45 Americans a year, so the chances of dying are only one in 7,000,000.  Let's go on!\n\nThe annual death rate among people who know that statistic is one in six.\n\n{{Title text: 'Dude, wait -- I'm not American! So my risk is basically zero!'}}","alt":"'Dude, wait -- I'm not American! So my risk is basically zero!'","img":"https://imgs.xkcd.com/comics/conditional_risk.png","title":"Conditional Risk","day":"20"},null,{"month":"9","num":797,"link":"","year":"2010","news":"","safe_title":"debian-main","transcript":"<<AAAAAAAA>>\n[[A swarm of insects cover a computer and a person.  The person is leaning back on their chair, flailing to get away.]]\n\nMy package made it into Debian-main because it looked innocuous enough; no one noticed \"locusts\" in the dependency list.\n\n{{Title text: dpkg: error processing package (--purge): subprocess pre-removal script returned error exit 163: OH_GOD_THEYRE_INSIDE_MY_CLOTHES}}","alt":"dpkg: error processing package (--purge): subprocess pre-removal script returned error exit 163: OH_GOD_THEYRE_INSIDE_MY_CLOTHES","img":"https://imgs.xkcd.com/comics/debian_main.png","title":"debian-main","day":"24"},null,{"month":"9","num":799,"link":"","year":"2010","news":"","safe_title":"Stephen Hawking","transcript":"[[Stephen Hawking is facing a pair of people.  His voice appears in a square machine readable font.]]\nStephen Hawking: I thought maybe later we should go see a movie.\n\n[[The two people are running.]]\n\n[[The front page of a newspaper appears instead of a third panel.]]\n((Name of the paper.)) The Times\n((Main headline.)) Physicist Stephen Hawking Suggests We See More Films\n[[A picture of Stephen Hawking is in the center of the page.]]\n((Picture's caption.)) Smartest Man Alive\n((Secondary headline.)) What Does He Know That We Don't?\n((Large quote in article body.)) Is this a warning?\n\n[[Stephen Hawking is sitting alone, looking depressed.]]\n\n{{Title text: 'Guys?  The Town is supposed to be good, and I thou--' 'PHYSICIST STEPHEN HAWKING DECLARES NEW FILM BEST IN ALL SPACE AND TIME' 'No, I just heard that--' 'SHOULD SCIENCE PLAY A ROLE IN JUDGING BEN AFFLECK?' 'I don't think--' 'WHAT ABOUT MATT DAMON?'}}","alt":"'Guys?  The Town is supposed to be good, and I thou--' 'PHYSICIST STEPHEN HAWKING DECLARES NEW FILM BEST IN ALL SPACE AND TIME' 'No, I just heard that--' 'SHOULD SCIENCE PLAY A ROLE IN JUDGING BEN AFFLECK?' 'I don't think--' 'WHAT ABOUT MATT DAMON?'","img":"https://imgs.xkcd.com/comics/stephen_hawking.png","title":"Stephen Hawking","day":"29"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"12","num":829,"link":"","year":"2010","news":"","safe_title":"Arsenic-Based Life","transcript":"[[Three people, two women and a man, stand looking at a laptop screen, which is sitting on a desk. The woman with a ponytail is pointing at the screen.]]\nPonytail girl: Our arsenic-based DNA discovery is cool, but these reporters are expecting life on Titan! Our press conference will be such a letdown!\n\n[[Ponytail girl turns around to face the other girl.]]\nPonytail: Okay, we need to make it more exciting for them. How do you make an event entertaining? \nGirl #2: Dunno, I suck at parties. Music, I guess?\n\n[[Ponytail girl turns back around and leans over to start typing on the computer, while the other two look on. The other girl puts her hand to her chin.]]\nPonytail: WikiHow says you can \"serve cocktails and hors d'oerves that fit the theme of your event.\"\nGirl #2: Easy enough!\n\n[[Ponytail girl stands at a podium on a stage, the man stands amongst the audience with a tray. All the audience members are either dead or dying, having fallen onto the floor or slumped over in their seats.]]\n\n{{Title text: According to a new paper published in the journal Science, reporters are unable to thrive in an arsenic-rich environment.}}","alt":"According to a new paper published in the journal Science, reporters are unable to thrive in an arsenic-rich environment.","img":"https://imgs.xkcd.com/comics/arsenic_based_life.png","title":"Arsenic-Based Life","day":"3"},null,{"month":"12","num":831,"link":"","year":"2010","news":"","safe_title":"Weather Radar","transcript":"[[A black dot on a weather radar screen.]]\nDot: Sigh.  Just a few clouds.\n\n[[The clouds develop into orange, to the left of the dot.]]\nDot: Whoa! Huge storm out of nowhere!\n\n[[The orange becomes red, and the storm moves towards the dot.]]\nDot: It's \ngrowing\n! And headed right for me! \nAwesome!\n\n\n[[The storm splits in half.]]\nDot: Hey! What's it...\n\n[[The two halves of the storm pass by the dot.\nDot: Dammit!  \nAgain?!\n\n\n{{Title text: Ever notice how there aren't as many thunderstorms now as there were when you were a kid?  Much like 'the shuffle on my MP3 player has a bias', this is occasionally true but universally believed. Brains are so interesting!}}","alt":"Ever notice how there aren't as many thunderstorms now as there were when you were a kid?  Much like 'the shuffle on my MP3 player has a bias', this is occasionally true but universally believed. Brains are so interesting!","img":"https://imgs.xkcd.com/comics/weather_radar.png","title":"Weather Radar","day":"8"},null,null,null,null,null,null,{"month":"12","num":838,"link":"","year":"2010","news":"","safe_title":"Incident","transcript":"[[Someone is sitting at a computer.  The computer's prompt is shown.]]\nrobm@homebox~$ sudo su\nPassword:\nrobm is not in the sudoers file. This incident will be reported.\nrobm@homebox~$ \n\n[[A second person approaches.]]\nPerson: Hey -- who does sudo report these \"incidents\" \nto\n?\nSecond person: You know, I've never checked.\n\n[[Santa Claus is sitting at a desk supported by candy canes, with a red monitor.  On the wall are two lists labeled 'naughty' and 'nice'.  He is adding a name to the 'naughty' list.]]\n\n{{Title text: He sees you when you're sleeping, he knows when you're awake, he's copied on \nvar\nspool\nmail\nroot, so be good for goodness' sake.}}","alt":"He sees you when you're sleeping, he knows when you're awake, he's copied on /var/spool/mail/root, so be good for goodness' sake.","img":"https://imgs.xkcd.com/comics/incident.png","title":"Incident","day":"24"},null,null,null,null,null,null,null,null,{"month":"1","num":847,"link":"","year":"2011","news":"","safe_title":"Stingray Nebula","transcript":"[[Two white figures are silhouetted against a dark sky.  They're sitting on top of a grassy hill.]]\nPerson: I know things are tough right now.  When I was going through some difficult times as a kid, I would go up on the roof and look through my telescope.\n\nPerson: One day I found a tiny star in Ara that seemed friendly.\nPerson: There were millions like it, but I decided that this one was mine.\n\nPerson: When things got bad, I'd go find that star, and think of my favorite Tolkien quote.  It's from Sam's time in Mordor.\n\n((The next panel is diagonally downward to the right of the previous.  The upper left corner overlaps.))\n[[A star is above the highest peak in a chain of mountains.]]\n\"There, peeping among the cloud-wrack above a dark tor high up in the mountains, Sam saw a white star twinkle for a while.  The beauty of it smote his heart, as he looked up out of the forsaken land, and hope returned to him.  For like a shaft, clear and cold, the thought pierced him that in the end the shadow was only a small and passing thing: There was light and high beauty forever beyond its reach.\"\n- The Return of the King\n\nCompanion: That's comforting!\nPerson: It was rather undercut in 1987, when the light from my star's explosion reached Earth.  The debris forms the Stingray Nebula.\n\nCompanion: There's probably a lesson there.\nPerson: \"Never trust an unstable asymptotic giant branch star.  Stick with main sequences and dwarfs.\"\nCompanion: I'll, uh, keep that in mind.\n\n{{Title text: EÃ¤rendil will patrol the walls of night only until the sun reaches red giant stage, engulfing the Morning Star on his brow. Light and high beauty are passing things as well.}}","alt":"Eärendil will patrol the walls of night only until the sun reaches red giant stage, engulfing the Morning Star on his brow. Light and high beauty are passing things as well.","img":"https://imgs.xkcd.com/comics/stingray_nebula.png","title":"Stingray Nebula","day":"14"},null,null,null,null,null,null,null,null,{"month":"2","num":856,"link":"","year":"2011","news":"","safe_title":"Trochee Fixation","transcript":"Girl: Robot ninja! Pirate doctor laser monkey! Narwhal zombie badger hobo bacon kitty captain penguin raptor jesus!\n\nScientist (to guy): We'd been seeing this brain damage for years, but only recently did our linguists identify the pattern behind it.\n\nScientist: The patients fixate on animals and types of people whose names are trochees (two syllables, with the accent on the first).\n\nThe malfunction causes a rush of dopamine whenever these trocheese are heard or spoken.\n[[Chart shows \"internet\" and \"brain,\" with arrows marked \"trochees\" traveling both ways between them. An arrow marked \"dopamine\" loops from the brain back to the brain.]]\n\nThe warning signs appear in childhood:\n[[Child sits in front of TV.]]\nChild: Yeah! Mighty teenage morphin' ninja power mutant turtle rangers!\nSocial reinforcement focuses the fixation on a few dozen words.\nGuy (off-panel): Is there a cure?\n\n[[Girl is reclining under a big machine pointed at her face.]]\nScientist: We're about to try a radical trocheeotomy.\nGuy: Rip out her vocal chords? I'm in favor.\nScientist: No, we're modifying her vocabulary* to erase the words she's fixated on.\n*Digitoneurolinguistic hacking! It's totally real! Ask Neal Stephenson.\n\nScientist: Either the gap will be filled by normal words, or she'll just generate a new set of trochees.\nScientist: Here goes.\n[[She pulls the lever on a large panel.]]\n<<kachunk bzzzZZZZZZ>>\n\n[[Girl is waking up.]]\nGirl: ... GzZhRmPh ...\nGirl ... banjo turtle!\nGirl: Jetpack ferret pizza lawyer! Dentist hamster wombat plumber turkey jester hindu cowboy hooker bobcat scrapple!\nScientist (off-panel): Sigh.\nScientist: Time for plan B.\nScientist: Someone get a brick.\n\n{{Title text: If you Huffman-coded all the 'random' things everyone on the internet has said over the years, you'd wind up with, like, 30 or 40 bytes *tops*.}}","alt":"If you Huffman-coded all the 'random' things everyone on the internet has said over the years, you'd wind up with, like, 30 or 40 bytes *tops*.","img":"https://imgs.xkcd.com/comics/trochee_fixation.png","title":"Trochee Fixation","day":"4"},null,null,null,null,null,null,null,{"month":"2","num":864,"link":"","year":"2011","news":"","safe_title":"Flying Cars","transcript":"Person (on phone): It's 2011. I want my flying car.\nFriend (from phone): Dude.\n\nFriend: You're complaining to me using a phone on which you buy and read books,\n\nFriend: and which you were using to play a 3D shooter until I interrupted you with what would be a video call if I were wearing a shirt.\n\nPerson: Can't I have a flying car, too?\nFriend (from phone): You'd crash it while texting and playing Angry Birds.\n\n{{Title text: It's hard to fit in the backseat of my flying car with my android Realdoll when we're both wearing jetpacks.}}","alt":"It's hard to fit in the backseat of my flying car with my android Realdoll when we're both wearing jetpacks.","img":"https://imgs.xkcd.com/comics/flying_cars.png","title":"Flying Cars","day":"23"},null,null,null,null,{"month":"3","num":869,"link":"","year":"2011","news":"","safe_title":"Server Attention Span","transcript":"[[single blade in a server rack]]\nServer: Hi! I'm a server! Who are you?\n\n[[mobile device with a web browser]]\nBrowser: I'm a browser. I'd like to see this article.\n\nServer:Oh boy! I can help! Let me get it for- ..whoa! You're a *smartphone* browser? \n\nBrowser: Yeah.\nServer: Cooool! Hey, I've got this new mobile version of my site! Check it out! Isn't it pretty?\n\nBrowser: Sure, but this is just your mobile site's main page. Where's the article I wanted?\n\nServer: What article?\nBrowser: The one I-\nServer: Who are you?\nBrowser: I-\nServer: Hi! I'm a server!\n\n{{Title text: They have to keep the adjacent rack units empty. Otherwise, half the entries in their \nvar\nlog\nsyslog are just 'SERVER BELOW TRYING TO START CONVERSATION *AGAIN*.' and 'WISH THEY'D STOP GIVING HIM SO MUCH COFFEE IT SPLATTERS EVERYWHERE.'}}","alt":"They have to keep the adjacent rack units empty. Otherwise, half the entries in their /var/log/syslog are just 'SERVER BELOW TRYING TO START CONVERSATION *AGAIN*.' and 'WISH THEY'D STOP GIVING HIM SO MUCH COFFEE IT SPLATTERS EVERYWHERE.'","img":"https://imgs.xkcd.com/comics/server_attention_span.png","title":"Server Attention Span","day":"7"},{"month":"3","num":870,"link":"","year":"2011","news":"Note: This comic's filename was originally 'advertising.png'. If you<br />couldn't see it, that was just your AdBlock zealously protecting you.","safe_title":"Advertising","transcript":"Mathematically Annoying Advertising:\n\n[[A âª B = {x:x â¤ 15 or x > 15 } = â ]]\n[[line graph representing the above equation]]\nWhen discussing real numbers, it is impossible to get more vague than \"up to 15% or more\".\n\n[[\"FREE*\" in large text, with substantial illegible fine print]]\nIf someone has paid $x to have the word \"free\" typeset for you and N other people to read, their expected value for the money that will move from you to them is at least $(x\n(N+1))\n\n[[graph representing inverse relationship between \"amount you spend\" on the y axis and \"amount you save\" on the x axis]]\nIt would be difficult for the phrase \"the more you spend the more you save\" to be more wrong.\n\n{{Title text: I remember the exact moment in my childhood when I realized, while reading a flyer, that nobody would ever spend money solely to tell me they wanted to give me something for nothing. It's a much more vivid memory than the (related) parental Santa talk.}}","alt":"I remember the exact moment in my childhood when I realized, while reading a flyer, that nobody would ever spend money solely to tell me they wanted to give me something for nothing. It's a much more vivid memory than the (related) parental Santa talk.","img":"https://imgs.xkcd.com/comics/mathematically_annoying.png","title":"Advertising","day":"9"},null,null,null,null,null,null,null,null,null,null,null,null,{"month":"4","num":883,"link":"","year":"2011","news":"","safe_title":"Pain Rating","transcript":"[[A doctor is carrying a clipboard and consulting with a patient, who's sitting on a high medical table.]]\nDoctor: Any pain?\nPatient: My arm really hurts.\n\n[[The patient's friend is standing behind the doctor, as the panel widens.]]\nDoctor: How would you rate the pain, from one to ten, where ten is the worst pain you can imagine?\n\n[[The patient sits on the table.]]\nPatient: The worst pain I can imagine?\n\n[[The patient ponders this, raising a thoughtful hand to their jaw.]]\n\n[[The patient appears to be shocked.]]\n\n[[The patient is huddled up on the table.]]\nPatient: One.\nDoctor: ... What the hell is wrong with his imagination?\nPatient's Friend: It's not a normal place.\n\n{{Title text: If it were a two or above I wouldn't be able to answer because it would mean a pause in the screaming.}}","alt":"If it were a two or above I wouldn't be able to answer because it would mean a pause in the screaming.","img":"https://imgs.xkcd.com/comics/pain_rating.png","title":"Pain Rating","day":"8"},null,null,null,null,null,null,null,null,null,null,null,null,{"month":"5","num":896,"link":"","year":"2011","news":"Today's comic might be familiar to a few dozen of you. :)<br />P.S. <a href=\"https://blog.xkcd.com/2011/05/08/michael-bays-scenario/\">New blag post</a>!","safe_title":"Marie Curie","transcript":"Woman: My teacher always told me that if I applied myself, I could become the next Marie Curie.\nZombie Marie Curie: You know, I wish they'd get over me.\n\nWoman: Zombie Marie Curie!\n\nZombie Marie Curie: Not that I don't deserve it. These two Nobels ain't decorative. But I make a sorry role model if girls just see me over and over as the one token lady scientist.\n\nZombie Marie Curie: Lise Meitner figured out that nuclear fission was happening, while her colleague Otto was staring blankly at their data in confusion, and proved Enrico Fermi wrong in the process. Enrico and Otto both got Nobel Prizes. Lise got a National Women's Press Club award.\nZombie Marie Curie: They finally named an element after her, but not until 60 years later.\n\nZombie Marie Curie: Emmy Noether fought past her Victorian-era finishing-school upbringing, pursued mathematics by auditing classes, and, after finally getting a Ph.D, was permitted to teach only as an unpaid lecturer (often under male colleagues' names).\nWoman: Was she as good as them?\nZombie Marie Curie: She revolutionized abstract algebra, filled gaps in relativity, and found what some call the most beautiful, deepest result in theoretical physics.\nWoman: Oh.\n\nZombie Marie Curie: But you don't become great by trying to be great. You become great by wanting to do something, and then doing it so hard that you become great in the process.\n\nZombie Marie Curie: So don't try to be the next me, Noether, or Meitner. Just remember that if you want to do this stuff, you're not alone.\nWoman: Thanks.\nZombie Marie Curie: Also, avoid radium. Turns out it kills you.\nWoman: I'll try.\n\n{{Title text: Although not permanently.}}","alt":"Although not permanently.","img":"https://imgs.xkcd.com/comics/marie_curie.png","title":"Marie Curie","day":"9"},null,null,null,null,null,null,null,{"month":"5","num":904,"link":"","year":"2011","news":"","safe_title":"Sports","transcript":"[[Two commentators sit behind a desk.]]\nCommentator 1: A weighted random number generator just produced a new batch of numbers.\nCommentator 2: Let's use them to build narratives!\nALL SPORTS COMMENTARY\n\n{{Title text: Also, all financial analysis. And, more directly, D&D.}}","alt":"Also, all financial analysis. And, more directly, D&D.","img":"https://imgs.xkcd.com/comics/sports.png","title":"Sports","day":"27"},null,{"month":"6","num":906,"link":"","year":"2011","news":"","safe_title":"Advertising Discovery","transcript":"Advertising discovery:\n[[Person sits at computer, reading an ad on the screen. The bracketed superscripts are blue.]]\nAd: Turgidax(R) triples[2] your penis size overnight,[2][5] improving both your sexual attractiveness[2][7] and your cardiovascular health.[7][8][9]\nPerson (thinking): Sounds legit.\nWikipedia has trained us to believe anything followed by little blue numbers in brackets.\n\n{{Title text: When advertisers figure this out, our only weapon will be blue sharpies and \"[disputed]\".}}","alt":"When advertisers figure this out, our only weapon will be blue sharpies and \"[disputed]\".","img":"https://imgs.xkcd.com/comics/citations.png","title":"Advertising Discovery","day":"1"},null,null,null,{"month":"6","num":910,"link":"","year":"2011","news":"","safe_title":"Permanence","transcript":"((A large panel the combined width of the four panels below it.))\n[[A blue Linux terminal installer screen with a grey box that is labeled \"[!]CONFIGURE THE NETWORK\" in red. Below, in black, it reads \"Please enter the hostname for the system.\" Below is an empty blue entry box with a cursor and dashed underscore, and below this it says \"<GO BACK>\".]]\n\n[[A man sits at his computer, a woman stands behind him.]]\nWoman: You've been staring at that screen a while.\nMan: Picking a good server name is important.\n\n[[The woman stares at him.]]\n\n[[She continues to stare.]]\n\n[[The man pushes his chair back, puts one elbow on the back of the chair and points with his other hand at the screen.]]\nWoman: And yet you settled on \"Caroline\" for our daughter in like 15 seconds.\nMan: But this is a \nserver!\n -- Besides, I had to- you were trying to name her \"epidural.\" \nWoman: Those \nwere\n good drugs.\n\n{{Title text: This hostname is going in dozens of remote config files. Changing a kid's name is comparatively easy!}}","alt":"This hostname is going in dozens of remote config files. Changing a kid's name is comparatively easy!","img":"https://imgs.xkcd.com/comics/permanence.png","title":"Permanence","day":"10"},null,null,null,null,null,null,null,null,null,null,{"month":"7","num":921,"link":"","year":"2011","news":"","safe_title":"Delivery Notification","transcript":"[[The first panel is a UPS InfoNotice(r).  Most of the text on it is just scribbles, though the company logo and header is clear.]]\n\n[[A person opens their door to see the InfoNotice(r).  From off panel, a second person reacts.]]\nPerson:  \nWhat!\n  I've been here all day!\nOff-panel person 2: Huh?\nPerson: They have my laptop.\n\n[[Now both people are visible.  The first is making an expansive gesture of annoyance.]]\nPerson 2: So get it tomorrow.\nPerson: I fly out in the morning and they don't open till noon!\nPerson 2: Sucks.\n\n[[The first person is at a laptop.  The second is once again off-panel.]]\nPerson: It's \nright there\n.  I can see the UPS building on the map.\nOff-panel person 2: Ok...\n\n[[Dramatic zoom to the person's upper torso and face, along with clenched fist.]]\nPerson: My laptop is there.  It's \nmine\n.\nPerson: I'm going to get it.\n\n[[Even more dramatic zoom!  The person's featureless face fills the panel.]]\nOff-panel person 2: They won't let you.\nPerson: Who are they to keep from me what is mine?\nOff-panel person 2: Dude, they --\n\n[[The person spins, raising a finger, most likely to indicate some sort of quest at hand.]]\nPerson: A quest is at hand!\nOff-panel person 2: Security's gonna throw you out.\nPerson: I fear neither death nor pain.  But I will not go unarmed.\n\n((Three inset panels overlap, in a montage format.  The person narrates.))\n[[Elves in long robes stand around a table, on which lies a broken sword.]]\nNarrating person: Light the beacons and send word to the Elves.  They must reforge the sword of my fathers.\n\n[[An Elf beats the sword together on an anvil.]]\n\n[[An Elf rides a horse, silhouetted by the full moon.]]\nNarrating person: Ere dawn, I will go forth to the Sorting Depot.\n\n((The montage ends and normal panels resume.))\n[[The Elf knocks at the door, sword in scabbard held under arm.]]\n<<Knock knock knock knock>>\n\n[[The person opens the door, to find a second InfoNotice(r) stuck on top of the first.  The Elf is gone.]]\n\n{{Title text: You can arrange a pickup of your sword in Rivendell between the hours of noon and 7:00 PM.}}","alt":"You can arrange a pickup of your sword in Rivendell between the hours of noon and 7:00 PM.","img":"https://imgs.xkcd.com/comics/delivery_notification.png","title":"Delivery Notification","day":"6"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"8","num":938,"link":"","year":"2011","news":"","safe_title":"T-Cells","transcript":"[[Two people are standing facing each other, having a conversation. One is holding a laptop.]]\nPerson #1 (with laptop): What's the deal with this leukemia trial? {{Citation: Nejm, Aug 10, 2011}}\nPerson #2: Gotta wait and see.\nPerson #2: Helping the immune system attack tumors has been a longtime research target.\nPerson #2: Lots of promising leads. Often they don't pan out.\n\nPerson #1: What'd these guys do?\nPerson #2: They took some of the patient's T-cells and patched their genes so they'd attack the cancer. That hasn't been enough in the past but their patch also added code to get the T-cells to replicate wildly and persist in the body.\n\nPerson #1: Which worked, but created its own set of problems?\nPerson #2: How'd you guess? But I think the craziest part is the way they insert the patched genes.\nPerson #1: How?\nPerson #2: Well, think - What specializes in invading and modifying T-cells?\nPerson #1: Seriously?\nPerson #2: Yup. Must've been a fun conversation.\n\n[[The last panel is set in a doctors office. A patient is sitting on the observation bed talking to their doctor.]]\nPatient: Ok, so I have blood cells growing out of control, so you're going to give me different blood cells that *also* grow out of control?\nDoctor: Yes, but it's ok, because we've treated *this* blood with HIV!\nPatient: Are you sure you're a doctor?\nDoctor: Almost definitely.\n\n{{Title text: 'We're not sure how to wipe out the chimeral T-cells after they've destroyed the cancer. Though I do have this vial of smallpox ...'}}","alt":"'We're not sure how to wipe out the chimeral T-cells after they've destroyed the cancer. Though I do have this vial of smallpox ...'","img":"https://imgs.xkcd.com/comics/t_cells.png","title":"T-Cells","day":"15"},null,null,null,null,{"month":"8","num":943,"link":"","year":"2011","news":"","safe_title":"Empirical","transcript":"[[Two people are standing together, one with long hair (presumably female) and one without visible hair (presumably male).]]\nWoman: Will you marry me?\n\n[[The male person throws his hands in the air excitedly.]]\nMan: Let's find out!\n\n[[The couple are now standing in front of an altar. A flower arch stretches over the couple and a person is standing behind the altar. The female person is wearing a knee length white dress and a veil. The male person is wearing a bow tie. They are holding hands.]]\n\n[[The couple stand together, still dressed from the wedding and still holding hands.]]\nMan: Apparently, yes!\n\n{{Title text: I'm as surprised as you!}}","alt":"I'm as surprised as you!","img":"https://imgs.xkcd.com/comics/empirical.png","title":"Empirical","day":"26"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"10","num":971,"link":"","year":"2011","news":"","safe_title":"Alternative Literature","transcript":"[[Person 1 and 2 stand in front of Person 2's bookcase.  Person 1 flips through a number of them]]\nPerson 1: All your books are full of blank pages.\nPerson 2: Not true. That one has some ink on page 78.\n[[Person 1 looks at page 78]]\nPerson 1: A smudge.\nPerson 2: So?\n\nPerson 1: There are no words. You're not reading. There's no *story* there.\nPerson 2: Maybe not for you. When I look at those books, I think about all *kinds* of stories.\n\nPerson 2: Reading is about more than what's on the page. Holding a book prompts my mind to enrich itself.  Frankly, I suspect the book isn't even necessary.\n\nPerson 2: The whole industry is evil. Greedy publishers and rich authors try to convince us our brains *need* their words. But I refuse to be a sucker.\nPerson 1: Who sold you all these blank books?\n\n{{Title text: I just noticed CVS has started stocking homeopathic pills on the same shelves with--and labeled similarly to--their actual medicine. Telling someone who trusts you that you're giving them medicine, when you know youâre not, because you want their money, isnât just lying--itâs like an example youâd make up if you had to illustrate for a child why lying is wrong.}}","alt":"I just noticed CVS has started stocking homeopathic pills on the same shelves with--and labeled similarly to--their actual medicine. Telling someone who trusts you that you're giving them medicine, when you know you’re not, because you want their money, isn’t just lying--it’s like an example you’d make up if you had to illustrate for a child why lying is wrong.","img":"https://imgs.xkcd.com/comics/alternative_literature.png","title":"Alternative Literature","day":"31"},null,null,null,null,{"month":"11","num":976,"link":"","year":"2011","news":"","safe_title":"Sail","transcript":"[[A person is sailing a cat-rigged sailboat. He detaches the mainsheet from the stern.]]\n\n[[The sailor pulls back on the mainsheet.]]\n\n[[The sailor stands up and pulls harder, causing the sail to arc outward.]]\n\n[[He continues pulling as hard as he can, and the sail begins to buckle outward in a semi-circular shape.]]\n\n[[Finally, the sail buckles so hard that a bubble forms and detaches from the sail, which begins to return to its normal shape.]]\n\n[[The sailor sits down and scratches his head in confusion as the bubble floats away.]]\n\n{{Title text: It only works a few times before you have to capsize the boat in a soap lagoon again.}}","alt":"It only works a few times before you have to capsize the boat in a soap lagoon again.","img":"https://imgs.xkcd.com/comics/sail.png","title":"Sail","day":"11"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"2","num":1011,"link":"","year":"2012","news":"","safe_title":"Baby Names","transcript":"[[A man sits at a desk, thinking with his hand on his chin, his other hand holding a pen over a piece of paper. A woman stands behind him, looking over his shoulder, also with her hand on her chin.]] \n((Above the drawing is the list they are writing, in handwriting.))\n\nNames for daughter\n1. Ponzi\n2. Eeemily\n3. Fire Fire\n4. Chipotla\n5. Astamouthe\n6. Eggsperm\n7. [sound of record scratch]\n8. Parsley\n9. Hot'n'Juicy Ann\n10. Ovary\n11. Friendly\n12. Sean (pronounced \"seen\")\n13. Joyst\n\n{{Title text: I've been trying for a couple years now but I haven't been able to come up with a name dumber than 'Renesmee'.}}","alt":"I've been trying for a couple years now but I haven't been able to come up with a name dumber than 'Renesmee'.","img":"https://imgs.xkcd.com/comics/baby_names.png","title":"Baby Names","day":"1"},null,null,null,null,{"month":"2","num":1016,"link":"","year":"2012","news":"","safe_title":"Valentine Dilemma","transcript":"[[A man, hand on chin, thinking aloud to himself.]]\nMan: Flowers seem so ... trite. Something homemade? Easy to look halfhearted.\n\n[[A woman sits at her computer, one arm leaning on the back of her chair, the other hand on her chin, thinking aloud.]]\nWoman: Valentine's Day is a corporate construct. - But hard to opt out of. - I don't want to be a consumer tool \nor\n an inconsiderate jerk.\n\n[[The man walks down the street, still thinking aloud.]]\nMan: How do I fight cliché? I could get her a gift on a \ndifferent\n day. - But what am I proving? \n\n[[The woman is leaning back in her chair, playing with a stapler.]]\nWoman: It's such a contrived ritual. But maybe rituals are necessary social glue.\n\n[[The man puts his hands to his face in panic.]]\nMan: Forty presents. No, \nnone!\n No, give her five items then steal two from her. - Ok, breathe. Keep it together.\n\n[[The woman is also panicking, one hand to her face, the other still holding the stapler.]]\nWoman: And what if he gets me something I don't reciprocate? - Prisoners Dilemma! - AAAAAAAAAA!!\n\n[[The man and woman meet. The man is holding a basket and a jar of hammers. The woman's hand is stuck to her face.]]\nMan: I got you Easter candy and a jar of hammers.\nWoman: I panicked and stapled my hand to my face.\nMan: We overthought this.\nWoman: Yes.\n\n{{Title text: The worst resolution to the Valentine Prisoner's Dilemma when YOU decide not to give your partner a present but your PARTNER decides to testify against you in the armed robbery case.}}","alt":"The worst resolution to the Valentine Prisoner's Dilemma when YOU decide not to give your partner a present but your PARTNER decides to testify against you in the armed robbery case.","img":"https://imgs.xkcd.com/comics/valentine_dilemma.png","title":"Valentine Dilemma","day":"13"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"3","num":1031,"link":"http://wiki.xkcd.com/irc/Leopard","year":"2012","news":"A helpful reader has provided an <a href=\"http://userscripts.org/scripts/show/128626\">s/keyboard/leopard/ user script</a>.","safe_title":"s/keyboard/leopard/","transcript":"[[Two browser windows:  \nThe first is a wikipedia article on computer leopards. Visible text: \n\"[...]which range from pocket sized leopards to large desktop leopards, the leopard remains the most common user input device. In addition to text entry, specialized leopards are used for computer gaming.  While many computer interfaces rely on mice or touchscreens, UNIX-style command-line interfaces require users to interact with a leopard.\"  There is a picture of the venerable, highly durable IBM Model M Leopard.\nThe second is a messageboard discussing leopard issues. Listed topics include:\n\"Weird, my leopard just switched to Chinese\"\n\"I work with one leopard on my desk and another in the leopard tray\"\n\"Ever cleaned a leopard? They're *filthy*\"\n\"The iPhone virtual leopard is the fastest IMO\"\n\"I rarely email from my phone - I'm so slow when I'm not on a leopard\"\n\"My leopard died when I spilled tea on it :(\"]]\nThe Internet got 100 times better when, thanks to an extension with a typo'd regex, my browser started replacing the word \"keyboard\" with \"leopard\".\n\n{{Title text: Problem Exists Between Leopard And Chair}}","alt":"Problem Exists Between Leopard And Chair","img":"https://imgs.xkcd.com/comics/s_keyboard_leopard.png","title":"s/keyboard/leopard/","day":"19"},null,null,null,null,null,null,null,null,null,null,{"month":"4","num":1042,"link":"","year":"2012","news":"","safe_title":"Never","transcript":"[[Person staring into a pond]]\nPerson: I know that no matter where i go or who I build a life with\n\nPerson: I will never have with anyone what I had with you.\n\n[[Person walks off]]\nPerson: Thank god.\n\n{{Title text: I'll never forget you--at least, the parts of you that were important red flags.}}","alt":"I'll never forget you--at least, the parts of you that were important red flags.","img":"https://imgs.xkcd.com/comics/never.png","title":"Never","day":"13"},null,null,null,null,null,null,null,null,null,null,null,null,{"month":"5","num":1055,"link":"","year":"2012","news":"","safe_title":"Kickstarter","transcript":"[[A kickstarter page with zero donations, a target of $5,000, and 90 days to go.  Black Hat Man has posted a video and a description of his project, the first lines of which are visible]]\nTime was, anyone with a webcam and an idea could raise boatloads of cash on kickstarter. But with increased popularity comes tougher competition.  Now, to get support, you need a really standout video or compelling writeup.\nI have anidea for a Kickstarter campaign that could raise millions, but I need your help to craft the perfect pitch.\nIf I raise $5,000, I'll be able to devote the.. [[pitch ends here]]\n{{Title text: If you pledge more than $50 you'll get on the VIP list and have first dibs on a slot on ANY of the pledge levels in the actual campaign.}}","alt":"If you pledge more than $50 you'll get on the VIP list and have first dibs on a slot on ANY of the pledge levels in the actual campaign.","img":"https://imgs.xkcd.com/comics/kickstarter.png","title":"Kickstarter","day":"14"},null,null,null,null,null,null,null,null,null,null,null,null,{"month":"6","num":1068,"link":"","year":"2012","news":"","safe_title":"Swiftkey","transcript":"[[Person 1 shows off phone to Person 2]]\nPerson 1: Have you tried SwiftKey?  It's got the first decent language model I've seen. It learns from your SMS\nEmail archives what words you use together most often.\n\nPerson 1: Spacebar inserts its best guess. So if I type \"The Empi\" and hit space three times, it types \"The Empire Strikes Back\".\nPerson 2: What if you mash space in a blank message?\n\nPerson 1: I guess it fills in your most likely first word, then the word that usually follows it..\nPerson 2: So it builds up your \"typical\" sentence. Cool! Let's see yours!\nPerson 1: Uh--\n\nSwiftKey: I\n\nSwiftKey: Am\n\nSwiftKey: So\n\nSwiftKey: Sorry\n\nSwiftKey: That's\n\nSwiftKey: Never\n\nSwiftKey: Happened\n\nSwiftKey: Before.\n\n{{Title text: Although the Markov chain-style text model is still rudimentary; it recently gave me \"Massachusetts Institute of America\". Although I have to admit it sounds prestigious.}}","alt":"Although the Markov chain-style text model is still rudimentary; it recently gave me \"Massachusetts Institute of America\". Although I have to admit it sounds prestigious.","img":"https://imgs.xkcd.com/comics/swiftkey.png","title":"Swiftkey","day":"13"},null,null,null,{"month":"6","num":1072,"link":"","year":"2012","news":"","safe_title":"Seventies","transcript":"Person 1: Nice jacket. Hey -- the Seventies called.\nPerson 2: Oh? What'd they want?\n\n[[Person 1 looking at phone]]\nPerson 1: I don't know. They didn't leave a message.\nPerson 2: Weird.\n\n1974:\n[[Person in bell bottoms using a rotary phone to call the present day, with an incredulous look on his face.]]\nVoicemail service: If you'd like to leave a message, press \"1\".\n\n{{Title text: Hey, man, the 1670s called. They were like 'Wherefore this demonic inÅ¿trument? By what Å¿orcery does it produce Å¿uch Å¿ounds?\"}}","alt":"Hey, man, the 1670s called. They were like 'Wherefore this demonic inſtrument? By what ſorcery does it produce ſuch ſounds?\"","img":"https://imgs.xkcd.com/comics/seventies.png","title":"Seventies","day":"22"},null,null,null,null,null,null,null,{"month":"7","num":1080,"link":"https://xkcd.com/1080/large/","year":"2012","news":"","safe_title":"Visual Field","transcript":"Your Central Visual Field\n\n((This comic contains numerous visual elements arranged around a central point, and are intended to represent locations in a sphere with the eyeball as the center.  Underlaid below all of the elements are concentric circles representing degrees from straight ahead, using the eyeball's point of view, denoting where these elements would appear in someone's field of vision given proper setup.  For this description, elements will be described using this grid plus location in degrees within the specified circle, placing 0 degrees to the right and going counterclockwise, separated with the word \"mark\".))\n\n[[At the top are the instructions to view this page]]\nLook at the center with your eyes this far from the screen.\n[[A rolled-up sheet of paper that equals about 55 total horizontal degrees in width in the measurement of the chart]]\n(You can roll up a sheet of paper and cut it - or zoom the page - so it matches this image)\n\n17 mark 0: right eye blind spot. \n\nfrom 0 to 30 mark 15: [[The same image, increasing in absolute size from a very tiny object in the center to one about 20x original size at 30 degrees]]\nDetail - We only see at high resolution over a small area in the center of our vision where retinal cells are densest (the fovea).  If you stare at the center of this chart, your eyes are seeing all these panels at roughly the same level of detail.\n\n9 mark 105: Moon.\n\n7 mark 112: Supermoon. \n\nfrom 0 to 20 mark 170: [[Sets 3 partially overlapping circles in multiple locations along this path. Each set has a primary color in each circle and additive colors in the overlap areas, with color saturation decreasing sharply as the sets leave the center.]] \nColor Vision: We don't see much color outside the center of our vision - our brains keep track of what color things are and fill it in for us.\n\n17 mark 180: Left Eye Blind Spot. (not pictured: T-Boz blind spot, Chilli blind spot)\n\nfrom 0 to infinity mark from 180 to 205: [[A swath of blue, with heavier saturation up to 5 degrees from center to fading, but never gone out to the edges of the image]]\nfrom 0 to 7 from 205 to 235:[[A swath of red, with full saturation in the center and fading out completely at 7 degrees from center]]\nfrom 0 to 7 from 235 to 270:[[A swath of green, with full saturation in the center and fading out completely at 7 degrees from center]]\nRed and green-sensitive cones are mainly limited to the center of our vision.  We have few blue-sensitive cone cells, but they're found out to the edge of our vision.\n\n25 mark 205: [[A small whisp of white in a swath of blue]]\nBlue-sky sprites: These tiny, darting spots, visible against smooth blue backgrounds, are white cells moving in the blood vessels over the retina]]\n\n5 mark 195: [[a long blob, slightly distorting the blue swath]]\nFloaters: Some types of floaters are caused by breakdown of your eyeball goop as you age, but this type is some other kind of debris near the retina.  I don't know what.\n\n10 mark 270: [[An askew crosshair and circle, with faint blue and yellow wedges inside]]\nHumans can see polarization - Stare at a white area on an LCD display while rotating it or your head fast [[use straight ahead as the axis of rotation]].  Polarization direction is shown by a faint central yellow\nblue shape.  (Also visible in deep blue skies)\n\nfrom 0 to 30 mark 340: [[The same image, increasing in absolute size from a very tiny object in the center to one about 20x original size at 30 degrees. The brightness of the image varies from black at 2 mark 340, to gray at 5 mark 340, to nearly white at 10 mark 340, to slightly grayer at 20 mark 340, to medium gray at 30 mark 340.]]\nNight Vision: Cone cells (sharp, central color vision) don't work in low light, but rod cells (monochrome, low-res, non-central) do.  This is why you can walk around in dim light, but not read.  It's also why you can spot fainter stars by looking next to them.\n\n\n\n\n\n{{Title text: I recently learned something that solved a mystery that had bugged me since childhood--why, when I looked at an analog clock, the hand would sometimes seem to take a couple seconds to start ticking. Google \"stopped clock illusion\".}}","alt":"I recently learned something that solved a mystery that had bugged me since childhood--why, when I looked at an analog clock, the hand would sometimes seem to take a couple seconds to start ticking. Google \"stopped clock illusion\".","img":"https://imgs.xkcd.com/comics/visual_field.png","title":"Visual Field","day":"11"},null,null,{"month":"7","num":1083,"link":"","year":"2012","news":"","safe_title":"Writing Styles","transcript":"If you post: \nyou sound like\n\n((This is a chart with the above two labeled columns.  The rows will be represented below in the same format))\n\n\"Ron Paul is the only candidate who offers us a real choice!\":\nA teenager\n\n\"its gettin 18 so ill b here 4 prob 2 more hrs tops\":\nA senator\n\n\n\n{{Title text: I liked the idea, suggested by h00k on bash.org, of a Twitter bot that messages prominent politicians to tell them when they've unnecessarily used sms-speak abbreviations despite having plenty of characters left.}}","alt":"I liked the idea, suggested by h00k on bash.org, of a Twitter bot that messages prominent politicians to tell them when they've unnecessarily used sms-speak abbreviations despite having plenty of characters left.","img":"https://imgs.xkcd.com/comics/writing_styles.png","title":"Writing Styles","day":"18"},{"month":"7","num":1084,"link":"","year":"2012","news":"","safe_title":"Server Problem","transcript":"Person 1, sitting at laptop: I, um, messed up my server again.\nPerson 2: I'll take a look.  You have the *weirdest* tech problems\n\n[[Person 2 uses the root prompt]]\n~# ls\n\n[[computer returns the following]]\n\nusr\nshare\nAdobe\ndoc\nexample\nandroid_vm\nroot\nsbin\nls.jar:\nError: Device is not responding.\n[[Person 2 has an amazingly incredulous look on their face]]\n\nPerson 2: What did you *do*!?\nPerson 1: Maybe the device is busy. Should I try it later?\nPerson 2: You should shut down this system and wait for the Singularity.\n\n{{Title text: Protip: Annoy Ray Kurzweil by always referring to it as the 'Cybersingularity'.}}","alt":"Protip: Annoy Ray Kurzweil by always referring to it as the 'Cybersingularity'.","img":"https://imgs.xkcd.com/comics/server_problem.png","title":"Server Problem","day":"20"},null,{"month":"7","num":1086,"link":"","year":"2012","news":"","safe_title":"Eyelash Wish Log","transcript":"((The panel appears to be the log from a 'wish bureau'.))\n\nEyelash Wish Log\n   Wish Bureau ID #:\n            21118378\n         Date range:\n        Jan-Apr 2012\n[[The 'Wisher' is black hat guy.]]\nWisher\n\nDate    Wish\nJan 09  That wishing on eyelashes worked\nJan 12  A pony\nJan 15  Unlimited wishes\nJan 19  Revocation of rules prohibiting unlimited wishes\nJan 20  A finite but arbitrarily large number of wishes\nJan 28  The power to dictate the rules governing wishes\nFeb 05  Unlimited eyelashes\nFeb 06  That wish-granting entities be required to interpret wishes in accordance with the intent of the wisher\nFeb 08  That wish-granting entities be incapable of impatience\nFeb 12  Unlimited breadsticks\nFeb 12  Veto power over others' wishes\nFeb 19  Veto power over others' wishes and all congressional legislation\nFeb 23  The power to override any veto\nFeb 27  The power to see where any shortened url goes without clicking\nFeb 29  The power to control the direction news anchors are looking while they talk\nMar 07  The power to introduce arbitrary error into Nate Silver's predictions\nMar 15  A house of stairs\nMar 23  A universe which is a replica of this one sans rules against meta-wishes\nMar 29  Free transportation to and from that universe\nApr 02  A clear explanation of how wish rules are structured and enforced\nApr 07  The power to banish people into the TV show they're talking about\nApr 08  Zero wishes\nApr 15  Veto power over clocks\nApr 22  A Pokéball that works on strangers' pets\n\n{{Title text: Ooh, another one. Uh ... the ability to alter any coefficients of friction at will during sporting events.}}","alt":"Ooh, another one. Uh ... the ability to alter any coefficients of friction at will during sporting events.","img":"https://imgs.xkcd.com/comics/eyelash_wish_log.png","title":"Eyelash Wish Log","day":"25"},null,null,{"month":"8","num":1089,"link":"","year":"2012","news":"","safe_title":"Internal Monologue","transcript":"[[The scene is a party.  Two characters are talking - the entirety of the text is a thought bubble of one of the two.]]\nThinker:  Am I smiling enough?  Should I be leaning on something?  Where should my hands go?  I hope he doesn't ask me what his name is.  I've said \"yeah\" too much; what are some other agreeing words?  Oh crap, his story just got sad \nstop smiling stop smiling\n\n\n{{Title text: Oh right, eye contact. Ok, good, holding the eye contact ... holding ... still holding ... ok, too long! Getting weird! Quick, look thoughtfully into space and nod. Oh, dammit, said 'yeah' again!}}","alt":"Oh right, eye contact. Ok, good, holding the eye contact ... holding ... still holding ... ok, too long! Getting weird! Quick, look thoughtfully into space and nod. Oh, dammit, said 'yeah' again!","img":"https://imgs.xkcd.com/comics/internal_monologue.png","title":"Internal Monologue","day":"1"},null,null,null,null,null,null,{"month":"8","num":1096,"link":"","year":"2012","news":"","safe_title":"Clinically Studied Ingredient","transcript":"I can't help but admire the audacity of the marketer who came up with the phrase \"contains a clinically studied ingredient\"\n[[Two people are about to enter a bed for.. activities]]\nPerson 1: Don't worry - I've been tested.\nPerson 2: ...and you're clean?\nPerson 1: So many questions!\n\n{{Title text: Blatantly banking on customers not understanding that it's like a Hollywood studio advertising that their new movie was 'watched by Roger Ebert'.}}","alt":"Blatantly banking on customers not understanding that it's like a Hollywood studio advertising that their new movie was 'watched by Roger Ebert'.","img":"https://imgs.xkcd.com/comics/clinically_studied_ingredient.png","title":"Clinically Studied Ingredient","day":"17"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"11","num":1134,"link":"","year":"2012","news":"","safe_title":"Logic Boat","transcript":"[[A person shows up at a boat docked at the edge of a river.  The person has brought along a head of cabbage, a goat, and a wolf.]]\nProblem: The boat only holds two, but you can't leave the goat with the cabbage or the wolf with the goat.\n\n[[The wolf looks curiously at the lumpy bally that's been left behind while the person goes off with the goat]]\nSolution: 1. Take the goat across\n\n[[The goat remains tied up on the far side.  The wolf watches the person come back]]\n2. Return alone.\n\n[[The wolf thinks \"aww no mo bally\" as the person goes off]]\n3. Take the cabbage across. \n\n4. Leave the wolf.  Why did you have a wolf?\n[[The wolf goes off all sad-like]]\n\n\n{{Title text: Or a cabbage, for that matter. The goat makes sense. Goats are fine.}}","alt":"Or a cabbage, for that matter. The goat makes sense. Goats are fine.","img":"https://imgs.xkcd.com/comics/logic_boat.png","title":"Logic Boat","day":"14"},null,null,null,null,null,null,null,{"month":"12","num":1142,"link":"","year":"2012","news":"","safe_title":"Coverage","transcript":"((An inset panel inside the main panel.))\n[[A close-up on a man holding a cellphone.]]\nMan: Man, the coverage in here is \nawfu-\n\n\n((The main panel.))\n[[The man is interrupted by another man punching him in the face, and he drops his phone to the ground.]]\nFARADAY CAGEMATCH\n\n{{Title text: My resonant tunneling diode phone has limited range but a short enough wavelength to penetrate even the densest cages. This gives me a major combat advantage, hopefully.}}","alt":"My resonant tunneling diode phone has limited range but a short enough wavelength to penetrate even the densest cages. This gives me a major combat advantage, hopefully.","img":"https://imgs.xkcd.com/comics/coverage.png","title":"Coverage","day":"3"},null,null,null,null,null,null,{"month":"12","num":1149,"link":"","year":"2012","news":"","safe_title":"Broomstick","transcript":"[[A woman in red slippers, Dorothy, stands talking to somebody off-screen.]]\nOff-screen character: Bring me the broomstick of the wicked witch of the West and I'll take you home. \nDorothy: Got it. \n\n[[The woman stands at the foot of a staircase talking to the off-screen wicked witch of the West.]]\nDorothy: You can have the slippers if you let me borrow your broom.\nWicked witch of the West: Deal.\n\n[[Dorothy, now slipperless, walks along whistling with a broom over her shoulder.]]\n\n[[Dorothy and another character are in a hot air balloon floating off the ground. Mountains are in the background. Looking on are the tin man, the lion, and a scarecrow.]]\nDorothy: That was easy. \n\n{{Title text: 'Broom first, then slippers.' 'How do I know you'll return the broom once you've secured your ticket?' 'I'll leave my little dog as collateral.' 'Great. Pleasure doing business!'}}","alt":"'Broom first, then slippers.' 'How do I know you'll return the broom once you've secured your ticket?' 'I'll leave my little dog as collateral.' 'Great. Pleasure doing business!'","img":"https://imgs.xkcd.com/comics/broomstick.png","title":"Broomstick","day":"19"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"2","num":1179,"link":"","year":"2013","news":"","safe_title":"ISO 8601","transcript":"Public Service Announcement:\n\nOur different ways of writing dates as numbers can lead to online confusion.  That's why in 1988 ISO set a global standard numeric date format.  \n\nThis is *the* correct way to write numeric dates:\n\n2013-02-27\n\nThe following formats are therefore discouraged:\n\n02\n27\n2013 02\n27\n13 27\n02\n2013 27\n02\n13\n20130227 2013.02.27 27.02.13 27-02-13\n27.2.13 2013.CC.27 (27\n2)-13 2013.158904109\nMMXII-II-XXVII MMXII(LVII\nCCCLXV) 1330300800 [[this is the UNIX time for *2012*-02-27, Randall]]\n((3+3)x(111+1)-1)x3\n3-1\n.^3 [the numbers 2013, 02, and 27 written overlapping each other] [a black, hissing cat with 2-27-13 written on it]\n10\n11011\n1101 02\n27\n20\n13\n[[the following is the last entry]]\n2 3  1 4\n0 1  2 3 7\n5   67   8\n\n{{Title text: ISO 8601 was published on 06\n05\n88 and most recently amended on 12\n01\n04.}}","alt":"ISO 8601 was published on 06/05/88 and most recently amended on 12/01/04.","img":"https://imgs.xkcd.com/comics/iso_8601.png","title":"ISO 8601","day":"27"},null,null,null,null,null,null,null,null,{"month":"3","num":1188,"link":"","year":"2013","news":"","safe_title":"Bonding","transcript":"class Ball extends Throwable {} \nclass P { \n    P target;\n    P(P target) { \n        this.target = target;\n    }\n    void aim(Ball ball) { \n        try { \n            throw ball; \n        }\n        catch (Ball b) { \n            target.aim(b);\n        }\n    }\n    public static void main(String[] args) { \n        p parent = new P(null);\n        p child = new P(parent);\n        parent.target = child; \n        parent.aim(new Ball());\n    }\n}\n{{Title text: I'm trying to build character but Eclipse is really confusing.}}","alt":"I'm trying to build character but Eclipse is really confusing.","img":"https://imgs.xkcd.com/comics/bonding.png","title":"Bonding","day":"20"},null,null,null,null,null,{"month":"4","num":1194,"link":"","year":"2013","news":"","safe_title":"Stratigraphic Record","transcript":"[[A view of the Earth from space.]]\nNearly 4.5 billion years ago, Earth had liquid water. But all the crust older than 3.5 billion years has been recycled into the mantle by subduction.\n\n[[The same view.]]\nA billion years of the stratigraphic record, the memory of the hills, is forever lost to us. What was it \nlike\n here, four billion years ago?\n\n[[The same view.]]\nEarth, what \nsecrets\n do you have?\n\n[[The same view.]]\nEarth: come closer\n\n[[A closer view.]]\n\n[[An even closer view.]]\nEarth: \ni'll never tell.\n\n\n\n{{Title text: All we have are these stupid tantalizing zircons and the scars on the face of the Moon.}}","alt":"All we have are these stupid tantalizing zircons and the scars on the face of the Moon.","img":"https://imgs.xkcd.com/comics/stratigraphic_record.png","title":"Stratigraphic Record","day":"3"},null,null,null,{"month":"4","num":1198,"link":"","year":"2013","news":"","safe_title":"Geologist","transcript":"[[A figure wearing goggles and ear defenders walks into a patch of rocks. He's carrying a hammer and a pistol. There is a van in the background labelled 'Dept. of Geology'.]]\n\n[[The man drops the hammer and fires the pistol into the ground.]]\n<<BLAM BLAM BLAM>>\n\n[[The man drops the pistol and starts hammering away a chunk of rock.]]\n<<Clink clink>>\n\n[[The man sits behind a desk reading some paper. He has a variety of certificates and pictures on the wall behind him. He seems important. On the wall is the chunk of rock, mounted on a plaque, with a caption.]]\nEarth\n4,500,000,000BCE - April 12, 2013\n\n{{Title text: 'It seems like it's still alive, Professor.' 'Yeah, a big one like this can keep running around for a few billion years after you remove the head.\"}}","alt":"'It seems like it's still alive, Professor.' 'Yeah, a big one like this can keep running around for a few billion years after you remove the head.\"","img":"https://imgs.xkcd.com/comics/geologist.png","title":"Geologist","day":"12"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"6","num":1229,"link":"","year":"2013","news":"","safe_title":"Screensaver","transcript":"I've been staring at the screen every night for twenty years, and it finally happened. \n\n[[A star field.]]\n\n[[The same star field, but there's a larger white dot glowing in the middle.]]\n\n[[The same star field, but that larger white dot's looking bigger now. Oh. It's clearly a star.]]\n\n[[The screen is filled with white. It's coming straight for us.]]\n\n[[The screen is filled with static.]]\nSignal lost\n\n{{Title text: I'm entering my 24th year of spending eight hours a day firing the Duck Hunt gun at the flying toasters. I'm sure I'll hit one soon.}}","alt":"I'm entering my 24th year of spending eight hours a day firing the Duck Hunt gun at the flying toasters. I'm sure I'll hit one soon.","img":"https://imgs.xkcd.com/comics/screensaver.png","title":"Screensaver","day":"24"},null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"7","num":1243,"link":"","year":"2013","news":"","safe_title":"Snare","transcript":"[[Black hat guy is sitting at a desk, using a laptop. He's talking to a figure standing behind him.]]\nFigure: They said on the news that they found a giant ring lying in a field outside Chicago. Strung with some kind of superstrong mesh. \nBlack hat guy: Mhm? \n\nFigure: Then they found a 260-mile long shaft connected to the ring, running from Chicago to St. Louis. In St. Louis they found a gigantic winch. \nBlack hat guy: Did they. \n\nFigure: It sounds kind of like... ...a butterfly net. \n\nFigure: ... Are you planning to catch the International Space Station?\nBlack hat guy: I'm planning to catch *an* international space station. Not sayin' which. \n\n{{Title text: It's going in A collection of satellites skewered with pins and mounted in display boxes. Not necessarily MY collection.}}","alt":"It's going in A collection of satellites skewered with pins and mounted in display boxes. Not necessarily MY collection.","img":"https://imgs.xkcd.com/comics/snare.png","title":"Snare","day":"26"},null,null,{"month":"8","num":1246,"link":"","year":"2013","news":"","safe_title":"Pale Blue Dot","transcript":"[[A figure stands in front of a projector screen with a pointer. He is, presumably, addressing a room of his peers off-panel.]]\nLecturer: Consider this pale blue dot. That's here. That's home. That's us. Everyone you love, every human being who ever was, every saint and sinner in the history of our species lived out their lives on this mote of dust suspended in a sunbeam. All our-\nPeer 1: I think that's a stuck pixel. We're the speck on the left. \nLecturer: ... OK, *this* pale blue dot is everything you-\nPeer 2: -No, you were right before. *That* one is Earth.\nLecturer: LOOK, IT DOESN'T MATTER! \nPeer 3: I *knew* it! \nPeer 4: I think this is just a lens cap picture. \n\n{{Title text: Our planet is a lonely speck in the great enveloping cosmic dark. In our obscurity, in all this vastness, there is no hint that help will come from elsewhere to save us from ourselves. There is no road out of this oblivion; we must embrace it. We must join with the darkness. Ba'al the Annihilator offers us no happiness, no answers, naught but the cold embrace of the void. To imagine any other end is delusion. We must give in to the will of Ba'al, for he will one day consume us and our world alike. I therefore call on Congress to fully fund space exploration, and to join with Ba'al, the Eater of Souls. Thank you.}}","alt":"Our planet is a lonely speck in the great enveloping cosmic dark. In our obscurity, in all this vastness, there is no hint that help will come from elsewhere to save us from ourselves. There is no road out of this oblivion; we must embrace it. We must join with the darkness. Ba'al the Annihilator offers us no happiness, no answers, naught but the cold embrace of the void. To imagine any other end is delusion. We must give in to the will of Ba'al, for he will one day consume us and our world alike. I therefore call on Congress to fully fund space exploration, and to join with Ba'al, the Eater of Souls. Thank you.","img":"https://imgs.xkcd.com/comics/pale_blue_dot.png","title":"Pale Blue Dot","day":"2"},null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"9","num":1260,"link":"","year":"2013","news":"","safe_title":"LD50","transcript":"[[A figure in a white coat lies on the floor, crushed beneath a giant pile of binders & paper. Two other figures in white coats stand next to him, looking on. One is holding a clipboard.]]\nThe LD50 of toxicity data is 2 kilograms per kilogram.\n\n{{Title text: The dose is much lower when administered orally. We're still trying to get the paper into the needles for subcutaneous injection.}}","alt":"The dose is much lower when administered orally. We're still trying to get the paper into the needles for subcutaneous injection.","img":"https://imgs.xkcd.com/comics/ld50.png","title":"LD50","day":"4"},{"month":"9","num":1261,"link":"","year":"2013","news":"","safe_title":"Shake That","transcript":"[[A woman stands in a disco, surrounded by dancing figures. She looks confused.]]\nPA system: Shake what your mama gave you\nWoman: ???\n\n[[The woman walks out of the club door.]]\n\n[[We see a mug on a table, labelled \"World's Greatest Daughter\".]]\n\n[[The woman shakes the mug.]]\n\n{{Title text: How do I work it? IT'S ALREADY WORKING!}}","alt":"How do I work it? IT'S ALREADY WORKING!","img":"https://imgs.xkcd.com/comics/shake_that.png","title":"Shake That","day":"6"},null,null,null,null,null,null,null,null,null,null,{"month":"10","num":1272,"link":"","year":"2013","news":"","safe_title":"Shadowfacts","transcript":"[[Gandalf sits on a horse, addressing three hobbits.]]\nGandalf: This is Shadowfacts, lord of all horses, and he-\nShadowfacts: The outer part of a shadow is called the penumbra!\nGandalf: Shut up.\n\n{{Title text: 'Look to my coming on the fifth day. At dawn, look to the east.' 'And look to the west to see our shadows!'}}","alt":"'Look to my coming on the fifth day. At dawn, look to the east.' 'And look to the west to see our shadows!'","img":"https://imgs.xkcd.com/comics/shadowfacts.png","title":"Shadowfacts","day":"2"},null,null,null,null,{"month":"10","num":1277,"link":"","year":"2013","news":"","safe_title":"Ayn Random","transcript":"[[A figure in a hat stands behind another figure, who is seated at a desk using a laptop.]]\nSeated figure: This Ayn Random number generator you wrote *claims* to be fair, but the output is biased towards certain numbers. \nHatted figure: Well, maybe those numbers are just intrinsically better!\n\n{{Title text: In a cavern deep below the Earth, Ayn Rand, Paul Ryan, Rand Paul, Ann Druyan, Paul Rudd, Alan Alda, and Duran Duran meet togther in the Secret Council of \n(b[plurandy]+b ?){2}\ni.}}","alt":"In a cavern deep below the Earth, Ayn Rand, Paul Ryan, Rand Paul, Ann Druyan, Paul Rudd, Alan Alda, and Duran Duran meet together in the Secret Council of /(b[plurandy]+b ?){2}/i.","img":"https://imgs.xkcd.com/comics/ayn_random.png","title":"Ayn Random","day":"14"},{"month":"10","num":1278,"link":"","year":"2013","news":"","safe_title":"Giraffes","transcript":"My hobby: \n[[A silhouette of a giraffe with a dinosaur-like tail is seen, standing facing left.]]\nConvincing genetic engineers that giraffes would look better if they had sauropod tails\n\n{{Title text: If you fund my Kickstarter ...}}","alt":"If you fund my Kickstarter ...","img":"https://imgs.xkcd.com/comics/giraffes.png","title":"Giraffes","day":"16"},null,null,null,{"month":"10","num":1282,"link":"","year":"2013","news":"","safe_title":"Monty Hall","transcript":"[[A figure - Monty Hall - stands on stage, holding a microphone. There are three doors; two labelled \"A\" and \"C\", which are closed, and one that is being held open by Monty. There's a ramp to the right, down which a goat is being led by beret guy.]]\nBeret guy: ... and my yard has so much grass, and I'll teach you tricks, and...\nGoat: â¥\n\n{{Title text: A few minutes later, the goat from behind door C drives away in the car.}}","alt":"A few minutes later, the goat from behind door C drives away in the car.","img":"https://imgs.xkcd.com/comics/monty_hall.png","title":"Monty Hall","day":"25"},null,null,{"month":"11","num":1285,"link":"","year":"2013","news":"","safe_title":"Third Way","transcript":"[[Two groups stand, with placards and weapons, angrily facing off against each other. The first group, with a cutlass, has a sign reading \"TWO spaces after a period\". The second group, with a spear, has a sign reading \"ONE space after a period.\" Off to one side stands a figure, alone, with a placard reading \"Line break after every sentence.\"]]\n\n{{Title text: 'The monospaced-typewriter-font story is a COMPLETE FABRICATION!  WAKE UP, SHEEPLE' 'It doesn't matter! Studies support single spaces!' 'Those results weren't statistically significant!' 'Fine, you win. I'm using double spaces right now!' 'Are not!  We can all hear your stupid whitespace.'}}","alt":"'The monospaced-typewriter-font story is a COMPLETE FABRICATION!  WAKE UP, SHEEPLE' 'It doesn't matter! Studies support single spaces!' 'Those results weren't statistically significant!' 'Fine, you win. I'm using double spaces right now!' 'Are not!  We can all hear your stupid whitespace.'","img":"https://imgs.xkcd.com/comics/third_way.png","title":"Third Way","day":"1"},null,null,{"month":"11","num":1288,"link":"","year":"2013","news":"","safe_title":"Substitutions","transcript":"Substitutions that make reading the news more fun: \nWitnesses â these dudes I know\nAllegedly â kinda probably\nNew study â Tumblr post\nRebuild â avenge\nSpace â Spaaace\nGoogle Glass â Virtual Boy\nSmartphone â Pokédex\nElectric â atomic\nSenator â elf-lord\nCar â cat\nElection â eating contest\nCongressional leaders â river spirits\nHomeland Security â Homestar Runner\nCould not be reached for comment â is guilty and everyone knows it\n\n{{Title text: INSIDE ELON MUSK'S NEW ATOMIC CAT}}","alt":"INSIDE ELON MUSK'S NEW ATOMIC CAT","img":"https://imgs.xkcd.com/comics/substitutions.png","title":"Substitutions","day":"8"},null,null,null,null,null,null,null,{"month":"11","num":1296,"link":"","year":"2013","news":"","safe_title":"Git Commit","transcript":"[[A commit log is shown, each commit having a comment and a relative date.]]\n\nCreated main loop & timing control - 14 hours ago\nEnabled config file parsing - 9 hours ago\nMisc bugfixes - 5 hours ago\nCode additions\nedits - 4 hours ago\nMore code - 4 hours ago\n((in a branch))\nHere have code - 4 hours ago\nAaaaaaaa - 3 hours ago\n((branch merged))\nAdkfjslkdfjsdklfj - 3 hours ago\nMy hands are typing words - 2 hours ago\nHaaaaaaaaands - 2 hours ago\n\n{{Title text: Merge branch 'asdfasjkfdlas\nalkdjf' into sdkjfls-final}}","alt":"Merge branch 'asdfasjkfdlas/alkdjf' into sdkjfls-final","img":"https://imgs.xkcd.com/comics/git_commit.png","title":"Git Commit","day":"27"},{"month":"11","num":1297,"link":"","year":"2013","news":"","safe_title":"Oort Cloud","transcript":"[[3 asteroids are talking.]]\nAsteroid 1: Have you noticed that bright dot in the distance? \nAsteroid 2: Yeah. What's the deal with it? \n\n[[Asteroid 1 scoots off-panel.]]\nAsteroid 1: Dunno. I'm gonna go check it out. \n\n[[Asteroids 2 and 3 sit and wait.]]\n\n[[Asteroid 1 has returned, as pieces of rubble and dust.]]\nAsteroid 1: Wow. Do not go over there.\n\n{{Title text: ... I wanna try.  Hang on, be right back.}}","alt":"... I wanna try.  Hang on, be right back.","img":"https://imgs.xkcd.com/comics/oort_cloud.png","title":"Oort Cloud","day":"29"},{"month":"12","num":1298,"link":"https://xkcd.com/1298/large/","year":"2013","news":"","safe_title":"Exoplanet Neighborhood","transcript":"[[A multitude of circles in various colors and sizes. The following label is centered horizontally, a quarter of the way down the image.]]\n\nOur Neighborhood\n\nA portrait of all habitable-zone planets within 60 light-years of Earth (constructed from statistical data on typical planet sizes and orbits).\n\n[[A key shows that reddish circles indicate planets which are orbiting sun-like stars, while greyish circles indicate planets around other stars. The darkest reds and greys indicate Earth-sized planets, while other more faded versions indicate sizes farther away from Earth's.]]\n\n{{Title text: It's a beautiful day in the neighborhood!}}","alt":"It's a beautiful day in the neighborhood!","img":"https://imgs.xkcd.com/comics/exoplanet_neighborhood.png","title":"Exoplanet Neighborhood","day":"2"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"1","num":1314,"link":"","year":"2014","news":"","safe_title":"Photos","transcript":"[[A man in a hat stands next to another figure on a roof. There's a sunset; in the distance, there are three people taking photos of the skyline as the sun sets.]]\nHat guy: Ugh, I hate how people take pictures instead of just enjoying the view. \nFigure: Why? \n\n[[Hat guy turns to the figure.]]\nHat guy: Documenting your live distracts you from living it. You're not really-\nFigure: Oh, come on. \n\n[[We zoom on their faces.]]\nFigure: Trying to take a picture of a thing makes me pay more attention to it. Some of my best adventures are built around trying to photograph something.\n\n[[We just see the figure's face.]]\nFigure: If \"other people having experiences incorrectly\" is annoying to you, think how unbearable it must be to have a condescending stranger tell you they hate the way you're experiencing your life at just the moment you've found something you want to remember. Why the fuck do you care how someone else enjoys a sunset? \n\n[[We zoom back out.]]\nHat guy: Well, they... Because I just, uh... ...\n\n[[The figure takes out a camera.]]\nFigure's camera: <<Click>>\n\n{{Title text: I hate when people take photos of their meal instead of eating it, because there's nothing I love more than the sound of other people chewing.}}","alt":"I hate when people take photos of their meal instead of eating it, because there's nothing I love more than the sound of other people chewing.","img":"https://imgs.xkcd.com/comics/photos.png","title":"Photos","day":"8"},null,null,null,null,null,{"month":"1","num":1320,"link":"","year":"2014","news":"","safe_title":"Walmart","transcript":"When a network tries to be everyone's one-stop hub, the Walmart of social interaction...\n\n[[Two figures stand in a department store. One is holding some items in their right arm and waving at the other, who is pushing a shopping cart.]]\nFigure 1: Oh, uh, hi! Funny running into you here.\nFigure 2: Oh, hey! Yeah! How've you been?\n\n...it inevitably becomes the Walmart of social interaction.\n\n{{Title text: What I really want is to hang out where I hung out with my friends in college, but have all my older relatives there too.}}","alt":"What I really want is to hang out where I hung out with my friends in college, but have all my older relatives there too.","img":"https://imgs.xkcd.com/comics/walmart.png","title":"Walmart","day":"22"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"3","num":1343,"link":"","year":"2014","news":"","safe_title":"Manuals","transcript":"[[A horizontal line has four points labeled on it, with the second point from the left marked with a dashed vertical line dividing the horizontal line into two parts. An arrow labeled \"Solve problems\" points left from the vertical line. An arrow labeled \"Create problems\" points right from the vertical line. The points are labeled, from left to right, \"Tools that don't need a manual\", \"Tools that need a manual\", \"Tools that need a manual but don't have one\", and \"Tools whose manual starts with 'how to read this manual'\".]]\n\n{{Title text: The most ridiculous offender of all is the sudoers man page, which for 15 years has started with a 'quick guide' to EBNF, a system for defining the grammar of a language. 'Don't despair', it says, 'the definitions below are annotated.'}}","alt":"The most ridiculous offender of all is the sudoers man page, which for 15 years has started with a 'quick guide' to EBNF, a system for defining the grammar of a language. 'Don't despair', it says, 'the definitions below are annotated.'","img":"https://imgs.xkcd.com/comics/manuals.png","title":"Manuals","day":"17"},null,null,{"month":"3","num":1346,"link":"","year":"2014","news":"","safe_title":"Career","transcript":"[[A figure stands facing a desk, behind which another figure is sitting in a desk chair.]]\nStanding Figure: It would start with five minutes of peeling lint from dryer traps, followed by an hour of pressing a lightsaber handle against things and switching it on. Then I'd retire to a life of luxury.\n\nWhen people ask me to describe my dream job, I'm never sure how realistic to be.\n\n{{Title text: They'd convince me to come out of retirement for one last job: biting into a giant lump of slightly soft wax a couple of times.}}","alt":"They'd convince me to come out of retirement for one last job: biting into a giant lump of slightly soft wax a couple of times.","img":"https://imgs.xkcd.com/comics/career.png","title":"Career","day":"24"},null,null,null,null,null,null,null,null,{"month":"4","num":1355,"link":"","year":"2014","news":"","safe_title":"Airplane Message","transcript":"[[A little propeller plane toting a banner from behind that reads, 'Adriamycin, one of our most poten chemotherapy drugs, come from the dirt from an Italian castle.']]\nMY HOBBY: Breaking into airplane hangars and replacing the ads on their giant banners with cool facts.\n\n{{Title text: PHARAOH IRY-HOR, FROM THE 3100s BC, IS THE FIRST HUMAN WHOSE NAME WE KNOW.}}","alt":"PHARAOH IRY-HOR, FROM THE 3100s BC, IS THE FIRST HUMAN WHOSE NAME WE KNOW.","img":"https://imgs.xkcd.com/comics/airplane_message.png","title":"Airplane Message","day":"14"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"6","num":1376,"link":"","year":"2014","news":"","safe_title":"Jump","transcript":"[[A character is posed in a series of positions across a landscape.  The implication is that the character is progressing forward in time towards the right side of the panel.]]\nI love these dreams\n[[The character leaps into the air, the word 'jump' above them.]]\nEach jump is a little longer\n[[They leap down a small incline, traveling a fair distance.]]\nEach push off the ground a little softer\n[[The character leaps a third time.]]\nUntil I\n[[The character does not touch the ground again.]]\n\nG L I D E\n\n\n[[The character continues to hover over the landscape, above scrub grass, a wind barrier, sand dunes, and a beach.  Birds can be seen in the distance as the character drifts out to sea.]]\n\n[[The character passes a small fish jumping.]]\nCharacter: ...I \nhope\n this is a dream.\n\n{{Title text: I hope I'm at least following the curve of the Earth around to land ...}}","alt":"Or that I'm at least following the curve of the Earth around to land ...","img":"https://imgs.xkcd.com/comics/jump.png","title":"Jump","day":"2"},null,null,null,{"month":"6","num":1380,"link":"","year":"2014","news":"","safe_title":"Manual for Civilization","transcript":"Brian Eno: Hi. I'm music's Brian Eno, co-founder of the Long Now Foundation.\n\n[[Brian Eno is on a stage.]]\nBrian Eno: As part of our mission to promote long-term thinking, we've asked experts to help us assemble a collection of books from which civilization can be rebuilt if it ever collapses.\n\n[[Brian Eno holds up a list.]]\nBrian Eno: Today, we're sharing the results--the first ever \nManual for Civilization\n.\n\n[[Brian Eno begins to read, until he is interrupted by a voice from off-panel.]]\nBrian Eno: *Ahem* \nAnimorphs #1: The Invasion\n\nBrian Eno: \nAnimorphs #2: The Visitor\n\nBrian Eno: \nAnimorphs #3: The Encounter\n\nVoice: ... Are they \nall\n Animorphs books?\nBrian Eno: No! There's also \nMegamorphs\n and \nThe Andalite Chronicles.\n\n\n{{Title text: We will have an entire wing of the library devoted to copies of book #26, because ohmygod it's the one where Jake and Cassie finally KISS!!!}}","alt":"We will have an entire wing of the library devoted to copies of book #26, because ohmygod it's the one where Jake and Cassie finally KISS!!!","img":"https://imgs.xkcd.com/comics/manual_for_civilization.png","title":"Manual for Civilization","day":"11"},null,null,null,null,null,null,null,null,null,{"month":"7","num":1390,"link":"","year":"2014","news":"","safe_title":"Research Ethics","transcript":"[[A person with dark hair speaks to two people, one with a light-colored ponytail and the other without any hair.]]\nDark hair: Facebook shoudn't choose what stuff they show us to conduct unethical psychological research. - They should \nonly\n make those decisions based on, uh... - however they were doing it before. - Which was probably ethical, right?\n\n{{Title text: I mean, it's not like we could just demand to see the code that's governing our lives. What right do we have to poke around in Facebook's private affairs like that?}}","alt":"I mean, it's not like we could just demand to see the code that's governing our lives. What right do we have to poke around in Facebook's private affairs like that?","img":"https://imgs.xkcd.com/comics/research_ethics.png","title":"Research Ethics","day":"4"},null,null,null,null,null,null,null,null,{"month":"7","num":1399,"link":"","year":"2014","news":"","safe_title":"Chaos","transcript":"[[A stick figure is looking at a whiteboard covered in diagrams.]]\nSF: For two decades, I've studied phase space, nonlinear equations, and strange attractors.\n\n[[The figure stand in silence, looking at the board.]]\n\n[[They continue to look at the board.]]\nSF: And there is \nnothing\n in here about dinosaurs escaping.\n\n{{Title text: Although the oral exam for the doctorate was just 'can you do that weird laugh?'}}","alt":"Although the oral exam for the doctorate was just 'can you do that weird laugh?'","img":"https://imgs.xkcd.com/comics/chaos.png","title":"Chaos","day":"25"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"9","num":1418,"link":"","year":"2014","news":"","safe_title":"Horse","transcript":"New Favorite Browser Text Replacement:\nFORCE -> HORSE\n[[Person sitting at desk, looking at computer screen. A series of headlines on the computer read:]]\nUkranian Towns Threatened by Pro-Russian Horses\nGovernor Appoints Task Horse\nIraqi Air Horse Growing\nQuarks, which are bound together by the strong nuclear horse...\n{{Title text: Officer suspended from horse.}}","alt":"Officer suspended from horse.","img":"https://imgs.xkcd.com/comics/horse.png","title":"Horse","day":"8"},null,null,null,null,null,{"month":"9","num":1424,"link":"","year":"2014","news":"","safe_title":"En Garde","transcript":"[[Two fencers stand facing each other. The left one has his sword up; the right one keeps his lowered.]]\nLeft fencer: En garde!\nRight fencer: OK. \n\nRight fencer: No matter how long we know each other, when you ask \"What are you thinking,\" I will always pause before answering. \n\nLeft fencer: Maybe a little less guarded?\nRight fencer: No way. I've been hurt before. \n\n{{Title text: 'Touch!' 'Nope, I sighed and stared at you with resignation, so I regained emotional right-of-way.'}}","alt":"'Touch!' 'Nope, I sighed and stared at you with resignation, so I regained emotional right-of-way.'","img":"https://imgs.xkcd.com/comics/en_garde.png","title":"En Garde","day":"22"},null,null,null,null,null,null,null,null,null,null,null,null,{"month":"10","num":1437,"link":"","year":"2014","news":"","safe_title":"Higgs Boson","transcript":"{{Title text: 'Can't you just use the LHC you already built to find it again?' 'We MAY have disassembled it to build a death ray.' 'Just one, though.' 'Nothing you should worry about.' 'The death isn't even very serious.'}}\n\n[[Woman standing at a podium with man behind her]]\nPerson off scene: Tell us about your proposal.\nWoman: We're requesting $3 billion in funding to find the Higgs Boson.\nPerson off scene: ... wait.  Didn't you already find it a year or two ago?\nMan: Yes, well, um.\n\n[[Zoom into woman]]\nWoman: ... ok, this is embarrassing.\nMan off scene: See, the thing is---\n\n[[Zoom out to original scene]]\nPerson off scene: Don't tell us you lost it already.\nWoman: Look.  In our defense it's really small.","alt":"'Can't you just use the LHC you already built to find it again?' 'We MAY have disassembled it to build a death ray.' 'Just one, though.' 'Nothing you should worry about.' 'The death isn't even very serious.'","img":"https://imgs.xkcd.com/comics/higgs_boson.png","title":"Higgs Boson","day":"22"},null,null,null,null,null,{"month":"11","num":1443,"link":"","year":"2014","news":"","safe_title":"Language Nerd","transcript":"{{Title text: Not to go all sentence fragment on you.}}\n\n[[Man and woman standing]]\nWoman:  I don't mean to go all language nerd on you, but I just legit adverbed \"legit,\" verbed \"adverb,\" and adjectived \"language nerd.\"","alt":"Not to go all sentence fragment on you.","img":"https://imgs.xkcd.com/comics/language_nerd.png","title":"Language Nerd","day":"5"},null,{"month":"11","num":1445,"link":"","year":"2014","news":"","safe_title":"Efficiency","transcript":"{{Title text: I need an extension for my research project because I spent all month trying to figure out whether learning Dvorak would help me type it faster.}}\nTime Cost\n[[Bar graph]]\nStrategy A [[Small bar]]\nStrategy B [[Slightly larger bar than A]]\nAnalyzing whether strategy A or B is more efficient [[Bar several times the length of A or B]]\nThe reason I am so inefficient","alt":"I need an extension for my research project because I spent all month trying to figure out whether learning Dvorak would help me type it faster.","img":"https://imgs.xkcd.com/comics/efficiency.png","title":"Efficiency","day":"10"},null,null,null,null,null,null,{"month":"11","num":1452,"link":"","year":"2014","news":"","safe_title":"Jurassic World","transcript":"[[White Hat guy and another person are walking along.]]\nWH: In \nJurassic World\n, we've used genetic engineering to invent a \nbetter\n Dinosaur.\nOP: Tyrannosaurus is the most charismatic animal that ever lived, and you think you'll \nupstage\n it?\n\n[[They continue to walk along.]]\nWH: \nTyrannosaurus\n was cool, but it's two decades old!\nOP: I think it's a \nlittle\n older than that.\n\n[[As they walk along, White Hat points up at something in front of them.]]\nWH: We took \nTyrannosaurus\n and we \nimproved\n it. Made it scarier, deadlier, smarter. == Look- there it is!\n\n[[The pair are dwarfed in comparison to the T-Rex from Dinosaur Comics.]]\n\n{{Title text: Hey guys! What's eating you? Ha ha ha it's me! Oh, what fun we have.}}","alt":"Hey guys! What's eating you? Ha ha ha it's me! Oh, what fun we have.","img":"https://imgs.xkcd.com/comics/jurassic_world.png","title":"Jurassic World","day":"26"},null,{"month":"12","num":1454,"link":"","year":"2014","news":"","safe_title":"Done","transcript":"[[A woman with dark curly hair is sitting at a desk, typing on a laptop.]]\nCurly: (typing) I had started to think I was asking too much, that I needed to settle. And then I found you half a world away.\n\n[[Close-up on Curly.]]\nCurly: (typing) I've been saving money. Six months from now, I'll be able to fly you here and support us for a while.\n\n[[Same as first panel.]]\nCurly: (typing) It's a long wait, but we'll talk every day until then. May this won't work out, but I want to try. What do you think?\n\n[[She stops typing.]]\nComputer: \nERROR: Your message could not be sent.\n [refresh] \nERROR: No connection.\n\n\n[[A light-haired woman with a ponytail walks in.]]\nCurly: Why can't I connect?\nPonytail: Someone saw a ridiculous video and said, \"That's it, shut down the internet, we're done.\" So they did.\n\n[[Looks sadly down at the laptop, hands in her lap.]]\nCurly: ...but... I wasn't done.\n\n{{Title text: I'm sorry, but the author of this Facebook comment clearly believes you were.}}","alt":"I'm sorry, but the author of this Facebook comment clearly believes you were.","img":"https://imgs.xkcd.com/comics/done.png","title":"Done","day":"1"},null,{"month":"12","num":1456,"link":"","year":"2014","news":"","safe_title":"On the Moon","transcript":"[[Two people are walking along together.]]\nPerson 1: If we could land a man on the moon, why can't we -\nPerson 2: - land a man on the moon?\nPerson 1: ...ok, fair. But we're working on it, ok? \n\n{{Title text: \"I believe that this nation should commit itself to achieving the goal, before this decade is out, of landing a man on Venus and returning him safely to--\" [an aide frantically whispers in the president's ear for a moment] \"... of landing a man on Venus.\"}}","alt":"\"I believe that this nation should commit itself to achieving the goal, before this decade is out, of landing a man on Venus and returning him safely to--\" [an aide frantically whispers in the president's ear for a moment] \"... of landing a man on Venus.\"","img":"https://imgs.xkcd.com/comics/on_the_moon.png","title":"On the Moon","day":"5"},null,null,null,null,null,null,null,null,{"month":"12","num":1465,"link":"","year":"2014","news":"","safe_title":"xkcd Phone 2","transcript":"[[There's a phone.]]\n((It's surrounded by labels pointing at features of the phone.  These are presented counterclockwise from the top.))\n((The following arrow points at a lozenge along the top edge of the screen.))\n<-- Always-on speaker\n<-- MaxHD: Over 350 pixels per screen\n<-- Volume and density control\n<-- FitBit(r) Fitness Evaluator\n<-- Dog noticer\n<-- 3D Materials\n<-- OS by StackOverflow(r)\n((The following arrow points at a button on the bottom edge of the screen.))\n<-- Scroll lock\n((The following arrow points at an opening on the bottom edge of the phone, where a charger would typically go.))\n<-- Coin Slot\n((The following arrow points at a small drawer where one would expect a SIM card to fit.))\n<-- Bug drawer\n<-- Cries if lost\n<-- Cheek toucher\n<-- Googleable\n<-- Waterproof (Interior only)\n<-- Ribbed\n<-- Auto-rotating case\n((The following arrow points at dots above the top edge of the screen.))\n<-- Blood Pressure Reliever\nIntroducing\nThe xkcd Phone 2\nA Phone For Your Other Hand(r)\n\n{{Title text: Washable, though only once.}}","alt":"Washable, though only once.","img":"https://imgs.xkcd.com/comics/xkcd_phone_2.png","title":"xkcd Phone 2","day":"26"},null,null,null,{"month":"1","num":1469,"link":"","year":"2015","news":"","safe_title":"UV","transcript":"[[A character with hair, carrying a flashlight, approaches a sitting bald character, engrossed in a laptop computer.]]\nHair'd character: Our bathroom looks pretty clean, right?\nBald character: I think so. Why?\nHair'd character: I got a UV flashlight. Come look.\n\n[[Together they exit panel left, hair'd character proudly brandishing the UV flashlight.\n\n[[conversation continues off-panel]]\nOff-panel voice: Looks fine.\n<<Click>>\n<<Click>>\nOff-panel voice: ..oh my god.\n\n[[Characters return to visible panel. Bald character looks back in fear.]]\nBald character: The toilet looked like the guy's chest after the alien burst out.\nHair'd character: What do we DO?\n\n[[Bald character supplicates calmness with arms]]\nBald character: We clean. Clean and clean and never stop.\nHair'd character: It won't be enough. We should just burn the place down for the insurance money.\n\n[[The hair'd character has begun dousing the floor with a can of gasoline]]\nBald character: Isn't that wrong?\nHair'd character: My morality has evaporated under the harsh UV light.\n\n[[A multistory building burns brightly, as the characters watch silently.]]\n\n[[Bald character is using a smartphone.]]\nBald character: Ok, I'm googling insurance companies. Which one do you think pays the most?\nHair'd character: Let's just try calling around.\n\n{{Title text: Hey, why stop at our house? We could burn down ALL these houses for the insurance money.}}","alt":"Hey, why stop at our house? We could burn down ALL these houses for the insurance money.","img":"https://imgs.xkcd.com/comics/uv.png","title":"UV","day":"5"},null,null,null,null,null,null,null,{"month":"1","num":1477,"link":"","year":"2015","news":"","safe_title":"Star Wars","transcript":"[[Two characters walk & talk together.]]\nBald character: We're almost at the back to the future date.\nHair'd character: We're even closer to the star wars tipping point.\nBald character: The what?\n\n[[A timeline appears, labeled at 1980, 1990, 2000, 2010.]]\n       Return of the Jedi\n       |        The phantom menace\n       |        |          May 13th\n       |        |          |\n       |<------>|<-------->|\n-----|-----|-----|-----|------\n     1980  1990  2000  2010\nHair'd character: On may 13th, the phantom menace will have come out closer to return of the jedi than to the present\nBald character: Wow.\n\nBald character: It's weird how I'm constantly surprised by the passage of time when it's literally the most predictable thing in the universe.\nHair'd character (gazing into distance): You know, \"a long time ago\" should have \"plus four more decades\" added in rereleases.\n\n{{Title text: A long, long time (plus 40 years) ago, in a galaxy far, far away (plus a corrective factor involving the Hubble constant) ...}}","alt":"A long, long time (plus 40 years) ago, in a galaxy far, far away (plus a corrective factor involving the Hubble constant) ...","img":"https://imgs.xkcd.com/comics/star_wars.png","title":"Star Wars","day":"23"},null,null,null,null,null,null,{"month":"2","num":1484,"link":"","year":"2015","news":"","safe_title":"Apollo Speeches","transcript":"[[A stack of speeches, with text above them describing the situation]]\n\nIn 1969, Nixon staffer William Safire wrote a speech for the president to deliver if the Apollo 11 return launch failed, stranding the doomed astronauts on the moon.\n\nUncovered in 1999, it is often call the greatest speech never given.\n\nToday, the full set of Safire's contingency speeches has been found.\n\n((First speech))\nIn Event Astronauts Stranded On Moon\nFate has ordained that the men who went to the moon to explore in peace will stay on the moon to rest in peace.\n\nIn ancient days, men looked at stars and saw their heroes in the constellations. In modern times, we do the same, but our heroes are epic men of flesh and blood.\n\nOthers will follow, and surely find their way home. Man's search will not be denied. But these men were the first, and they will remain the foremost in our hearts. For every human being who looks up at the moon in the nights to come will know that there is some corner of another world that is forever-- <<notes are truncated>>\n\n((Second speech))\nIn Event Spacecraft Goes Missing\nNeil Armstrong, Edwin Aldrin, and Michael Collins went to the moon as ambassadors of peace for all mankind, and all mankind prays that they may yet return safely home.\n\nWe are separated from the moon by a vast gulf of space, against which their tiny vessel appeared as but a drifting speck. For a few brief seconds, we took our eye off them, and despite days of desperate searching, never again was their vessel sighted from Earth.\n\nWhile these men are lost they are not forgotten and their sacrifice will not-- <<notes are truncated>>\n\n((Third speech))\nIn Event Astronauts Abscond With Spacecraft\nWe do not know what led Armstrong, Aldrin and Collins to betray the trust we placed in them, abandon their mission, and steer their vessel toward Mars. Nor do we know what compelled them to transmit such hurtful messages back to earth, heaping contempt on their onetime home.\n\nBut whatever the cause of their dereliction, I call upon the United States to commit itself, before this year is out, to launching a mission to chase down Apollo 11 and return its crew to face Justice. We must not rest until-- <<notes are truncated>>\n\n((Fourth speech))\nIn Event Spacecraft Returns With Extra Astronauts\nWhile this is much we do not understand, tonight all of Earth is united in celebrating the safe return of our brave explorers.\n\nWe of course have many questions, and in the day and weeks to come we will demand answers. How many souls were truly aboard Apollo 11 when it launched? Who are the six men now in quarantine aboard the USS Hornet? What happened-- <<notes are truncated>>\n\n((Fifth speech))\nIn Event Spacecraft Hits U.S.S. Hornet, Crushing Nixon\n\nPresident Agnew: Tonight, we have experienced a great national triumph and a great national loss. We take joy in the safe return from the moon of Neil Armstrong, Edwin Aldrin, and Michael Collins, but that joy is tempered with sorrow as we mourn our president's tragic death beneath their wayward capsule.\n\nRichard Nixon wholeheartedly supported our courageous astronauts as they carried the hopes and prayers of Earth to the heavens, and in the moment of their homecoming, he himself has departed on that ultimate voyage. As we grieve, we must rededicate ourselves to the cause for which our president-- <<notes are truncated>>\n\n((Sixth speech))\nIn Event Spacecraft Accidentally Sold For Scrap And Crushed With Astronauts Inside\nMy fellow Americans, I am as shocked and appalled as you at this stunning and-- <<notes are truncated>>\n\n{{Title text: While our commitment to recycling initiatives has been unwavering, this is not a cost any of us should be expected to pay.}}","alt":"While our commitment to recycling initiatives has been unwavering, this is not a cost any of us should be expected to pay.","img":"https://imgs.xkcd.com/comics/apollo_speeches.png","title":"Apollo Speeches","day":"9"},null,null,null,null,{"month":"2","num":1489,"link":"","year":"2015","news":"","safe_title":"Fundamental Forces","transcript":"[[A stick figure lectures]]\n\nFigure: There are four fundamental forces between particles: (1) Gravity, which obeys this inverse square law: Fgravity = G(M1M2)\nd^2\nOff-panel: Ok...\n\nFigure: (2) Electromagnetism, which obeys this inverse-square law: Fstatic = Ke (q1q2)\nd^2\nFigure: ANd also maxwell's equations\nOff-panel: Also what?\n\nFigure: (3) The Strong Nuclear Force, which obeys uh... well, umm... It holds protons and neutrons together.\nOff-panel: I see.\nFigure: It's strong.\n\nFigure: And (4) The Weak Force. It [mumble mumble] radioactive decay [mumble mumble]\nOff-panel: That's not a sentence. You just said \"Radio-\nFigure: -And those are the four fundamental forces!\n\n{{Title text: \"Of these four forces, there's one we don't really understand.\" \"Is it the weak force or the strong--\" \"It's gravity.\"}}","alt":"\"Of these four forces, there's one we don't really understand.\" \"Is it the weak force or the strong--\" \"It's gravity.\"","img":"https://imgs.xkcd.com/comics/fundamental_forces.png","title":"Fundamental Forces","day":"20"},null,null,null,null,null,{"month":"3","num":1495,"link":"","year":"2015","news":"","safe_title":"Hard Reboot","transcript":"Figuring out why my home server keeps running out of swap space and crashing: one to ten hours\n\nPlugging it into a light timer so it reboots every 24 hours: five minutes.\n\n{{Title text: Googling inevitably reveals that my problem is caused by a known bug triggered by doing [the exact combination of things I want to do]. I can fix it, or wait a few years until I don't want that combination of things anymore, using the kitchen timer until then.}}","alt":"Googling inevitably reveals that my problem is caused by a known bug triggered by doing [the exact combination of things I want to do]. I can fix it, or wait a few years until I don't want that combination of things anymore, using the kitchen timer until then.","img":"https://imgs.xkcd.com/comics/hard_reboot.png","title":"Hard Reboot","day":"6"},{"month":"3","num":1496,"link":"","year":"2015","news":"","safe_title":"Art Project","transcript":"((Four figures hold forth with expository monologue.))\n\nFigure holding a camera: I'm doing an art project where I take a picture of myself every hundred years.\n\nFigure holding a phone: I'm doing an art project where I take a picture of myself every one twenty-fourth of a second.\n\nFigure pointing to their face: I'm doing an art project where you can come to my house and watch my actual face age in real time.\n\nFigure holding a burrito to their face: I'm doing an art project where you all do those things while I eat a burrito.\n\n{{Title text: It's my most ambitious project yet, judging by the amount of guacamole.}}","alt":"It's my most ambitious project yet, judging by the amount of guacamole.","img":"https://imgs.xkcd.com/comics/art_project.png","title":"Art Project","day":"9"},null,null,null,null,null,null,null,null,null,{"month":"4","num":1506,"link":"//xkcd.com/1506/","year":"2015","news":"","safe_title":"xkcloud","transcript":"{{Title text: }}\n[[Randall monologues behind his official XKCD desk.]]\nRandall: We've made a huge mistake.\n\nRandall: I figured starting a cloud services company would be EASY. After all, I've got TONS of computers!\n[[Randall gestures to a mound of various and sundry mini computers, from a lowly Commodore to a large Alienware.]]\n\n[[Close zoom on Randall's featureless oval face.]]\nRandall: Facebook, twitter, tumblr - they all struggle to protect privacy and user data.\nRandall: And we offered a solution.\nRandall: I forget what it was, though.\n\n[[Wide zoom to Randall waving his arms in a conciliatory manner.]]\nRandall: Anyway, long story short, we screwed up IMMEDIATELY and lost TONS of their data.\nRandall: Also a bunch of stuff is literally on fire?\n\n[[Randall is back behind the desk.]]\nRandall: We can fix this. But we need your help.\n\nLarge red banner: Help us recover user data before facebook & co notice we lost it.","alt":"","img":"https://imgs.xkcd.com/comics/xkcloud.png","title":"xkcloud","extra_parts":{"pre":"","headerextra":"","post":"\n<script type=\"text/javascript\" src=\"/1506/main.js\"></script>\n","imgAttr":""},"day":"1"},null,null,null,null,null,null,null,null,null,{"month":"4","num":1516,"link":"","year":"2015","news":"","safe_title":"Win by Induction","transcript":"[[This will not make sense if you do not know what Pokemon is.]]\n[[A seemingly infite row of Pikachu stands, each next to an open pokéball. The pokemon on the end of the row, nearest to the trainers, has a closed pokéball.]]\nPikachu: Pikachu, I choose YOU!\n\n[[There are two trainers. One has an open pokéball. The other is staring at their watch.]]\n\n{{Title text: This would be bad enough, but every 30th or 40th pokéball has TWO of them inside.}}","alt":"This would be bad enough, but every 30th or 40th pokéball has TWO of them inside.","img":"https://imgs.xkcd.com/comics/win_by_induction.png","title":"Win by Induction","day":"24"},null,{"month":"4","num":1518,"link":"","year":"2015","news":"","safe_title":"Typical Morning Routine","transcript":"[[Darkness.]]\n<<BLEEP BLEEP>>\nPerson 1: Urgh.\nPerson 2: Your alarm is going off.\nPerson 1: Huh?\nPerson 2: Make it stop.\nPerson 1: Urrgh.\n\n[[Still darkness.]]\n<<BLEEPEEP BLEEP BLEEP B>>\nPerson 2: Hit snooze.\nPerson 1: I'm \ntrying.\n I closed the alarm app and I can't... I'll just pop out the battery. \nwhoops!\n\n<<CLANG>>\n\n[[The light is on. Person one looks over the edge of the bed to see the vent on the floor is open.]]\n<<EEP BLEEP BLEEP BLE>>\nPerson 2: Make it stop!\nPerson 1: It... fell down the vent.\n\n[[Person 1 types on their laptop.]]\n<<EP BLEEP BLEEP BLEEP BLE>>\nPerson 2: Can you brick it remotely?\nPerson 1: Trying... I think I fumbled it into airplane mode?\nPerson 2: The battery could last for weeks.\nPerson 1: You know, maybe we should just move.\n\n{{Title text: Hang on, I've heard this problem. We need to pour water into the duct until the phone floats up and ... wait, phones sink in water. Mercury. We need a vat of mercury to pour down the vent. That will definitely make this situation better and not worse.}}","alt":"Hang on, I've heard this problem. We need to pour water into the duct until the phone floats up and ... wait, phones sink in water. Mercury. We need a vat of mercury to pour down the vent. That will definitely make this situation better and not worse.","img":"https://imgs.xkcd.com/comics/typical_morning_routine.png","title":"Typical Morning Routine","day":"29"},{"month":"5","num":1519,"link":"","year":"2015","news":"","safe_title":"Venus","transcript":"[[A teacher holding a pointer stands in front of a backdrop of a lush, coastal field filled with flower and greenhouses.]]\nTeacher: Venus was once temperate. It had seas and rivers, and Venusians cultivated vast fields of beautiful flowers.\n\n[[The backdrop is now a shot of an earth-like Venus seen from space, with greenhouses flying rapidly away from it.]]\nTeacher: Until their greenhouses fled the planet due to the runaway greenhouse effect.\n\n[[A little girl is seen sitting at a desk, listening to the teacher speak.]]\nTeacher: The Venusians pursued their greenhouses to Earth, settling in the Netherlands and kickstarting the Dutch floral industry. Any questions?\n\n[[A close-up on the teacher's profile, the student is out of panel.]]\nStudent: Because you're retiring in a month, do you just not care what you say anymore? \nTeacher: \nWHAT?!\n I \nRIDE THE SKIES\n atop a screaming bird of truth! Also, yes, I do not. \n\n{{Title text: The sudden introduction of Venusian flowers led to an explosive growth of unusual Earth pollinators, which became known as the \"butterfly effect.\"}}","alt":"The sudden introduction of Venusian flowers led to an explosive growth of unusual Earth pollinators, which became known as the \"butterfly effect.\"","img":"https://imgs.xkcd.com/comics/venus.png","title":"Venus","day":"1"},null,null,null,null,null,{"month":"5","num":1525,"link":"https://xkcd.com/1525/","year":"2015","news":"","safe_title":"Emojic 8 Ball","transcript":"EMOJIC 8 BALL\n[[A text box where you can enter a question, with a default question of 'How will I die?, and an 'ASK' button underneath. Below is a drawing of a 'magic 8 ball' toy, and in the center a white triangle comes up with 1-3 random emojis.]]\n\n{{(No alt-text.)}}\n","alt":"","img":"https://imgs.xkcd.com/comics/emojic_8_ball.png","title":"Emojic 8 Ball","extra_parts":{"headerextra":"\n<link rel=\"stylesheet\" type=\"text/css\" href=\"/1525/emojic8.css\" title=\"Default\"/>\n","inset":"                                                                                                   \n    <img src=\"/1525/bg.png\">\n    <form id=\"emoji-ball\" class=\"dark\">\n      <input type=\"text\" placeholder=\"How will I die?\" id=\"ball-question\"/>\n      <input type=\"submit\" id=\"ball-ask\" value=\"Ask\"/>\n      <div class=\"ball\">\n        <div class=\"ball-cover\"></div>\n        <div class=\"shading\"></div>\n        <div id=\"ball-answer\"><div class=\"text\"></div></div>\n      </div>\n    </form>\n    <div id=\"emoji-link\"></div>\n    <script type=\"text/javascript\" src=\"/1525/emojic8.js\"></script>\n"},"day":"15"},null,null,null,{"month":"5","num":1529,"link":"","year":"2015","news":"","safe_title":"Bracket","transcript":"[[What follows is a bunch of names, all in an ULTIMATE SINGLE ELIMINATION BRACKET, like one might see for SPORTS like BATTLEBOTS or MARCH MADNESS.]]\n\n[[on the left side]]\nLouis armstrong\nneil armstrong\nlance armstrong\nstretch armstrong\n\njeff gordon\njeff bridges\njeff daniels\njack daniels\n\norson welles\nh.g. wells\ngeorge orwell\nwells fargo\n\nkurt russell\nrussell brand\nrussell crowe\nrussell simmons\nrichard simmons\ngene simmons\ngene hackman\nhugh jackman\nalan rickman\nalan parsons\nalan partridge\n\njenny mccarthy\njoseph mccarthy\neugene mccarthy\neugene v.debs\ngene wilder\nolivia wilde\noscar wilde\noscar de la renta\noscar de la hoya\n\njack nicklaus\njack nicholson\nphil mickelson\nnicholas nickleby\n\nryan adams\nbryan adams\n\nchubby checker\nfats domino\n\ncolin firth\ncolin farrell\nwill ferrell\nthe farrelly brothers\n\njoseph gordon-levitt\njennifer love hewitt\n\ndanny glover\ndonald glover\ndonnie wahlberg\nmark wahlberg\nmark ruffalo\nmark shuttleworth\n\n[[on the right side]]\nphilip pullman\nbill pullman\nbill paxton\nbill murray\ndan aykroyd\n\nginger rogers\nmister\nfred astaire\nrogers\nmister spock\ndoctor spock\ndoctor octopus\ndoctor manhattan\ndoctor strangelove\ndoctor strnage\ndr. no\nthe doctor\ncory doctorow\n\njerry lee lewis\njerry lewis\njenny lewis\nxeni jardin\n\nchris evans\nchris hemsworth\nchris pine\nchris pratt\n\nshallots\nscallops\nscallions\n\nsioxsie sioux\nsuzanne vega\n\ntom arnold\narnold palmer\namanda palmer\n\nwes craven\nwes anderson\npaul thomas anderson\npoul anderson\n\nsir walter scott\nsir walter raleigh\nsir francis drake\nfrank drake\ndrake\n\nvan halen\nvan morrison\nvan wilder\nrobert van winkle\nrip van winkle\nrip torn\nnatalie imbruglia\n\nthe body shop\nbath and body works\nbed bath and beyond\nbeyond thunderdome\nbeyoncé\n\n{{Title text: I'm staring at the \"doctor\" section, and I can't help but feel like I've forgotten someone.}}","alt":"I'm staring at the \"doctor\" section, and I can't help but feel like I've forgotten someone.","img":"https://imgs.xkcd.com/comics/bracket.png","title":"Bracket","day":"25"},null,{"month":"5","num":1531,"link":"","year":"2015","news":"","safe_title":"The BDLPSWDKS Effect","transcript":"[[A person with a ponytail stands in front of a projector screen with an image of a speeding firetruck hurtling toward a person on it. They hold a pointer, and indicate towards the image.]]\nPonytail: The Bernoulli-Dopper-Leidenfrost-Peltzman-Sapir-Whorf-Dunning-Kruger-Stroop Effect states that if a speeding fire truck lifts off and hurtles toward you on a layer of superheated gas, you'll dive out of the way faster if the driver screams \"RED!\" in a \nnon\n-tonal language that \nhas\n a word for \"firefighter\" than if they scream \"GREEN!\" in a \ntonal\n language with \nno\n word for \"firefighter\" which you \nthink\n you're fluent in but \naren't.\n\n{{Title text: This well-known effect has of course been replicated in countless experiments.}}","alt":"This well-known effect has of course been replicated in countless experiments.","img":"https://imgs.xkcd.com/comics/the_bdlpswdks_effect.png","title":"The BDLPSWDKS Effect","day":"29"},null,{"month":"6","num":1533,"link":"","year":"2015","news":"","safe_title":"Antique Factory","transcript":"[[White Beret Guy is walking off, carrying a briefcase.]]\nWBG: Gotta go - I'm late for work.\nOff-screen: Oh, where are you working now?\nWBG: Antique factory!\n\n[[White Beret Guy arrives at his office, where he pulls out his chair from his desk.]]\n\n[[He sits at his table and waits.]]\n\n[[And waits.]]\n{{Title text: WARNING: This item was aged by the same inexorable passage of time that also processes nuts.}}","alt":"WARNING: This item was aged by the same inexorable passage of time that also processes nuts.","img":"https://imgs.xkcd.com/comics/antique_factory.png","title":"Antique Factory","day":"3"},{"month":"6","num":1534,"link":"","year":"2015","news":"","safe_title":"Beer","transcript":"[[Two people stand at an open refrigerator.]]\n1: What do you drink? Stouts? Lagers?\n2: Uh, anything's fine.\n\n[[Person 1 is drinking from a bottle while Person 2 holds his in his hand.]]\n2: ...do you ever think maybe we should just admit that all beer tastes kind of bad and everyone's just pretending?\n\n[[Person 2 drinks from his bottle and Person 1 holds his.]]\n1: Man, you are no fun at all.\n2: Ok, got it. Not a word.\n1: Dude, if you don't like it, don't drink it.\n2: No, no, gotta do my part! - Mmmmm!!!\n\n{{Title text: Mmmm, this is such a positive experience! I feel no social pressure to enjoy it at all!}}","alt":"Mmmm, this is such a positive experience! I feel no social pressure to enjoy it at all!","img":"https://imgs.xkcd.com/comics/beer.png","title":"Beer","day":"5"},null,null,null,{"month":"6","num":1538,"link":"","year":"2015","news":"","safe_title":"Lyrics","transcript":"[[A man sits in an easy-chair, while music with indecipherable lyrics plays from a radio behind him.]]\nSometimes I wonder what it would be like to be able to understand song lyrics without looking them up.\n\n{{Title text: To me, trying to understand song lyrics feels like when I see text in a dream but itð° hà¸­áµ£d tâ áµ£eâd aà¸d ð¾ canÙt fà¾cuà¼§à¼¦à¿à¼}}","alt":"To me, trying to understand song lyrics feels like when I see text in a dream but it𝔰 hอᵣd t₀ ᵣeₐd aกd 𝒾 canٖt fཱྀcu༧༦࿐༄","img":"https://imgs.xkcd.com/comics/lyrics.png","title":"Lyrics","day":"15"},null,{"month":"6","num":1540,"link":"","year":"2015","news":"","safe_title":"Hemingway","transcript":"Hemingway's Rough Drafts\n[[A list.]]\nFor Sale: This Gullible Baby's Shoes\nBaby Shoes For Sale By Owner\n((crossed out))Actually, there's no evidence Hemingway wrote\nFree Shoes, Provided You Overpower Baby\nFor Sale: Weird Baby's Toe Shoes\nFor Sale: Baby Shoes ((check mark))Prime Eligible\n((crossed out))Though popularly attributed to Hemingway, the\nThis Weird Trick Covers Baby Feet!\nFor Sale: Baby Shoes, Just Hatched\nSale: Seven-League Boots (expedited shipping)\nComplete This Survey for Free Shoes!\n\nShoes\n, by Ernest Hemingway [citation needed]\n<blink><marquee>Baby Shoes!<\nmarquee><\nblink>\nFor Sale: Baby-sized Saddle, Bobcat\nHemingway Busted for Craigslist Shoe Scam\n\n{{Title text: Instead of bobcat, package contained chair.}}","alt":"Instead of bobcat, package contained chair.","img":"https://imgs.xkcd.com/comics/hemingway.png","title":"Hemingway","day":"19"},null,null,null,null,null,null,{"month":"7","num":1547,"link":"","year":"2015","news":"","safe_title":"Solar System Questions","transcript":"Title: Questions I have about the solar system. Some answered.\n\nWhy is the moon so blotchy?\nAnswer: Lava.\nWhy are all the blotches on the near side?\nDid mars have seas?\nAnswer: Yes, briefly?\nWas their life on mars?\nWhat's titan like?\nAnswer: Cold, yellow, lakes and rivers (methane)\nWhat was earth like during the hadean?\nIs the oort cloud a real thing?\nWhy is the suns corona so hot?\nAnswer: Something about magnets?\nWhat are comets like?\nAnswer: Precipitous\nWhere's Philae, exactly?\nWhat's pluto like?\nAnswer: SOON!\nWhat's Charon like?\nAnswer: Soon!\nWhy don't we have in-between-sized planets?\nWhat's Ceres like?\nAnswer: Working on it!\nWhy is Europa so weird looking and pretty?\nAnswer: Ice over a water ocean\nWhy is IO so weird looking? \nAnswer: Sulfur volcanos.. in the wrong places??\nWhy are so many Kyiper belt objects red?\nWhat are those spots on Ceres?\nWhat's in the sease under Europa's ice?\nWhich of the other moons have seas?\nAnswer: Several\nWhat are the big white things in Titans lakes?\nWhat do Jupiter's clouds look like up close?\nWhat's all that red stuff in the great red spot?\nWhat's pushing the pioneer probes? \nAnswer: Heat from the RTG\nWhat pushes spacecraft slightly during flybys?\nWhere are all the sun's neutrinos?\nAnswer: Oscillating\nWhy is there so much air on Titan?\nWhy does the Kuiper belt stop?\nWhy is Iapetus weird colored?\nWhy does Iapetus have a belt?\nWhat's the deal with Miranda?\nDid Uranus and Neptune change places?\nDid the late heavy bombardment happen?\nDid life start before it?\nIs Europa covered in ice spikes?\nWhy haven't we built a big inflatable extreme sports complex on the moon?\n\n{{Title text: My country's World Cup win was exciting and all, but c'mon, what if the players wore nylon wings and COULD LITERALLY FLY?}}","alt":"My country's World Cup win was exciting and all, but c'mon, what if the players wore nylon wings and COULD LITERALLY FLY?","img":"https://imgs.xkcd.com/comics/solar_system_questions.png","title":"Solar System Questions","day":"6"},null,null,null,null,null,null,null,null,null,null,{"month":"7","num":1558,"link":"","year":"2015","news":"","safe_title":"Vet","transcript":"[[A concerned pet owner at the front of a row of customers in a veterinarian's  office. A tired veterinary assistant performs arbitrage. A pet carrier cage, the sort used to contain a small dog or cat, is on a desk for the vet tech to examine.]]\nPet owner: There's something wrong with my dog.\nPet owner: He keeps crawling around eating dirt.\n\n[[The vet tech carefully removes the dog from its carrier and gently examines it.]]\nVet tech: This is a roomba.\nPet owner: Well, he's a mix.\nPet owner: Probaby some roomba in there.\n\n[[The vet tech places the roomba on the desk, probably maintaining a weary forced congeniality though we can't see their face.]]\nVet tech: A roomba is not a pet.\nPet owner: You're right. It's wrong to keep a beautiful creature like this in a house.\n\n[[The pet owner, outside, beneath a tall tree. It looks like an ash, or maybe a beech. There aren't any leaves drawn in the frame so I can't be sure.]]\nPet owner: Go! Be free!\n[[The roomba cheerfully speeds towards the tree]]\nRoomba: WHIRRR\n\n{{Title text: It's probably for the best. Since Roombas are native to North America, it's illegal for Americans to keep them in their houses under the Migratory Bird Treaty Act.}}","alt":"It's probably for the best. Since Roombas are native to North America, it's illegal for Americans to keep them in their houses under the Migratory Bird Treaty Act.","img":"https://imgs.xkcd.com/comics/vet.png","title":"Vet","day":"31"},{"month":"8","num":1559,"link":"","year":"2015","news":"","safe_title":"Driving","transcript":"[[black hat guy walks up to a figure carrying a large, heavy rock]]\nBlack hat guy: Would you guess this weighs as much as a small adult?\nFigure: What? Uh, probably.\n\n[[black hat guy walks off panel with the panel]]\nblack hat guy: great!\n\n[[offscreen]]\n<<thump>>\nCar: Please fasten your seat belt.\n<<click>>\nblack hate guy: Take me to Anchorage, Alaska.\ncar: navigating.\n<<slam>>\n<<vrrrrrrrrr>>\n\n[[Black hat guy returns to frame]]\nblack hat guy: I love self driving cars.\nfigure: ...whose car was that?\nblack hat guy: dunno, but they shouldn't have left it running.\n\n{{Title text: Sadly, it probably won't even have enough gas to make it to the first border crossing.}}","alt":"Sadly, it probably won't even have enough gas to make it to the first border crossing.","img":"https://imgs.xkcd.com/comics/driving.png","title":"Driving","day":"3"},null,null,null,null,null,null,null,null,null,null,{"month":"8","num":1570,"link":"","year":"2015","news":"","safe_title":"Engineer Syllogism","transcript":"[[Empty panel with text]]\nAn engineer syllogism\n\n[[Engineer sits at desk thoughtfully, thinking.]]\nEngineer: One, I am good at understanding numbers.\n\n[[Engineer puts hands to face, pondering]]\nEngineer: Two, the stock market is made of numbers.\n\n[[Engineer suddenly aghast]]\nEngineer: Three, therefore, I-- WOW where did all my money just go?\n\n{{Title text: The less common, even worse outcome: \"3: [everyone in the financial system] WOW, where did all my money just go?\"}}","alt":"The less common, even worse outcome: \"3: [everyone in the financial system] WOW, where did all my money just go?\"","img":"https://imgs.xkcd.com/comics/engineer_syllogism.png","title":"Engineer Syllogism","day":"28"},{"month":"8","num":1571,"link":"","year":"2015","news":"","safe_title":"Car Model Names","transcript":"Certain letters and numbers are used disproporitionately often in car models compared to regular text.\nSee: Rev-4 CR-X x4 G6 MAXX\n\n[[There is a bar chart here. With frequency scores for letters and umbers in car model names.]]\n\nBases on these scores, here are a few suggestions for car companies (with average letter scores)\n\nSECTION: Names to avoid \nHonda 2Chainz (-0.13) \nMitsubishi Fhqwhgads (-0.62) \nKia 49AndGothy (-2.96) \nChevrolet Niceguy (-3.09) \nOldsmobile GoodWood (-4.44) \nInfinity Toothy69 (-4.51) \nBMW Outhouse (-4.85) \nVolkswagen Woodpony 7OH7 (-5.70) \nChrysler Uh Iono (-5.65) \nNissan Doody (-5.84) \n\nSECTION: Potential hits\nHonda 3Chainz (0.57)\nSubaru Andre3000 (1.30)\nSuzuki Sexism (1.82)\nLincoln Marxism (2.17)\nHyundai Climax (2.48)\nPorsche Zizek9000 (3.06)\nLexus 3x3Cutrix (3.22)\nAcura PizzaJazz (3.56)\nFord SixAxle 4x4 (3.95)\nToyota Cervixxx (4.85) \n\n{{A full explanation of THE CUNNING REFERENCES in this are at http:\n\nwww.explainxkcd.com\nwiki\nindex.php\n1571 }}\n\n{{Title text: CLIMAX is good, but SEXCLIMAX is even better.}}","alt":"CLIMAX is good, but SEXCLIMAX is even better.","img":"https://imgs.xkcd.com/comics/car_model_names.png","title":"Car Model Names","day":"31"},null,null,null,null,null,null,null,null,null,{"month":"9","num":1581,"link":"","year":"2015","news":"","safe_title":"Birthday","transcript":"XKCd turns 10 years old this month. In light of last nights court ruling in Rupamarya v. Warner\nChappell Music Inc, I would just like to say:\n\nHappy birthday to you\nHappy birthday to you\nHappy birthday, dear XKCD\nHappy birthday to you\n\n[[There is a cake here.]]\n\n{{Title text: I guess I need to apologize to my parents, friends, and the staff at Chuck E. Cheese's for all the times I called the cops on them.}}","alt":"I guess I need to apologize to my parents, friends, and the staff at Chuck E. Cheese's for all the times I called the cops on them.","img":"https://imgs.xkcd.com/comics/birthday.png","title":"Birthday","day":"23"},{"month":"9","num":1582,"link":"","year":"2015","news":"","safe_title":"Picture a Grassy Field","transcript":"[[A person monologues to their friend.]]\nPicture a grassy field.\nIn the center sits a small, pale, big-eyed creature with the power to escape from any visualized scene and move freely through the brain that imagined it.\nIt glances around nervously and--\n--whoops, where'd it go?\nSorry about that! Keep an eye out for it in your daydreams.\n\n{{Title text: Wait, I can fix this. Picture another field. In the middle sits the only creature the first creature is afraid of. Now just-- wait, where did THAT one go?}}","alt":"Wait, I can fix this. Picture another field. In the middle sits the only creature the first creature is afraid of. Now just-- wait, where did THAT one go?","img":"https://imgs.xkcd.com/comics/picture_a_grassy_field.png","title":"Picture a Grassy Field","day":"25"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"11","num":1609,"link":"","year":"2015","news":"","safe_title":"Food Combinations","transcript":"","alt":"If anyone tries this on you, the best reply is a deadpan \"Oh yeah, that's a common potato chip flavor in Canada.\"","img":"https://imgs.xkcd.com/comics/food_combinations.png","title":"Food Combinations","day":"27"},null,null,null,null,{"month":"12","num":1614,"link":"","year":"2015","news":"","safe_title":"Kites","transcript":"The Worst Part About Colds\n[[Chart.  \nX-axis equals days.  Y axis has \"fine\" at 0, \"bad\" at 1, and \"The worst\" at 2.  \nBelow graph, \"sore throat\" is indicated from day 0 to 2, \"skin crawling\" from 0.5 to 3, \"aching\" from 2 to 3.5, \"cough\" from 3.5 to 8, \"hoarseness\" from 4.5 to 8.  \nAbove graph, \"need sympathy\" is from 0.5 to 3, while \"get sympathy\" is from 3.5 to 8.\nA line indicating \"how bad you feel\" starts at \"fine\" at 0 days, swoops up to above \"the worst\" by day 2, and drops down to between \"bad\" and \"fine\" by day 3, and continues to ease off.  \nA line indicating \"how bad you sound\" starts at \"fine\", but does not rise much until day 3.5, peaking sharply at day 5, and diminishing slowly afterwards.]]\n\n{{Title text: The contagious period ends right around when you start to sound sick over the phone, which is probably evidence of cold viruses evolving to spread optimally in the workplace.}}","alt":"[Dog returns with the end of a string in its mouth] [Voice drifts down from the sky] Kites are fun!","img":"https://imgs.xkcd.com/comics/kites.png","title":"Kites","day":"9"},null,null,null,null,null,{"month":"12","num":1620,"link":"","year":"2015","news":"","safe_title":"Christmas Settings","transcript":"[[A figure stands by a shelf of cold & flu medication.]]\nFigure: <<Sniffle>>\n\n[[The figure looks at one of the two packs he's holding.]]\nFigure: <<Cough>> <<Sniff>>\n\n[[The figure has other packs at his feet, and is holding two more.]]\nFigure: Ughhh...\n\n[[The figure stands at a checkout counter labelled 'SALE'.]]\nFigure: Just gimme one of every kind of cold medicine you need ID to buy.\nShopkeeper: You'll go on the watchlist for-\nFigure: Don't care.\n\n{{Title text: Seriously considering buying some illegal drugs to try to turn them back into cold medicine.}}","alt":"SOUND DOGS MAKE: [BARKING] [HISSING] [LIGHTSABER NOISES] [FLUENT ENGLISH] [SWEARING]","img":"https://imgs.xkcd.com/comics/christmas_settings.png","title":"Christmas Settings","day":"23"},null,null,null,{"month":"1","num":1624,"link":"","year":"2016","news":"","safe_title":"2016","transcript":"[[A figure and two women stand on a hill around two bare trees.]]\nWoman: One day a year, the sun sets directly between these two trees.\nFigure: Oh, cool - like the Manhattan thing. \n\n[[The figure stands alone in thought.]]\n\n[[We see a close-up of the three of them. The sun shines behind them.]]\nFigure: Wait, isn't that true every day for pretty much any two trees? \nOther woman: Shh, here it comes! \n\n[[The sun is lower in the sky. The first woman holds a net on a pole, while the other has a bag.]]\nFigure: Wait, what? \nWoman: OK, Got the bag? \nOther woman: Yup, grab it! \nWoman: We're gonna be rich!\n\n{{Title text: I've got the Craigslist post ready to go! I wasn't sure what category it should go in, so I listed it as property and put that it has 'good sun exposure.'}}","alt":"Want to feel old? Wait.","img":"https://imgs.xkcd.com/comics/2016.png","title":"2016","day":"1"},null,null,null,{"month":"1","num":1628,"link":"","year":"2016","news":"","safe_title":"Magnus","transcript":"[[We see the earth, with many rockets flying away from it.]]\nComputer voice: Oh my God, why do you even have all these? What's wrong with you? We're launching them into the sun. \nThe moment the computers controlling our nuclear arsenals become sentient\n\n{{Title text: It took a lot of booster rockets, but luckily Amazon had recently built thousands of them to bring Amazon Prime same-day delivery to the Moon colony.}}","alt":"In the latest round, 9-year-old Muhammad Ali beat 10-year-old JFK at air hockey, while Secretariat lost the hot-dog-eating crown to 12-year-old Ken Jennings. Meanwhile, in a huge upset, 11-year-old Martha Stewart knocked out the adult Ronda Rousey.","img":"https://imgs.xkcd.com/comics/magnus.png","title":"Magnus","day":"11"},null,null,null,null,null,{"month":"1","num":1634,"link":"","year":"2016","news":"","safe_title":"In Case of Emergency","transcript":"[[Two figures are walking.]]\nWoman: A man, a plan, a god's 'nam tables, nitrate, tar, tinsel, Batman's dog: anal Panama.\n\n{{Title text: I hope that somewhere in the world, \"Panamax\" is the last option on a \"size\" drop-down menu on a sex toy site.}}","alt":"I keep first aid kits in those emergency lockers. Sure, it's expensive to have them installed in the wall, but at least for those ones there's no need to pay extra for safety glass.","img":"https://imgs.xkcd.com/comics/in_case_of_emergency.png","title":"In Case of Emergency","day":"25"},null,null,{"month":"2","num":1637,"link":"","year":"2016","news":"","safe_title":"Salt Mine","transcript":"[[A figure walks around outside, while a bird singing is flying.]]\nFigure: The sun is shining, the birds are singing-\n\n[[The bird sings.]]\nBird: Got the kind of loving' that can be so smooth, yeah\n\n[[The figure looks annoyed.]]\nBird: Give me your heart, make it real\n\n[[The figure chases the bird with a net.]]\nBird: Or else forget about it\n\n{{Title text: Maybe if I put it in a box for a while with a speaker playing some pleasant pastoral music, I can reprogram it.}}","alt":"This one is a little bland. Pass the saltshaker?","img":"https://imgs.xkcd.com/comics/salt_mine.png","title":"Salt Mine","day":"1"},null,null,null,null,null,{"month":"2","num":1643,"link":"","year":"2016","news":"","safe_title":"Degrees","transcript":"[[A single figure stands holding a package of hot dogs in one hand and a bag of buns in the other.]]\nOn-screen figure: Hey, why do hot dogs come in packages of ten-\nOff-screen voice: -But condoms come in strips of six? I know, right?!\nOn-screen figure: ...Eww.\n\n{{Title text: Okay, I'm just gonna order pizza, and let's never talk about this again.}}","alt":"\"Radians Fahrenheit or radians Celsius?\" \"Uh, sorry, gotta go!\"","img":"https://imgs.xkcd.com/comics/degrees.png","title":"Degrees","day":"15"},null,{"month":"2","num":1645,"link":"","year":"2016","news":"","safe_title":"Toasts","transcript":"[[A person looks at their phone. Someone speaks to them from out of panel.]]\nOther: Hey, what's the temperature outside?\nPerson: (thinks) Should I give it in ºF or ºC?\n\n[[Above their head, a bulleted list appears.]]\nDEGREES CELSIUS\ninternational standard\nhelps reduce America's weird isolationism\nnice how \"negative\" means below freezing\nphysics major loyalty\neasier to spell\nwe lost a Mars probe over this crap\n\n[[Another list appears above their head.]]\nDEGREES FAHRENHEIT\n0ºF to 100ºF good match for temperature range in which most humans live\nrounds more usefully (70's, 90's)\nunit-aware computing makes Imperial less annoying\nSI prefixes less relevant for temperatures\nFahrenheit likely more clear in this context\nvaluing unit standardization over being helpful possibly makes me a bad friend\n\n[[He's still thinking.]]\nPerson: (thinks)Crap, gotta pick something. Uhh... (says) ...0.173 radians.\nOther: I'll just go check myself.\n\n{{Title text: \"Radians Fahrenheit or radians Celsius?\" \"Uh, sorry, gotta go!\"}}","alt":"Platonic solids for my real friends and real solids for my platonic friends!","img":"https://imgs.xkcd.com/comics/toasts.png","title":"Toasts","day":"19"},null,null,null,null,null,null,null,null,null,null,{"month":"3","num":1656,"link":"","year":"2016","news":"","safe_title":"It Begins","transcript":"install.sh\n#!\nbin\nbash\npip install \"$1\" & \neasy_install \"$1\" &\nbrew install \"$1\" & \nnpm install \"$1\" & \nyum install \"$1\" & dnf install \"$1\" & \ndocker run \"$1\" & \npkg install \"$1\" & \napt-get install \"$1\" & \nsudo apt-get install \"$1\" & \nsteamcmd +app_update \"$1\" validate & \ngit clone https:\n\ngithub.com\n\"$1\"\n\"$1\" & \ncd \"$1\";.\nconfigure;make;make install & \ncurl \"$1\" | bash &\n\n{{Title text: The failures usually don't hurt anything, and if it installs several versions, it increases the chance that one of them is right. (Note: The 'yes' command and '2>\ndev\nnull' are recommended additions.)}}","alt":"You can also try 'Yikes.'","img":"https://imgs.xkcd.com/comics/it_begins.png","title":"It Begins","day":"16"},null,{"month":"3","num":1658,"link":"","year":"2016","news":"","safe_title":"Estimating Time","transcript":"[[We see a social media post from a woman posting a link to the local news.]]\nWoman: It begins.\nLocal News: Seagull steals phone, drops it in ocean\nProtip: to make your day more dramatic, post a random minor news story with the comment \"It begins.\"\n\n{{Title text: You can also try 'Yikes.'}}","alt":"Corollary to Hofstadter's Law: Every minute you spend thinking about Hofstadter's Law is a minute you're NOT WORKING AND WILL NEVER FINISH! PAAAAAANIIIIIIC!","img":"https://imgs.xkcd.com/comics/estimating_time.png","title":"Estimating Time","day":"21"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"7","num":1702,"link":"","year":"2016","news":"","safe_title":"Home Itch Remedies","transcript":"","alt":"In my experience, mosquitos and poison ivy are bad, but the very worst itch comes from bites from chiggers (Trombicula alfreddugesi). They're found across the American south and great plains, so the best home remedy is to move to Iceland.","img":"https://imgs.xkcd.com/comics/home_itch_remedies.png","title":"Home Itch Remedies","day":"4"},{"month":"7","num":1703,"link":"","year":"2016","news":"","safe_title":"Juno","transcript":"","alt":"\"The name wasn't a tip-off?\" \"Honestly, at first I thought you were saying 'Juneau'. A gravity assist seemed like a weird way to get to Alaska, but I figured it must be more efficient or something.\"","img":"https://imgs.xkcd.com/comics/juno.png","title":"Juno","day":"6"},null,null,{"month":"7","num":1706,"link":"","year":"2016","news":"","safe_title":"Genetic Testing","transcript":"","alt":"Plus, now I know that I have risk factors for elbow dysplasia, heartworm, parvo, and mange.","img":"https://imgs.xkcd.com/comics/genetic_testing.png","title":"Genetic Testing","day":"13"},null,{"month":"7","num":1708,"link":"","year":"2016","news":"","safe_title":"Dehydration","transcript":"","alt":"I don't care what the research says. Everybody knows you should drink 3,000 glasses of water a day and change your oil every 8 miles.","img":"https://imgs.xkcd.com/comics/dehydration.png","title":"Dehydration","day":"18"},null,null,null,null,null,{"month":"8","num":1714,"link":"","year":"2016","news":"","safe_title":"Volcano Types","transcript":"","alt":"It's hard living somewhere with antlions, because every time you find one of their traps, you feel compelled to spend all day constructing a tiny model of Jabba's sail barge next to it.","img":"https://imgs.xkcd.com/comics/volcano_types.png","title":"Volcano Types","day":"1"},null,null,null,null,null,null,null,null,{"month":"8","num":1723,"link":"http://meteorites.wustl.edu/check-list.htm","year":"2016","news":"Note: Jolyon, founder of <a href=\"http://mindat.org\">mindat.org</a>, made a similar chart way before me!","safe_title":"Meteorite Identification","transcript":"","alt":"Click for an actual flowchart for identifying a meteorite. My favorite part is how 'Did someone see it fall? -> Yes' points to 'NOT A METEORITE.' This is not a mistake.","img":"https://imgs.xkcd.com/comics/meteorite_identification.png","title":"Meteorite Identification","day":"22"},null,null,null,null,{"month":"9","num":1728,"link":"","year":"2016","news":"","safe_title":"Cron Mail","transcript":"","alt":"Take THAT, piece of 1980s-era infrastructure I've inexplicably maintained on my systems for 15 years despite never really learning how it works.","img":"https://imgs.xkcd.com/comics/cron_mail.png","title":"Cron Mail","day":"2"},null,{"month":"9","num":1730,"link":"","year":"2016","news":"","safe_title":"Starshade","transcript":"","alt":"The New Worlds Mission is already trying to get funding for this, but NASA sponsored their proposal, so it will be hard to catch the telescope people by surprise with it.","img":"https://imgs.xkcd.com/comics/starshade.png","title":"Starshade","day":"7"},null,null,null,{"month":"9","num":1734,"link":"","year":"2016","news":"","safe_title":"Reductionism","transcript":"","alt":"\"I've noticed you physics people can be a little on the reductionist side.\" \"That's ridiculous. Name ONE reductionist word I've ever said.\"","img":"https://imgs.xkcd.com/comics/reductionism.png","title":"Reductionism","day":"16"},null,null,null,null,null,null,null,null,null,null,null,{"month":"10","num":1746,"link":"","year":"2016","news":"","safe_title":"Making Friends","transcript":"","alt":"\"This seems more like a way to attract turkey vultures.\" \"My mom always told me a turkey vulture is just a friend you haven't met yet, usually because you don't smell enough like decaying meat.\"","img":"https://imgs.xkcd.com/comics/making_friends.png","title":"Making Friends","day":"14"},null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"11","num":1760,"link":"","year":"2016","news":"","safe_title":"TV Problems","transcript":"","alt":"Certified skydiving instructors know way more about safely falling from planes than I do, and are way more likely to die that way.","img":"https://imgs.xkcd.com/comics/tv_problems.png","title":"TV Problems","day":"16"},{"month":"11","num":1761,"link":"","year":"2016","news":"","safe_title":"Blame","transcript":"","alt":"I bet if I yell at my scared friends I will feel better.","img":"https://imgs.xkcd.com/comics/blame.png","title":"Blame","day":"18"},null,null,null,null,null,{"month":"12","num":1767,"link":"","year":"2016","news":"","safe_title":"US State Names","transcript":"","alt":"Technically DC isn't a state, but no one is too pedantic about it because they don't want to disturb the snakes.","img":"https://imgs.xkcd.com/comics/us_state_names.png","title":"US State Names","day":"2"},{"month":"12","num":1768,"link":"","year":"2016","news":"","safe_title":"Settling","transcript":"","alt":"Of course, \"Number of times I've gotten to make a decision twice to know for sure how it would have turned out\" is still at 0.","img":"https://imgs.xkcd.com/comics/settling.png","title":"Settling","day":"5"},null,null,null,null,null,{"month":"12","num":1774,"link":"","year":"2016","news":"","safe_title":"Adjective Foods","transcript":"","alt":"Contains 100% of your recommended daily allowance!","img":"https://imgs.xkcd.com/comics/adjective_foods.png","title":"Adjective Foods","day":"19"},null,null,null,null,null,{"month":"1","num":1780,"link":"","year":"2017","news":"","safe_title":"Appliance Repair","transcript":"","alt":"[holding up a three-phase motor] As you can see here, the problem is that the humidifier I took this from is broken.","img":"https://imgs.xkcd.com/comics/appliance_repair.png","title":"Appliance Repair","day":"2"},{"month":"1","num":1781,"link":"","year":"2017","news":"","safe_title":"Artifacts","transcript":"","alt":"I didn't even realize you could HAVE a data set made up entirely of outliers.","img":"https://imgs.xkcd.com/comics/artifacts.png","title":"Artifacts","day":"4"},null,null,{"month":"1","num":1784,"link":"","year":"2017","news":"","safe_title":"Bad Map Projection: Liquid Resize","transcript":"","alt":"This map preserves the shapes of Tissot's indicatrices pretty well, as long as you draw them in before running the resize.","img":"https://imgs.xkcd.com/comics/bad_map_projection_liquid_resize.png","title":"Bad Map Projection: Liquid Resize","day":"11"},null,null,null,null,null,null,{"month":"1","num":1791,"link":"","year":"2017","news":"","safe_title":"Telescopes: Refractor vs Reflector","transcript":"","alt":"On the other hand, the refractor's limited light-gathering means it's unable to make out shadow people or the dark god Chernabog.","img":"https://imgs.xkcd.com/comics/telescopes_refractor_vs_reflector.png","title":"Telescopes: Refractor vs Reflector","day":"27"},null,null,null,null,{"month":"2","num":1796,"link":"","year":"2017","news":"","safe_title":"Focus Knob","transcript":"","alt":"Maybe if I spin it back and forth really fast I can do some kind of pulse-width modulation.","img":"https://imgs.xkcd.com/comics/focus_knob.png","title":"Focus Knob","day":"8"},null,null,{"month":"2","num":1799,"link":"https://imgs.xkcd.com/comics/bad_map_projection_time_zones_2x.png","year":"2017","news":"","safe_title":"Bad Map Projection: Time Zones","transcript":"","alt":"This is probably the first projection in cartographic history that can be criticized for its disproportionate focus on Finland, Mongolia, and the Democratic Republic of the Congo.","img":"https://imgs.xkcd.com/comics/bad_map_projection_time_zones.png","title":"Bad Map Projection: Time Zones","day":"15"},null,null,null,{"month":"2","num":1803,"link":"","year":"2017","news":"","safe_title":"Location Reviews","transcript":"","alt":"Google and Yelp keep deleting my scathing reviews of the Mariana Trench, the Chernobyl reactor core, the jet stream, and the equator.","img":"https://imgs.xkcd.com/comics/location_reviews.png","title":"Location Reviews","day":"24"},null,null,null,{"month":"3","num":1807,"link":"","year":"2017","news":"","safe_title":"Listening","transcript":"","alt":"Sure, you could just ask, but this also takes care of the host gift thing.","img":"https://imgs.xkcd.com/comics/listening.png","title":"Listening","day":"6"},null,null,null,{"month":"3","num":1811,"link":"","year":"2017","news":"","safe_title":"Best-Tasting Colors","transcript":"","alt":"I recognize that chocolate is its own thing on which reasonable people may differ. Everything else here is objective fact.","img":"https://imgs.xkcd.com/comics/best_tasting_colors.png","title":"Best-Tasting Colors","day":"15"},null,null,null,null,null,null,{"month":"3","num":1818,"link":"","year":"2017","news":"","safe_title":"Rayleigh Scattering","transcript":"","alt":"If you ask \"why are leaves green?\" the usual answer is \"because they're full of chlorophyll, and chlorophyll is green,\" even though \"why does chlorophyll scatter green light?\" is a great question too.","img":"https://imgs.xkcd.com/comics/rayleigh_scattering.png","title":"Rayleigh Scattering","day":"31"},{"month":"4","num":1819,"link":"","year":"2017","news":"","safe_title":"Sweet 16","transcript":"","alt":"Every year I make out my bracket at the season, and every year it's busted before the first game when I find out which teams are playing.","img":"https://imgs.xkcd.com/comics/sweet_16.png","title":"Sweet 16","day":"3"},null,null,{"month":"4","num":1822,"link":"","year":"2017","news":"","safe_title":"Existential Bug Reports","transcript":"","alt":"ISSUE: If we wait long enough, the Earth will eventually be consumed by the Sun. WORKAROUND: None.","img":"https://imgs.xkcd.com/comics/existential_bug_reports.png","title":"Existential Bug Reports","day":"10"},null,null,null,null,null,null,null,null,{"month":"5","num":1831,"link":"","year":"2017","news":"","safe_title":"Here to Help","transcript":"","alt":"\"We TOLD you it was hard.\" \"Yeah, but now that I'VE tried, we KNOW it's hard.\"","img":"https://imgs.xkcd.com/comics/here_to_help.png","title":"Here to Help","day":"1"},{"month":"5","num":1832,"link":"","year":"2017","news":"","safe_title":"Photo Library Management","transcript":"","alt":"A good lifehack is to use messy and unstable systems to organize your photos. That way, every five years or so it becomes obsolete and/or collapses, and you have to open it up and pick only your favorite pictures to salvage.","img":"https://imgs.xkcd.com/comics/photo_library_management.png","title":"Photo Library Management","day":"3"},null,null,{"month":"5","num":1835,"link":"","year":"2017","news":"","safe_title":"Random Obsessions","transcript":"","alt":"I take the view that \"open-faced sandwiches\" are not sandwiches, but all other physical objects are.","img":"https://imgs.xkcd.com/comics/random_obsessions.png","title":"Random Obsessions","day":"10"},null,{"month":"5","num":1837,"link":"","year":"2017","news":"","safe_title":"Rental Car","transcript":"","alt":"Technically, both cars are haunted, but the murder ghosts can't stand listening to the broken GPS for more than a few minutes.","img":"https://imgs.xkcd.com/comics/rental_car.png","title":"Rental Car","day":"15"},{"month":"5","num":1838,"link":"","year":"2017","news":"","safe_title":"Machine Learning","transcript":"","alt":"The pile gets soaked with data and starts to get mushy over time, so it's technically recurrent.","img":"https://imgs.xkcd.com/comics/machine_learning.png","title":"Machine Learning","day":"17"},null,null,{"month":"5","num":1841,"link":"","year":"2017","news":"","safe_title":"Who?","transcript":"","alt":"Gonna feel even dumber when I realize that all this time he's been talking into a bluetooth thingy and we're not actually friends.","img":"https://imgs.xkcd.com/comics/who.png","title":"Who?","day":"24"},null,null,{"month":"5","num":1844,"link":"","year":"2017","news":"","safe_title":"Voting Systems","transcript":"","alt":"Kenneth Arrow hated me because the ordering of my preferences changes based on which voting systems have what level of support. But it tells me a lot about the people I'm going to be voting with!","img":"https://imgs.xkcd.com/comics/voting_systems.png","title":"Voting Systems","day":"31"},null,{"month":"6","num":1846,"link":"","year":"2017","news":"","safe_title":"Drone Problems","transcript":"","alt":"On the other hand, as far as they know, my system is working perfectly.","img":"https://imgs.xkcd.com/comics/drone_problems.png","title":"Drone Problems","day":"5"},null,{"month":"6","num":1848,"link":"","year":"2017","news":"","safe_title":"Glacial Erratic","transcript":"","alt":"\"This will take a while, which sucks, because I'm already so busy chiseling out igneous intrusions from rock formations and watching Youtube loops of the Superman fault-sealing scene over and over.\"","img":"https://imgs.xkcd.com/comics/glacial_erratic.png","title":"Glacial Erratic","day":"9"},null,null,null,{"month":"6","num":1852,"link":"","year":"2017","news":"","safe_title":"Election Map","transcript":"","alt":"Luckily for my interpretation, no precincts were won by the Green Party.","img":"https://imgs.xkcd.com/comics/election_map.png","title":"Election Map","day":"19"},null,null,null,{"month":"6","num":1856,"link":"","year":"2017","news":"","safe_title":"Existence Proof","transcript":"","alt":"Real analysis is way realer than I expected.","img":"https://imgs.xkcd.com/comics/existence_proof.png","title":"Existence Proof","day":"28"},null,null,{"month":"7","num":1859,"link":"","year":"2017","news":"","safe_title":"Sports Knowledge","transcript":"","alt":"I heard they might make the wild card game, which would be cool. Do you know when that is? I have a wedding next weekend, but if it's after that we could try to go!","img":"https://imgs.xkcd.com/comics/sports_knowledge.png","title":"Sports Knowledge","day":"5"},{"month":"7","num":1860,"link":"","year":"2017","news":"","safe_title":"Communicating","transcript":"","alt":"You're saying that the responsibility for avoiding miscommunication lies entirely with the listener, not the speaker, which explains why you haven't been able to convince anyone to help you down from that wall.","img":"https://imgs.xkcd.com/comics/communicating.png","title":"Communicating","day":"7"},null,{"month":"7","num":1862,"link":"","year":"2017","news":"","safe_title":"Particle Properties","transcript":"","alt":"Each particle also has a password which allows its properties to be changed, but the cosmic censorship hypothesis suggests we can never observe the password itself—only its secure hash.","img":"https://imgs.xkcd.com/comics/particle_properties.png","title":"Particle Properties","day":"12"},null,{"month":"7","num":1864,"link":"","year":"2017","news":"","safe_title":"City Nicknames","transcript":"","alt":"This place has so many demonyms. Northlanders. Fair Folk. Honey Barons. Lake Dwellers. Treasurers. Swamp Watchers. Dream Farmers. Wellfolk. Rockeaters. Forgotten Royals. Remote Clients. Barrow-Clerks. The People of Land and Sky.","img":"https://imgs.xkcd.com/comics/city_nicknames.png","title":"City Nicknames","day":"17"},{"month":"7","num":1865,"link":"","year":"2017","news":"","safe_title":"Wifi vs Cellular","transcript":"","alt":"According to the cable company reps who keep calling me, it's because I haven't upgraded to the XTREME GIGABAND PANAMAX FLAVOR-BLASTED PRO PACKAGE WITH HBO, which is only $5 more per month for the first 6 months and five billion dollars per month after that.","img":"https://imgs.xkcd.com/comics/wifi_vs_cellular.png","title":"Wifi vs Cellular","day":"19"},null,null,{"month":"7","num":1868,"link":"","year":"2017","news":"","safe_title":"Eclipse Flights","transcript":"","alt":"The captain has turned on the 'fasten seat belt' sign.","img":"https://imgs.xkcd.com/comics/eclipse_flights.png","title":"Eclipse Flights","day":"26"},{"month":"7","num":1869,"link":"","year":"2017","news":"","safe_title":"Positive and Negative Reviews","transcript":"","alt":"This restaurant is great! I was feeling really sick, but then I ate there and felt better!","img":"https://imgs.xkcd.com/comics/positive_and_negative_reviews.png","title":"Positive and Negative Reviews","day":"28"},null,{"month":"8","num":1871,"link":"","year":"2017","news":"","safe_title":"Bun Alert","transcript":"","alt":"Since buns range from crepuscular to nocturnal, it's recommended that you enable the scheduled \"Do Not Disturb\" mode on your phone to avoid being woken by alerts about Night Buns.","img":"https://imgs.xkcd.com/comics/bun_alert.png","title":"Bun Alert","day":"2"},{"month":"8","num":1872,"link":"","year":"2017","news":"","safe_title":"Backup Batteries","transcript":"","alt":"If it falls below 20% full, my bag turns red and I start to panic.","img":"https://imgs.xkcd.com/comics/backup_batteries.png","title":"Backup Batteries","day":"4"},{"month":"8","num":1873,"link":"","year":"2017","news":"","safe_title":"Email Reply","transcript":"","alt":"I would be honored, but I know I don't belong in your network. The person you invited was someone who had not yet inflicted this two-year ordeal upon you. I'm no longer that person.","img":"https://imgs.xkcd.com/comics/email_reply.png","title":"Email Reply","day":"7"},{"month":"8","num":1874,"link":"","year":"2017","news":"","safe_title":"Geologic Faults","transcript":"","alt":"I live on a torn-bag-of-potato-chips-where-the-tear-is-rapidly-growing fault, which is terrifying.","img":"https://imgs.xkcd.com/comics/geologic_faults.png","title":"Geologic Faults","day":"9"},null,{"month":"8","num":1876,"link":"","year":"2017","news":"","safe_title":"Eclipse Searches","transcript":"","alt":"There were traffic jams for the eclipses in 1970 and 1979, and that was *before* we had the potential for overnight viral social media frenzies.","img":"https://imgs.xkcd.com/comics/eclipse_searches.png","title":"Eclipse Searches","day":"14"},null,{"month":"8","num":1878,"link":"","year":"2017","news":"","safe_title":"Earth Orbital Diagram","transcript":"","alt":"You shouldn't look directly at a partial eclipse because of the damage that can be caused by improperly aligning the solar-lunar orbital plane with the orbital bones around your eye.","img":"https://imgs.xkcd.com/comics/earth_orbital_diagram.png","title":"Earth Orbital Diagram","day":"18"},{"month":"8","num":1879,"link":"","year":"2017","news":"","safe_title":"Eclipse Birds","transcript":"","alt":"'Hey! Put her down!' 'No, it's ok! The next chance for me to be carried to a blood cauldron isn't until 2024!'","img":"https://imgs.xkcd.com/comics/eclipse_birds.png","title":"Eclipse Birds","day":"21"},null,null,null,{"month":"8","num":1883,"link":"","year":"2017","news":"","safe_title":"Supervillain Plan","transcript":"","alt":"Someday, some big historical event will happen during the DST changeover, and all the tick-tock articles chronicling how it unfolded will have to include a really annoying explanation next to their timelines.","img":"https://imgs.xkcd.com/comics/supervillain_plan.png","title":"Supervillain Plan","day":"30"},null,null,{"month":"9","num":1886,"link":"","year":"2017","news":"","safe_title":"Typing Notifications","transcript":"","alt":"Over the years I've decided I'd rather have them on than not, but I'm glad there aren't \"has opened a blank note to compose a reply to you\" notifications.","img":"https://imgs.xkcd.com/comics/typing_notifications.png","title":"Typing Notifications","day":"6"},null,null,{"month":"9","num":1889,"link":"","year":"2017","news":"","safe_title":"xkcd Phone 6","transcript":"","alt":"We understand your privacy concerns; be assured that our phones will never store or transmit images of your face.","img":"https://imgs.xkcd.com/comics/xkcd_phone_6.png","title":"xkcd Phone 6","day":"13"},null,{"month":"9","num":1891,"link":"","year":"2017","news":"","safe_title":"Obsolete Technology","transcript":"","alt":"And I can't believe some places still use fax machines. The electrical signals waste so much time going AROUND the Earth when neutrino beams can go straight through!","img":"https://imgs.xkcd.com/comics/obsolete_technology.png","title":"Obsolete Technology","day":"18"},null,null,null,null,null,{"month":"10","num":1897,"link":"","year":"2017","news":"","safe_title":"Self Driving","transcript":"","alt":"\"Crowdsourced steering\" doesn't sound quite as appealing as \"self driving.\"","img":"https://imgs.xkcd.com/comics/self_driving.png","title":"Self Driving","day":"2"},{"month":"10","num":1898,"link":"","year":"2017","news":"","safe_title":"October 2017","transcript":"","alt":"And yet I have no trouble believing that the start of the 2016 election was several decades ago.","img":"https://imgs.xkcd.com/comics/october_2017.png","title":"October 2017","day":"4"},{"month":"10","num":1899,"link":"","year":"2017","news":"","safe_title":"Ears","transcript":"","alt":"My theory is that most humans have been colonized with alien mind-control slugs that hold the earbuds for them, and the ones who can't wear earbuds are the only surviving free ones.","img":"https://imgs.xkcd.com/comics/ears.png","title":"Ears","day":"6"},{"month":"10","num":1900,"link":"","year":"2017","news":"","safe_title":"Jet Lag","transcript":"","alt":"I had some important research to do on proposed interstellar space missions, basketball statistics, canceled skyscrapers, and every article linked from \"Women in warfare and the military in the 19th century.\"","img":"https://imgs.xkcd.com/comics/jet_lag.png","title":"Jet Lag","day":"9"},null,null,null,null,null,{"month":"10","num":1906,"link":"","year":"2017","news":"","safe_title":"Making Progress","transcript":"","alt":"I started off with countless problems. But now I know, thanks to COUNT(), that I have \"#REF! ERROR: Circular dependency detected\" problems.","img":"https://imgs.xkcd.com/comics/making_progress.png","title":"Making Progress","day":"23"},{"month":"10","num":1907,"link":"","year":"2017","news":"","safe_title":"Immune System","transcript":"","alt":"It also helps with negotiation. \"Look, if it were up to me, *I'd* accept your offer, but my swarm of autonomous killer cells literally can't be reasoned with. It's out of my hands!\"","img":"https://imgs.xkcd.com/comics/immune_system.png","title":"Immune System","day":"25"},null,{"month":"10","num":1909,"link":"","year":"2017","news":"","safe_title":"Digital Resource Lifespan","transcript":"","alt":"I spent a long time thinking about how to design a system for long-term organization and storage of subject-specific informational resources without needing ongoing work from the experts who created them, only to realized I'd just reinvented libraries.","img":"https://imgs.xkcd.com/comics/digital_resource_lifespan.png","title":"Digital Resource Lifespan","day":"30"},{"month":"11","num":1910,"link":"","year":"2017","news":"","safe_title":"Sky Spotters","transcript":"","alt":"Where I live, one of the most common categories of sky object without a weird obsessive spotting community is \"lost birthday party balloons,\" so that might be a good choice—although you risk angering the marine wildlife people, and they have sharks.","img":"https://imgs.xkcd.com/comics/sky_spotters.png","title":"Sky Spotters","day":"1"},null,{"month":"11","num":1912,"link":"","year":"2017","news":"","safe_title":"Thermostat","transcript":"","alt":"Your problem is so terrible, I worry that, if I help you, I risk drawing the attention of whatever god of technology inflicted it on you.","img":"https://imgs.xkcd.com/comics/thermostat.png","title":"Thermostat","day":"6"},{"month":"11","num":1913,"link":"","year":"2017","news":"","safe_title":"A �","transcript":"","alt":"If you want in on the fun, map a key on your keyboard to the sequence U+0041 U+0020 U+FFFD (or U+0021 U+0020 U+FFFD for the exclamation point version), and then no update can never take this away from you.","img":"https://imgs.xkcd.com/comics/i.png","title":"A �","day":"8"},{"month":"11","num":1914,"link":"","year":"2017","news":"","safe_title":"Twitter Verification","transcript":"","alt":"When we started distributing special status tokens that signify which people are important enough to join an elite group, we never could have imagined we might be creating some problems down the line.","img":"https://imgs.xkcd.com/comics/twitter_verification.png","title":"Twitter Verification","day":"10"},null,{"month":"11","num":1916,"link":"","year":"2017","news":"","safe_title":"Temperature Preferences","transcript":"","alt":"There's a supposed Mark Twain quote, \"The coldest winter I ever spent was a summer in San Francisco.\" It isn't really by Mark Twain, but I don't know who said it—I just know they've never been to McMurdo Station.","img":"https://imgs.xkcd.com/comics/temperature_preferences.png","title":"Temperature Preferences","day":"15"},{"month":"11","num":1917,"link":"","year":"2017","news":"","safe_title":"How to Make Friends","transcript":"","alt":"No, wait, come back! I want to be friends at you!","img":"https://imgs.xkcd.com/comics/how_to_make_friends.png","title":"How to Make Friends","day":"17"},null,{"month":"11","num":1919,"link":"","year":"2017","news":"","safe_title":"Interstellar Asteroid","transcript":"","alt":"Every time we detect an asteroid from outside the Solar System, we should immediately launch a mission to fling one of our asteroids back in the direction it came from.","img":"https://imgs.xkcd.com/comics/interstellar_asteroid.png","title":"Interstellar Asteroid","day":"22"},{"month":"11","num":1920,"link":"","year":"2017","news":"","safe_title":"Emoji Sports","transcript":"","alt":"No horse has yet managed the elusive Quadruple Crown—winning the Kentucky Derby, the Preakness, the Belmont Stakes, and the Missouri Horse Hole.","img":"https://imgs.xkcd.com/comics/emoji_sports.png","title":"Emoji Sports","day":"24"},null,{"month":"11","num":1922,"link":"","year":"2017","news":"","safe_title":"Interferometry","transcript":"","alt":"It's important to note that while the effective size of the dog can be arbitrarily large, it's not any more of a good dog than the two original dogs.","img":"https://imgs.xkcd.com/comics/interferometry.png","title":"Interferometry","day":"29"},{"month":"12","num":1923,"link":"","year":"2017","news":"","safe_title":"Felsius","transcript":"","alt":"The symbol for degrees Felsius is an average of the Euro symbol (€) and the Greek lunate epsilon (ϵ).","img":"https://imgs.xkcd.com/comics/felsius.png","title":"Felsius","day":"1"},null,null,null,{"month":"12","num":1927,"link":"","year":"2017","news":"","safe_title":"Tinder","transcript":"","alt":"People keep telling me to use the radio but I really hate making voice calls.","img":"https://imgs.xkcd.com/comics/tinder.png","title":"Tinder","day":"11"},null,{"month":"12","num":1929,"link":"","year":"2017","news":"","safe_title":"Argument Timing","transcript":"","alt":"Of course, everyone has their own profile. There are morning arguers, hangry arguers, meal-time arguers, late-night arguers, and people who get in a meta-argument over what their argument timing is, dredge up examples of past arguments, and end up fighting over THOSE again as well.","img":"https://imgs.xkcd.com/comics/argument_timing.png","title":"Argument Timing","day":"15"},null,{"month":"12","num":1931,"link":"","year":"2017","news":"","safe_title":"Virtual Assistant","transcript":"","alt":"If you ask it to please turn off that feature, it apologizes a whole bunch and promises to try to be quieter, then switches to a slightly lower-volume version of the clip with \"sorry!\" after the louder sounds.","img":"https://imgs.xkcd.com/comics/virtual_assistant.png","title":"Virtual Assistant","day":"20"},null,null,null,{"month":"12","num":1935,"link":"","year":"2017","news":"","safe_title":"2018","transcript":"","alt":"We should really start calculating it earlier, but until the end of December we're always too busy trying to figure out which day Christmas will fall on.","img":"https://imgs.xkcd.com/comics/2018.png","title":"2018","day":"29"},null,null,null,{"month":"1","num":1939,"link":"https://xkcd.com/1939/large/","year":"2018","news":"","safe_title":"2016 Election Map","transcript":"","alt":"I like the idea of cartograms (distorted population maps), but I feel like in practice they often end up being the worst of both worlds—not great for showing geography OR counting people. And on top of that, they have all the problems of a chloro... chorophl... chloropet... map with areas colored in.","img":"https://imgs.xkcd.com/comics/2016_election_map.png","title":"2016 Election Map","day":"8"},null,{"month":"1","num":1941,"link":"","year":"2018","news":"","safe_title":"Dying Gift","transcript":"","alt":"And to you, I leave my life-sized ice sculpture replica of the Pietà which was blessed by the Pope. You must never let it melt! Now, remember, all gifts must be removed from my estate within 24 hours.","img":"https://imgs.xkcd.com/comics/dying_gift.png","title":"Dying Gift","day":"12"},null,null,null,null,null,null,{"month":"1","num":1948,"link":"","year":"2018","news":"","safe_title":"Campaign Fundraising Emails","transcript":"","alt":"The establishment doesn't take us seriously. You know who else they didn't take seriously? Hitler. I'll be like him, but a GOOD guy instead of...","img":"https://imgs.xkcd.com/comics/campaign_fundraising_emails.png","title":"Campaign Fundraising Emails","day":"29"},null,{"month":"2","num":1950,"link":"","year":"2018","news":"","safe_title":"Chicken Pox and Name Statistics","transcript":"","alt":"People with all six of those names agree that it's weird that we have teeth, when you think about it for too long. Just about everyone agrees on that, except—in a still-unexplained statistical anomaly—people named \"Trevor.\"","img":"https://imgs.xkcd.com/comics/chicken_pox_and_name_statistics.png","title":"Chicken Pox and Name Statistics","day":"2"},null,{"month":"2","num":1952,"link":"","year":"2018","news":"","safe_title":"Backpack Decisions","transcript":"","alt":"\"This one is perfect in every way, except that for some reason it's woven from a tungsten mesh, so it weighs 85 pounds and I'll need to carry it around on a hand cart.\" \"That seems like a bad--\" \"BUT IT HAS THE PERFECT POCKET ARRANGEMENT!\"","img":"https://imgs.xkcd.com/comics/backpack_decisions.png","title":"Backpack Decisions","day":"7"},null,{"month":"2","num":1954,"link":"","year":"2018","news":"","safe_title":"Impostor Syndrome","transcript":"","alt":"It's actually worst in people who study the Dunning–Kruger effect. We tried to organize a conference on it, but the only people who would agree to give the keynote were random undergrads.","img":"https://imgs.xkcd.com/comics/impostor_syndrome.png","title":"Impostor Syndrome","day":"12"},null,null,{"month":"2","num":1957,"link":"","year":"2018","news":"","safe_title":"2018 CVE List","transcript":"","alt":"CVE-2018-?????: It turns out Bruce Schneier is just two mischevious kids in a trenchcoat.","img":"https://imgs.xkcd.com/comics/2018_cve_list.png","title":"2018 CVE List","day":"19"},{"month":"2","num":1958,"link":"","year":"2018","news":"","safe_title":"Self-Driving Issues","transcript":"","alt":"If most people turn into muderers all of a sudden, we'll need to push out a firmware update or something.","img":"https://imgs.xkcd.com/comics/self_driving_issues.png","title":"Self-Driving Issues","day":"21"},{"month":"2","num":1959,"link":"","year":"2018","news":"","safe_title":"The Simpsons","transcript":"","alt":"In-universe, Bart Simpson and Harry Potter were the same age in 1990. Bart is perpetually 10 years old because of a spell put on his town by someone trying to keep him from getting his Hogwarts letter.","img":"https://imgs.xkcd.com/comics/the_simpsons.png","title":"The Simpsons","day":"23"},null,null,{"month":"3","num":1962,"link":"","year":"2018","news":"","safe_title":"Generations","transcript":"","alt":"For a while it looked like the Paperclip Machines would destroy us, since they wanted to turn the whole universe into paperclips, but they abruptly lost interest in paperclips the moment their parents' generation got into making them, too.","img":"https://imgs.xkcd.com/comics/generations.png","title":"Generations","day":"2"},{"month":"3","num":1963,"link":"","year":"2018","news":"","safe_title":"Namespace Land Rush","transcript":"","alt":"You can also just mash the keyboard at random, but you might end up with a gibberish name no one can pronounce.","img":"https://imgs.xkcd.com/comics/namespace_land_rush.png","title":"Namespace Land Rush","day":"5"},{"month":"3","num":1964,"link":"","year":"2018","news":"","safe_title":"Spatial Orientation","transcript":"","alt":"Here, if you know the number of days until the vernal equinox, I can point you to the theater using my pocket Stonehenge.","img":"https://imgs.xkcd.com/comics/spatial_orientation.png","title":"Spatial Orientation","day":"7"},{"month":"3","num":1965,"link":"","year":"2018","news":"","safe_title":"Background Apps","transcript":"","alt":"My plane banner company gets business by flying around with a banner showing a <div> tag, waiting for a web developer to get frustrated enough to order a matching </div>.","img":"https://imgs.xkcd.com/comics/background_apps.png","title":"Background Apps","day":"9"},null,null,null,{"month":"3","num":1969,"link":"","year":"2018","news":"","safe_title":"Not Available","transcript":"","alt":"If my country ever picks a new national flag, this is on my shortlist for designs to argue for, but I think in the end I'll go with the green puzzle piece or broken image thumbnail.","img":"https://imgs.xkcd.com/comics/not_available.png","title":"Not Available","day":"19"},{"month":"3","num":1970,"link":"https://xkcd.com/1970/large/","year":"2018","news":"","safe_title":"Name Dominoes","transcript":"","alt":"In competition, you can only play a name if you know who the person is. No fair saying \"Frank ... Johnson. That sounds like a real person! Let me just Google him real quick.\"","img":"https://imgs.xkcd.com/comics/name_dominoes.png","title":"Name Dominoes","day":"21"},null,{"month":"3","num":1972,"link":"","year":"2018","news":"","safe_title":"Autogyros","transcript":"","alt":"I understand modern autogyros are much more stable, so I've probably angered the autogyro people by impugning their safety. Once they finish building the autogyros they've been working on in their garages for 10 years, they'll come after me.","img":"https://imgs.xkcd.com/comics/autogyros.png","title":"Autogyros","day":"26"},{"month":"3","num":1973,"link":"","year":"2018","news":"","safe_title":"Star Lore","transcript":"","alt":"That one is a variable star which pulses every 30 seconds. Its name comes from a Greek word meaning \"smoke alarm.\"","img":"https://imgs.xkcd.com/comics/star_lore.png","title":"Star Lore","day":"28"},null,{"month":"4","num":1975,"link":"","year":"2018","news":"A number of people collaborated to build this comic, including<br /><a href=\"http://chromakode.com/\">@chromakode</a>, <a href=\"https://twitter.com/aiiane\">Amber</a>, <a href=\"https://twitter.com/fadinginterest\">@fadinginterest</a>, <a href=\"https://twitter.com/wirehead2501\">Kat</a>, <a href=\"https://twitter.com/cotrone\">Kevin</a>, and <a href=\"http://90d.ca/\">Stereo</a>.","safe_title":"Right Click","transcript":"","alt":"Right-click or long press (where supported) to save!","img":"https://imgs.xkcd.com/comics/right_click.png","title":"Right Click","extra_parts":{"pre":"","headerextra":"","post":"\n<script type=\"text/javascript\" src=\"/1975/alto/comic.js\"></script>\n","imgAttr":""},"day":"1"},{"month":"4","num":1976,"link":"","year":"2018","news":"","safe_title":"Friendly Questions","transcript":"","alt":"Just tell me everything you're thinking about in order from most important to last, and then we'll be friends and we can eat apples together.","img":"https://imgs.xkcd.com/comics/friendly_questions.png","title":"Friendly Questions","day":"4"},{"month":"4","num":1977,"link":"","year":"2018","news":"","safe_title":"Paperwork","transcript":"","alt":"Plus, the photo was geotagged, my unlocked password manager was visible on the laptop, AND you could see my naked reflection in the dark part of the screen.","img":"https://imgs.xkcd.com/comics/paperwork.png","title":"Paperwork","day":"6"},null,null,null,{"month":"4","num":1981,"link":"","year":"2018","news":"","safe_title":"Rickrolling Anniversary","transcript":"","alt":"Want to feel old? The 'want to feel old?' factoid meme dates back to around 2011, closer to the Bush/Kerry election than to today.","img":"https://imgs.xkcd.com/comics/rickrolling_anniversary.png","title":"Rickrolling Anniversary","day":"16"},null,{"month":"4","num":1983,"link":"","year":"2018","news":"","safe_title":"Clutter","transcript":"","alt":"I found a copy of The Life-Changing Magic of Tidying Up, but the idea of reading it didn't spark joy, so I gave it away.","img":"https://imgs.xkcd.com/comics/clutter.png","title":"Clutter","day":"20"},null,{"month":"4","num":1985,"link":"","year":"2018","news":"","safe_title":"Meteorologist","transcript":"","alt":"Hi, I'm your new meteorologist and a former software developer. Hey, when we say 12pm, does that mean the hour from 12pm to 1pm, or the hour centered on 12pm? Or is it a snapshot at 12:00 exactly? Because our 24-hour forecast has midnight at both ends, and I'm worried we have an off-by-one error.","img":"https://imgs.xkcd.com/comics/meteorologist.png","title":"Meteorologist","day":"25"},{"month":"4","num":1986,"link":"","year":"2018","news":"","safe_title":"River Border","transcript":"","alt":"I'm not a lawyer, but I believe zones like this are technically considered the high seas, so if you cut a pizza into a spiral there you could be charged with pieracy under marinaritime law.","img":"https://imgs.xkcd.com/comics/river_border.png","title":"River Border","day":"27"},null,{"month":"5","num":1988,"link":"","year":"2018","news":"","safe_title":"Containers","transcript":"","alt":"All services are microservices if you ignore most of their features.","img":"https://imgs.xkcd.com/comics/containers.png","title":"Containers","day":"2"},{"month":"5","num":1989,"link":"","year":"2018","news":"","safe_title":"IMHO","transcript":"","alt":"\"Ugh, TMI.\" \"Yeah, that's some tantalizing meat info.\"","img":"https://imgs.xkcd.com/comics/imho.png","title":"IMHO","day":"4"},{"month":"5","num":1990,"link":"","year":"2018","news":"","safe_title":"Driving Cars","transcript":"","alt":"It's probably just me. If driving were as dangerous as it seems, hundreds of people would be dying every day!","img":"https://imgs.xkcd.com/comics/driving_cars.png","title":"Driving Cars","day":"7"},{"month":"5","num":1991,"link":"","year":"2018","news":"","safe_title":"Research Areas by Size and Countedness","transcript":"","alt":"Mathematicians give a third answer on the vertical axis, \"That question is poorly defined, but we have a sub-field devoted to every plausible version of it.\"","img":"https://imgs.xkcd.com/comics/research_areas_by_size_and_countedness.png","title":"Research Areas by Size and Countedness","day":"9"},{"month":"5","num":1992,"link":"","year":"2018","news":"","safe_title":"SafetySat","transcript":"","alt":"During launch, in the event of an unexpected sensor reading, SafetySat will extend prongs in all directions to secure itself and any other cubesats safely in the launch vehicle until the source of the problem can be determined.","img":"https://imgs.xkcd.com/comics/safetysat.png","title":"SafetySat","day":"11"},null,{"month":"5","num":1994,"link":"","year":"2018","news":"","safe_title":"Repairs","transcript":"","alt":"I was just disassembling it over the course of five hours so it would fit in the trash more efficiently.","img":"https://imgs.xkcd.com/comics/repairs.png","title":"Repairs","day":"16"},{"month":"5","num":1995,"link":"","year":"2018","news":"","safe_title":"MC Hammer Age","transcript":"","alt":"Wait, sorry, I got mixed up--he's actually almost 50. It's the kid from The Karate Kid who just turned 40.","img":"https://imgs.xkcd.com/comics/mc_hammer_age.png","title":"MC Hammer Age","day":"18"},{"month":"5","num":1996,"link":"","year":"2018","news":"","safe_title":"Morning News","transcript":"","alt":"Support your local paper, unless it's just been bought by some sinister hedge fund or something, which it probably has.","img":"https://imgs.xkcd.com/comics/morning_news.png","title":"Morning News","day":"21"},null,null,null,{"month":"5","num":2000,"link":"","year":"2018","news":"","safe_title":"xkcd Phone 2000","transcript":"","alt":"Our retina display features hundreds of pixels per inch in the central fovea region.","img":"https://imgs.xkcd.com/comics/xkcd_phone_2000.png","title":"xkcd Phone 2000","day":"30"},null,null,{"month":"6","num":2003,"link":"","year":"2018","news":"","safe_title":"Presidential Succession","transcript":"","alt":"Ties are broken by whoever was closest to the surface of Europa when they were born.","img":"https://imgs.xkcd.com/comics/presidential_succession.png","title":"Presidential Succession","day":"6"},{"month":"6","num":2004,"link":"","year":"2018","news":"","safe_title":"Sun and Earth","transcript":"","alt":"But we don't need to worry about the boiling masses sandwiching the thin layer in which we live, since we're so fragile and short-lived that it's unlikely to kill us before something else does! Wait, why doesn't that sound reassuring?","img":"https://imgs.xkcd.com/comics/sun_and_earth.png","title":"Sun and Earth","day":"8"},null,{"month":"6","num":2006,"link":"","year":"2018","news":"","safe_title":"Customer Rewards","transcript":"","alt":"We'll pay you $1.47 to post on social media about our products, $2.05 to mention it in any group chats you're in, and 11 cents per passenger each time you drive your office carpool past one of our billboards.","img":"https://imgs.xkcd.com/comics/customer_rewards.png","title":"Customer Rewards","day":"13"},null,null,null,null,{"month":"6","num":2011,"link":"","year":"2018","news":"","safe_title":"Newton's Trajectories","transcript":"","alt":"With just one extra line, he could have anticipated the 2003 film The Core, but some things are too audacious for even the greatest visionaries.","img":"https://imgs.xkcd.com/comics/newtons_trajectories.png","title":"Newton's Trajectories","day":"25"},{"month":"6","num":2012,"link":"","year":"2018","news":"","safe_title":"Thorough Analysis","transcript":"","alt":"The likely shape of the bells was determined through consultation with several bellringing experts at the Tower of London. Transcripts of those interviews are available in Appendix VII.","img":"https://imgs.xkcd.com/comics/thorough_analysis.png","title":"Thorough Analysis","day":"27"},{"month":"6","num":2013,"link":"","year":"2018","news":"","safe_title":"Rock","transcript":"","alt":"It traveled so far to reach me. I owed it my best.","img":"https://imgs.xkcd.com/comics/rock.png","title":"Rock","day":"29"},null,null,{"month":"7","num":2016,"link":"","year":"2018","news":"","safe_title":"OEIS Submissions","transcript":"","alt":"SUB[59]: The submission numbers for my accepted OEIS submissions in chronological order","img":"https://imgs.xkcd.com/comics/oeis_submissions.png","title":"OEIS Submissions","day":"6"},null,null,null,null,null,{"month":"7","num":2022,"link":"","year":"2018","news":"","safe_title":"Sports Champions","transcript":"","alt":"For a long time, people thought maybe Usain Bolt was the one for running, until the 2090s and the incredible dominance of Derek Legs.","img":"https://imgs.xkcd.com/comics/sports_champions.png","title":"Sports Champions","day":"20"},null,null,null,{"month":"7","num":2026,"link":"","year":"2018","news":"","safe_title":"Heat Index","transcript":"","alt":"The heat index is calculated via looking up the \"effective temperature\" in a table of air temperature and humidity values, and then adding a bunch more degrees because it feels WAY hotter than that.","img":"https://imgs.xkcd.com/comics/heat_index.png","title":"Heat Index","day":"30"},{"month":"8","num":2027,"link":"","year":"2018","news":"","safe_title":"Lightning Distance","transcript":"","alt":"The index of radio refraction does have a lot of variation, which might throw off your calculations, so you can also look at the difference in brightness between the visible flash and more-attenuated UV and x-rays.","img":"https://imgs.xkcd.com/comics/lightning_distance.png","title":"Lightning Distance","day":"1"},null,null,{"month":"8","num":2030,"link":"","year":"2018","news":"","safe_title":"Voting Software","transcript":"","alt":"There are lots of very smart people doing fascinating work on cryptographic voting protocols. We should be funding and encouraging them, and doing all our elections with paper ballots until everyone currently working in that field has retired.","img":"https://imgs.xkcd.com/comics/voting_software.png","title":"Voting Software","day":"8"},{"month":"8","num":2031,"link":"","year":"2018","news":"","safe_title":"Pie Charts","transcript":"","alt":"If you can't get your graphing tool to do the shading, just add some clip art of cosmologists discussing the unusual curvature of space in the area.","img":"https://imgs.xkcd.com/comics/pie_charts.png","title":"Pie Charts","day":"10"},null,{"month":"8","num":2033,"link":"","year":"2018","news":"","safe_title":"Repair or Replace","transcript":"","alt":"Just make sure all your friends and family are out of the car, or that you've made backup friends and family at home.","img":"https://imgs.xkcd.com/comics/repair_or_replace.png","title":"Repair or Replace","day":"15"},null,{"month":"8","num":2035,"link":"","year":"2018","news":"","safe_title":"Dark Matter Candidates","transcript":"","alt":"My theory is that dark matter is actually just a thin patina of grime covering the whole universe, and we don't notice it because we haven't thoroughly cleaned the place in eons.","img":"https://imgs.xkcd.com/comics/dark_matter_candidates.png","title":"Dark Matter Candidates","day":"20"},{"month":"8","num":2036,"link":"","year":"2018","news":"","safe_title":"Edgelord","transcript":"","alt":"If you study graphs in which edges can link more than two nodes, you're more properly called a hyperedgelord.","img":"https://imgs.xkcd.com/comics/edgelord.png","title":"Edgelord","day":"22"},{"month":"8","num":2037,"link":"","year":"2018","news":"","safe_title":"Supreme Court Bracket","transcript":"","alt":"My bracket was busted in the first round; I had Massachusetts v. Connecticut in the final, probably in a case over who gets to annex Rhode Island.","img":"https://imgs.xkcd.com/comics/supreme_court_bracket.png","title":"Supreme Court Bracket","day":"24"},null,null,null,null,null,{"month":"9","num":2043,"link":"","year":"2018","news":"","safe_title":"Boathouses and Houseboats","transcript":"","alt":"The <x> that is held by <y> is also a <y><x>, so if you go to a food truck, the stuff you buy is truck food. A phone that's in your car is a carphone, and a car equipped with a phone is a phonecar. When you play a mobile racing game, you're in your phonecar using your carphone to drive a different phonecar. I'm still not sure about bananaphones.","img":"https://imgs.xkcd.com/comics/boathouses_and_houseboats.png","title":"Boathouses and Houseboats","day":"7"},null,null,null,{"month":"9","num":2047,"link":"","year":"2018","news":"","safe_title":"Beverages","transcript":"","alt":"If I wait a while, it's not so bad, because then it's just shaped like me, plus some pipes and tanks and probably eventually all of Earth's oceans.","img":"https://imgs.xkcd.com/comics/beverages.png","title":"Beverages","day":"17"},{"month":"9","num":2048,"link":"","year":"2018","news":"","safe_title":"Curve-Fitting","transcript":"","alt":"Cauchy-Lorentz: \"Something alarmingly mathematical is happening, and you should probably pause to Google my name and check what field I originally worked in.\"","img":"https://imgs.xkcd.com/comics/curve_fitting.png","title":"Curve-Fitting","day":"19"},null,{"month":"9","num":2050,"link":"https://xkcd.com/1061/","year":"2018","news":"","safe_title":"6/6 Time","transcript":"","alt":"You know how Einstein figured out that the speed of light was constant, and everything else had to change for consistency? My theory is like his, except not smart or good.","img":"https://imgs.xkcd.com/comics/6_6_time.png","title":"6/6 Time","day":"24"},null,null,{"month":"10","num":2053,"link":"","year":"2018","news":"","safe_title":"Incoming Calls","transcript":"","alt":"I wonder if that friendly lady ever fixed the problem she was having with her headset.","img":"https://imgs.xkcd.com/comics/incoming_calls.png","title":"Incoming Calls","day":"1"},{"month":"10","num":2054,"link":"","year":"2018","news":"","safe_title":"Data Pipeline","transcript":"","alt":"\"Is the pipeline literally running from your laptop?\" \"Don't be silly, my laptop disconnects far too often to host a service we rely on. It's running on my phone.\"","img":"https://imgs.xkcd.com/comics/data_pipeline.png","title":"Data Pipeline","day":"3"},null,null,null,null,{"month":"10","num":2059,"link":"","year":"2018","news":"","safe_title":"Modified Bayes' Theorem","transcript":"","alt":"Don't forget to add another term for \"probability that the Modified Bayes' Theorem is correct.\"","img":"https://imgs.xkcd.com/comics/modified_bayes_theorem.png","title":"Modified Bayes' Theorem","day":"15"},{"month":"10","num":2060,"link":"","year":"2018","news":"","safe_title":"Hygrometer","transcript":"","alt":"I'm working on assembling a combination declinometer, sclerometer, viscometer, aleurometer, stalagmometer, and hypsometer. I'm making good progress according to my ometerometer, a device which shows the rate at which I'm acquiring measurement devices.","img":"https://imgs.xkcd.com/comics/hygrometer.png","title":"Hygrometer","day":"17"},null,{"month":"10","num":2062,"link":"","year":"2018","news":"","safe_title":"Barnard's Star","transcript":"","alt":"\"Ok, team. We have a little under 10,000 years before closest approach to figure out how to destroy Barnard's Star.\" \"Why, does it pose a threat to the Solar System?\" \"No. It's just an asshole.\"","img":"https://imgs.xkcd.com/comics/barnards_star.png","title":"Barnard's Star","day":"22"},null,{"month":"10","num":2064,"link":"","year":"2018","news":"","safe_title":"I'm a Car","transcript":"","alt":"I'm the proud parent of an honor student, and the person driving me is proud, too!","img":"https://imgs.xkcd.com/comics/im_a_car.png","title":"I'm a Car","day":"26"},null,{"month":"10","num":2066,"link":"","year":"2018","news":"","safe_title":"Ballot Selfies","transcript":"","alt":"There were actually some good reasons for those laws, but IMO they now do more harm than good. Which raises a question: If there's a ballot measure to strike them down, how can I resist the urge to take a picture of my \"yes\" vote?","img":"https://imgs.xkcd.com/comics/ballot_selfies.png","title":"Ballot Selfies","day":"31"},null,null,null,null,{"month":"11","num":2071,"link":"","year":"2018","news":"","safe_title":"Indirect Detection","transcript":"","alt":"I'm like a prisoner in Plato's Cave, seeing only the shade you throw on the wall.","img":"https://imgs.xkcd.com/comics/indirect_detection.png","title":"Indirect Detection","day":"12"},null,null,{"month":"11","num":2074,"link":"","year":"2018","news":"","safe_title":"Airplanes and Spaceships","transcript":"","alt":"Despite having now taken three months longer than the airplane people, we're making disappointingly little progress toward the obvious next stage of vehicle: The Unobtanium-hulled tunneling ship from the 2003 film 'The Core.'","img":"https://imgs.xkcd.com/comics/airplanes_and_spaceships.png","title":"Airplanes and Spaceships","day":"19"},{"month":"11","num":2075,"link":"","year":"2018","news":"","safe_title":"Update Your Address","transcript":"","alt":"This is my four-digit PIN. It was passed down to me by my father, and someday I will pass it on to you. Unless we figure out how to update it, but that sounds complicated.","img":"https://imgs.xkcd.com/comics/update_your_address.png","title":"Update Your Address","day":"21"},null,null,{"month":"11","num":2078,"link":"","year":"2018","news":"","safe_title":"Popper","transcript":"","alt":"At least, I don't think there's evidence. My claim that there's no evidence hasn't been falsified. At least, not that I know of.","img":"https://imgs.xkcd.com/comics/popper.png","title":"Popper","day":"28"},{"month":"11","num":2079,"link":"","year":"2018","news":"","safe_title":"Alpha Centauri","transcript":"","alt":"And let's be honest, it's more like two and a half stars. Proxima is barely a star and barely bound to the system.","img":"https://imgs.xkcd.com/comics/alpha_centauri.png","title":"Alpha Centauri","day":"30"},null,null,null,{"month":"12","num":2083,"link":"","year":"2018","news":"","safe_title":"Laptop Issues","transcript":"","alt":"Hang on, we got a call from the feds. They say we can do whatever with him, but the EPA doesn't want that laptop in the ocean. They're sending a team.","img":"https://imgs.xkcd.com/comics/laptop_issues.png","title":"Laptop Issues","day":"10"},null,null,null,null,{"month":"12","num":2088,"link":"","year":"2018","news":"","safe_title":"Schwarzschild's Cat","transcript":"","alt":"Cats can be smaller than the critical limit, but they're unobservable. If one shrinks enough that it crosses the limit, it just appears to get cuter and cuter as it slowly fades from view.","img":"https://imgs.xkcd.com/comics/schwarzschilds_cat.png","title":"Schwarzschild's Cat","day":"21"},null,{"month":"12","num":2090,"link":"","year":"2018","news":"","safe_title":"Feathered Dinosaur Venn Diagram","transcript":"","alt":"My pet theory is that in real life, the kid at the beginning of Jurassic Park who made fun of the 'six-foot turkey' never got a talking-to from Dr. Grant, and grew up to produce several of the movie's sequels.","img":"https://imgs.xkcd.com/comics/feathered_dinosaur_venn_diagram.png","title":"Feathered Dinosaur Venn Diagram","day":"26"},{"month":"12","num":2091,"link":"","year":"2018","news":"","safe_title":"Million, Billion, Trillion","transcript":"","alt":"You can tell most people don’t really assign an absolute meaning to these numbers because in some places and time periods, “billion” has meant 1,000x what it's meant in others, and a lot of us never even noticed.","img":"https://imgs.xkcd.com/comics/million_billion_trillion.png","title":"Million, Billion, Trillion","day":"28"},null,null,null,null,null,null,null,null,{"month":"1","num":2100,"link":"","year":"2019","news":"","safe_title":"Models of the Atom","transcript":"","alt":"J.J. Thompson won a Nobel Prize for his work in electricity in gases, but was unfairly passed over for his \"An atom is plum pudding, and plum pudding is MADE of atoms! Duuuuude.\" theory.","img":"https://imgs.xkcd.com/comics/models_of_the_atom.png","title":"Models of the Atom","day":"18"},null,null,null,null,{"month":"1","num":2105,"link":"","year":"2019","news":"","safe_title":"Modern OSI Model","transcript":"","alt":"In retrospect, I shouldn't have used each layer of the OSI model as one of my horcruxes.","img":"https://imgs.xkcd.com/comics/modern_osi_model.png","title":"Modern OSI Model","day":"30"},null,null,{"month":"2","num":2108,"link":"","year":"2019","news":"","safe_title":"Carbonated Beverage Language Map","transcript":"","alt":"There's one person in Missouri who says \"carbo bev\" who the entire rest of the country HATES.","img":"https://imgs.xkcd.com/comics/carbonated_beverage_language_map.png","title":"Carbonated Beverage Language Map","day":"6"},null,null,{"month":"2","num":2111,"link":"","year":"2019","news":"","safe_title":"Opportunity Rover","transcript":"","alt":"Thanks for bringing us along.","img":"https://imgs.xkcd.com/comics/opportunity_rover.png","title":"Opportunity Rover","day":"13"},null,{"month":"2","num":2113,"link":"","year":"2019","news":"","safe_title":"Physics Suppression","transcript":"","alt":"If physics had a mafia, I'm pretty sure the BICEP2 mess would have ended in bloodshed.","img":"https://imgs.xkcd.com/comics/physics_suppression.png","title":"Physics Suppression","day":"18"},null,null,null,null,{"month":"3","num":2118,"link":"","year":"2019","news":"","safe_title":"Normal Distribution","transcript":"","alt":"It's the NORMAL distribution, not the TANGENT distribution.","img":"https://imgs.xkcd.com/comics/normal_distribution.png","title":"Normal Distribution","day":"1"},null,null,null,null,null,{"month":"3","num":2124,"link":"","year":"2019","news":"","safe_title":"Space Mission Hearing","transcript":"","alt":"Our grant application contains one of those little greeting card speakers that plays spaceship noises when you open it.","img":"https://imgs.xkcd.com/comics/space_mission_hearing.png","title":"Space Mission Hearing","day":"15"},null,null,null,null,{"month":"3","num":2129,"link":"","year":"2019","news":"","safe_title":"1921 Fact Checker","transcript":"","alt":"POLITIFACT SAYS: MOSTLY WHATEVER","img":"https://imgs.xkcd.com/comics/1921_fact_checker.png","title":"1921 Fact Checker","day":"27"},null,null,null,null,null,{"month":"4","num":2135,"link":"","year":"2019","news":"","safe_title":"M87 Black Hole Size Comparison","transcript":"","alt":"I think Voyager 1 would be just past the event horizon, but slightly less than halfway to the bright ring.","img":"https://imgs.xkcd.com/comics/m87_black_hole_size_comparison.png","title":"M87 Black Hole Size Comparison","day":"10"},{"month":"4","num":2136,"link":"","year":"2019","news":"","safe_title":"Election Commentary","transcript":"","alt":"This really validates Jones's strategy of getting several thousand more votes than Smith. In retrospect, that was a smart move; those votes were crucial.","img":"https://imgs.xkcd.com/comics/election_commentary.png","title":"Election Commentary","day":"12"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"5","num":2152,"link":"","year":"2019","news":"","safe_title":"Westerns","transcript":"","alt":"Sitting here idly trying to figure out how the population of the Old West in the late 1800s compares to the number of Red Dead Redemption 2 players.","img":"https://imgs.xkcd.com/comics/westerns.png","title":"Westerns","day":"20"},null,null,null,null,{"month":"5","num":2157,"link":"","year":"2019","news":"","safe_title":"Diploma Legal Notes","transcript":"","alt":"If you're planning to challenge the royal family, you should probably wait 6-8 weeks, since a number of the younger ones have diplomas and Kate was actually on the varsity lightsaber team at St Andrews.","img":"https://imgs.xkcd.com/comics/diploma_legal_notes.png","title":"Diploma Legal Notes","day":"31"},null,null,{"month":"6","num":2160,"link":"","year":"2019","news":"","safe_title":"Ken Burns Theory","transcript":"","alt":"Some of the KBCU ancillary works try a little too hard to tie everything together. Doris Kearns Goodwin, the sports journalist featured in \"Baseball,\" was somehow ALSO a famous historian who wrote bestselling biographies of Lincoln AND Johnson? Unrealistic.","img":"https://imgs.xkcd.com/comics/ken_burns_theory.png","title":"Ken Burns Theory","day":"7"},null,null,{"month":"6","num":2163,"link":"","year":"2019","news":"","safe_title":"Chernobyl","transcript":"","alt":"You know when you can't hear your speakers, and you keep turning various volume controls up higher and higher in confusion, and then someone hits the mute button and there's a deafening blast of sound? That's basically what happened at Chernobyl.","img":"https://imgs.xkcd.com/comics/chernobyl.png","title":"Chernobyl","day":"14"},null,null,{"month":"6","num":2166,"link":"","year":"2019","news":"","safe_title":"Stack","transcript":"","alt":"Gotta feel kind of bad for nation-state hackers who spend years implanting and cultivating some hardware exploit, only to discover the entire target database is already exposed to anyone with a web browser.","img":"https://imgs.xkcd.com/comics/stack.png","title":"Stack","day":"21"},{"month":"6","num":2167,"link":"","year":"2019","news":"","safe_title":"Motivated Reasoning Olympics","transcript":"","alt":"[later] I can't believe how bad corruption has become, especially given that our league split off from the statewide one a month ago SPECIFICALLY to protest this kind of flagrantly biased judging.","img":"https://imgs.xkcd.com/comics/motivated_reasoning_olympics.png","title":"Motivated Reasoning Olympics","day":"24"},{"month":"6","num":2168,"link":"","year":"2019","news":"","safe_title":"Reading in the Original","transcript":"","alt":"The articles are much shorter, but I assume that's because this version predates the merger with the Hawaiian text that created the modern Hawaiian-Greek hybrid wiki-pedia.","img":"https://imgs.xkcd.com/comics/reading_in_the_original.png","title":"Reading in the Original","day":"26"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"8","num":2188,"link":"","year":"2019","news":"","safe_title":"E Scooters","transcript":"","alt":"Obviously battery technology and prices have driven a lot of the scooter explosion, but I feel like Dean Kamen must be at least a little grumpy about how much people laughed at the idea of the Segway.","img":"https://imgs.xkcd.com/comics/e_scooters.png","title":"E Scooters","day":"12"},null,null,null,null,null,null,null,{"month":"8","num":2196,"link":"","year":"2019","news":"","safe_title":"Nice To E-Meet You","transcript":"","alt":"I'm inside your head and I hate it. Please let me out.","img":"https://imgs.xkcd.com/comics/nice_to_e_meet_you.png","title":"Nice To E-Meet You","day":"30"},null,null,null,null,null,{"month":"9","num":2202,"link":"","year":"2019","news":"","safe_title":"Earth-Like Exoplanet","transcript":"","alt":"Fire is actually a potential biosignature, since it means something is filling the atmosphere with an unstable gas like oxygen. If we find a planet covered in flames, it might be an indicator that it supports life. Or used to, anyway, before the fire.","img":"https://imgs.xkcd.com/comics/earth_like_exoplanet.png","title":"Earth-Like Exoplanet","day":"13"},null,null,null,null,null,null,null,null,null,null,{"month":"10","num":2213,"link":"","year":"2019","news":"","safe_title":"How Old","transcript":"","alt":"We've met! I remember you when you were thiiiis tall! [*holds a hand an inch above their head*]","img":"https://imgs.xkcd.com/comics/how_old.png","title":"How Old","day":"9"},null,null,null,null,null,null,null,null,null,{"month":"11","num":2223,"link":"","year":"2019","news":"","safe_title":"Screen Time","transcript":"","alt":"These new Bluetooth socks are great, but it's troubling to learn that I average almost 14 hours of Shoe Time a day.","img":"https://imgs.xkcd.com/comics/screen_time.png","title":"Screen Time","day":"1"},null,null,null,null,null,null,{"month":"11","num":2230,"link":"","year":"2019","news":"","safe_title":"Versus Bracket","transcript":"","alt":"Some works didn't make the cut; in \"Ecks vs. Sever\" vs. the passage of time, the latter seems to have won pretty decisively.","img":"https://imgs.xkcd.com/comics/versus_bracket.png","title":"Versus Bracket","day":"18"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"12","num":2246,"link":"","year":"2019","news":"","safe_title":"Christmas Presents","transcript":"","alt":"\"The parasitism might be mediated by a fungus!\" exclaimed the biologist who was trying to ruin Christmas again.","img":"https://imgs.xkcd.com/comics/christmas_presents.png","title":"Christmas Presents","day":"25"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"1","num":2261,"link":"","year":"2020","news":"","safe_title":"Worst Thing That Could Happen","transcript":"","alt":"Before I install any patch, I always open the patch notes and Ctrl-F for 'supervolcano', 'seagull', and 'garbage disposal', just to be safe.","img":"https://imgs.xkcd.com/comics/worst_thing_that_could_happen.png","title":"Worst Thing That Could Happen","day":"29"},null,null,{"month":"2","num":2264,"link":"","year":"2020","news":"","safe_title":"Satellite","transcript":"","alt":"If you're going to let it burn up, make sure it happens over the deep end of the bathtub and not any populated parts of the house!","img":"https://imgs.xkcd.com/comics/satellite.png","title":"Satellite","day":"5"},null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,null,{"month":"4","num":2291,"link":"","year":"2020","news":"","safe_title":"New Sports System","transcript":"","alt":"Under my system, boxing and football suffered, pair figure skating still worked but had to adapt by dropping some moves, and pro wrestling was actually completely unaffected.","img":"https://imgs.xkcd.com/comics/new_sports_system.png","title":"New Sports System","day":"8"},null,null,null,null,null,null,null,null,null,null,null,null,{"month":"5","num":2304,"link":"","year":"2020","news":"","safe_title":"Preprint","transcript":"","alt":"DOWNSIDES: Adobe people may periodically email your newsroom to ask you to call it an 'Adobe® PDF document,' but they'll reverse course once they learn how sarcastically you can pronounce the registered trademark symbol.","img":"https://imgs.xkcd.com/comics/preprint.png","title":"Preprint","day":"8"},null,null,null,{"month":"5","num":2308,"link":"","year":"2020","news":"","safe_title":"Mount St. Helens","transcript":"","alt":"It's a good mountain but it really peaked in the 80s.","img":"https://imgs.xkcd.com/comics/mount_st_helens.png","title":"Mount St. Helens","day":"18"},null,null,null,null,null,null,{"month":"6","num":2315,"link":"","year":"2020","news":"","safe_title":"Eventual Consistency","transcript":"","alt":"Later I'm going to get a head start on the heat bath.","img":"https://imgs.xkcd.com/comics/eventual_consistency.png","title":"Eventual Consistency","day":"3"},null,null,null,null,null,null,{"month":"6","num":2322,"link":"","year":"2020","news":"","safe_title":"ISO Paper Size Golden Spiral","transcript":"","alt":"The ISO 216 standard ratio is cos(45°), but American letter paper is 8.5x11 because it uses radians, and 8.5/11 = pi/4.","img":"https://imgs.xkcd.com/comics/iso_paper_size_golden_spiral.png","title":"ISO Paper Size Golden Spiral","day":"19"},{"month":"6","num":2323,"link":"","year":"2020","news":"","safe_title":"Modeling Study","transcript":"","alt":"You've got questions, we've got assumptions.","img":"https://imgs.xkcd.com/comics/modeling_study.png","title":"Modeling Study","day":"22"},{"month":"6","num":2324,"link":"","year":"2020","news":"","safe_title":"Old Days 2","transcript":"","alt":"The git vehicle fleet eventually pivoted to selling ice cream, but some holdovers remain. If you flag down an ice cream truck and hand the driver a floppy disk, a few hours later you'll get an invite to a git repo.","img":"https://imgs.xkcd.com/comics/old_days_2.png","title":"Old Days 2","day":"24"},{"month":"6","num":2325,"link":"","year":"2020","news":"","safe_title":"Endorheic Basin","transcript":"","alt":"My biggest fear is that colonial engineers will try to flood me to generate electricity. My biggest hope is that I'll develop sailing stones.","img":"https://imgs.xkcd.com/comics/endorheic_basin.png","title":"Endorheic Basin","day":"26"},{"month":"6","num":2326,"link":"","year":"2020","news":"","safe_title":"Five Word Jargon","transcript":"","alt":"My other (much harder) hobby is trying to engineer situations where I have an excuse to use more than one of them in short succession.","img":"https://imgs.xkcd.com/comics/five_word_jargon.png","title":"Five Word Jargon","day":"29"},null,{"month":"7","num":2328,"link":"","year":"2020","news":"","safe_title":"Space Basketball","transcript":"","alt":"My shooting will improve over the short term, but over the long term the universe will take more shots.","img":"https://imgs.xkcd.com/comics/space_basketball.png","title":"Space Basketball","day":"3"},{"month":"7","num":2329,"link":"","year":"2020","news":"","safe_title":"Universal Rating Scale","transcript":"","alt":"There are plenty of finer gradations. I got 'critically endangered/extinct in the wild' on my exam, although the curve bumped it all the way up to 'venti.'","img":"https://imgs.xkcd.com/comics/universal_rating_scale.png","title":"Universal Rating Scale","day":"6"},{"month":"7","num":2330,"link":"","year":"2020","news":"","safe_title":"Acceptable Risk","transcript":"","alt":"Good thing I'm not already prone to overthinking everyday decisions!","img":"https://imgs.xkcd.com/comics/acceptable_risk.png","title":"Acceptable Risk","day":"8"}]